/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const __WORDSIZE: u32 = 32;
pub const __GLIBC_HAVE_LONG_LONG: u32 = 1;
pub type undefined = ::core::ffi::c_uchar;
pub type bool_ = ::core::ffi::c_uchar;
pub type byte = ::core::ffi::c_uchar;
pub type dword = ::core::ffi::c_uint;
pub type longlong = ::core::ffi::c_longlong;
pub type qword = ::core::ffi::c_ulonglong;
pub type uchar = ::core::ffi::c_uchar;
pub type uint = ::core::ffi::c_uint;
pub type uint16 = ::core::ffi::c_ulonglong;
pub type uint3 = ::core::ffi::c_uint;
pub type ulong = ::core::ffi::c_ulong;
pub type ulonglong = ::core::ffi::c_ulonglong;
pub type undefined1 = ::core::ffi::c_uchar;
pub type undefined2 = ::core::ffi::c_ushort;
pub type undefined3 = ::core::ffi::c_uint;
pub type undefined4 = ::core::ffi::c_uint;
pub type undefined7 = ::core::ffi::c_ulonglong;
pub type undefined8 = ::core::ffi::c_ulonglong;
pub type ushort = ::core::ffi::c_ushort;
pub type word = ::core::ffi::c_ushort;
pub type PSeesawState = *mut SeesawState;
pub type f32_ = f32;
pub type Mtx = [[f32_; 4usize]; 3usize];
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SeesawState {
    pub angle: f32,
    pub prev_angle: f32,
    pub angle_vel: f32,
    pub sensitivity: f32,
    pub friction: f32,
    pub spring: f32,
    pub inv_transform: Mtx,
    pub transform: Mtx,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SeesawState"][::core::mem::size_of::<SeesawState>() - 120usize];
    ["Alignment of SeesawState"][::core::mem::align_of::<SeesawState>() - 1usize];
    ["Offset of field: SeesawState::angle"][::core::mem::offset_of!(SeesawState, angle) - 0usize];
    ["Offset of field: SeesawState::prev_angle"]
        [::core::mem::offset_of!(SeesawState, prev_angle) - 4usize];
    ["Offset of field: SeesawState::angle_vel"]
        [::core::mem::offset_of!(SeesawState, angle_vel) - 8usize];
    ["Offset of field: SeesawState::sensitivity"]
        [::core::mem::offset_of!(SeesawState, sensitivity) - 12usize];
    ["Offset of field: SeesawState::friction"]
        [::core::mem::offset_of!(SeesawState, friction) - 16usize];
    ["Offset of field: SeesawState::spring"]
        [::core::mem::offset_of!(SeesawState, spring) - 20usize];
    ["Offset of field: SeesawState::inv_transform"]
        [::core::mem::offset_of!(SeesawState, inv_transform) - 24usize];
    ["Offset of field: SeesawState::transform"]
        [::core::mem::offset_of!(SeesawState, transform) - 72usize];
};
pub const APE_AIAI: _bindgen_ty_1 = 0;
pub const APE_MEEMEE: _bindgen_ty_1 = 1;
pub const APE_BABY: _bindgen_ty_1 = 2;
pub const APE_GONGON: _bindgen_ty_1 = 3;
pub const APE_MADH: _bindgen_ty_1 = 4;
pub const APE_KOBUN: _bindgen_ty_1 = 5;
pub const APE_MALE: _bindgen_ty_1 = 6;
pub const APE_FEMALE: _bindgen_ty_1 = 7;
pub const APE_JIJI: _bindgen_ty_1 = 8;
pub const APE_BABA: _bindgen_ty_1 = 9;
pub const APE_MADSPA: _bindgen_ty_1 = 10;
pub const APE_MADFRG: _bindgen_ty_1 = 11;
pub const APE_MADNKD: _bindgen_ty_1 = 12;
pub const APE_ROB: _bindgen_ty_1 = 13;
pub const APE_WHALE: _bindgen_ty_1 = 14;
pub const APE_MADCRS: _bindgen_ty_1 = 15;
pub const APE_KOBSPA: _bindgen_ty_1 = 16;
pub type _bindgen_ty_1 = ::core::ffi::c_uint;
pub type ApeCharacter = undefined4;
pub const DIFF_BEGINNER: _bindgen_ty_2 = 0;
pub const DIFF_ADVANCED: _bindgen_ty_2 = 1;
pub const DIFF_EXPERT: _bindgen_ty_2 = 2;
pub type _bindgen_ty_2 = ::core::ffi::c_uint;
pub type Difficulty = undefined4;
pub const G_STORY_LEVEL_SELECT_NO_BACKGROUND: _bindgen_ty_3 = 0;
pub const G_LAVA_NO_BACKGROUND: _bindgen_ty_3 = 1;
pub const JUNGLE1: _bindgen_ty_3 = 2;
pub const WATER1: _bindgen_ty_3 = 3;
pub const NIGHT: _bindgen_ty_3 = 4;
pub const SKY: _bindgen_ty_3 = 5;
pub const SPACE1: _bindgen_ty_3 = 6;
pub const SAND: _bindgen_ty_3 = 7;
pub const ICE: _bindgen_ty_3 = 8;
pub const STORM: _bindgen_ty_3 = 9;
pub const BONUS1: _bindgen_ty_3 = 10;
pub const TARGET1: _bindgen_ty_3 = 11;
pub const G_CONTINUE_A: _bindgen_ty_3 = 12;
pub const G_CONTINUE_B: _bindgen_ty_3 = 13;
pub const G_FIGHT2: _bindgen_ty_3 = 14;
pub const MASTER: _bindgen_ty_3 = 15;
pub const G_ENDING: _bindgen_ty_3 = 16;
pub const LAVA: _bindgen_ty_3 = 17;
pub const WATER2: _bindgen_ty_3 = 18;
pub const JUNGLE2: _bindgen_ty_3 = 19;
pub const PARK: _bindgen_ty_3 = 20;
pub const POT: _bindgen_ty_3 = 21;
pub const SPACE2: _bindgen_ty_3 = 22;
pub const ELECTRIC: _bindgen_ty_3 = 23;
pub const GEAR: _bindgen_ty_3 = 24;
pub const BUBBLY: _bindgen_ty_3 = 25;
pub const BONUS2: _bindgen_ty_3 = 26;
pub const SOCCER: _bindgen_ty_3 = 27;
pub const BOWLING2: _bindgen_ty_3 = 28;
pub const TARGET2: _bindgen_ty_3 = 29;
pub const BILLIARDS2: _bindgen_ty_3 = 30;
pub const BOAT: _bindgen_ty_3 = 31;
pub const WHALE: _bindgen_ty_3 = 32;
pub const GOLF: _bindgen_ty_3 = 33;
pub const POT_FIGHT: _bindgen_ty_3 = 34;
pub const VILLAGE_STORY: _bindgen_ty_3 = 35;
pub const BUBBLY_STORY: _bindgen_ty_3 = 36;
pub const PARK_STORY: _bindgen_ty_3 = 37;
pub const GEAR_STORY: _bindgen_ty_3 = 38;
pub const UNDERWATER_STORY: _bindgen_ty_3 = 39;
pub const WATER_SURFACE_STORY: _bindgen_ty_3 = 40;
pub const BOWLING_STORY: _bindgen_ty_3 = 41;
pub type _bindgen_ty_3 = ::core::ffi::c_uint;
pub type WorldTheme = undefined2;
pub type PGoalTape = *mut GoalTape;
pub type s32 = ::core::ffi::c_long;
pub type PStobj = *mut Stobj;
pub type PPhysicsBall = *mut PhysicsBall;
pub const STOBJ_BUMPER: _bindgen_ty_4 = 0;
pub const STOBJ_JAMABAR: _bindgen_ty_4 = 1;
pub const STOBJ_GOALTAPE: _bindgen_ty_4 = 2;
pub const STOBJ_GOALBAG: _bindgen_ty_4 = 3;
pub const STOBJ_GOALBAG_EXMASTER: _bindgen_ty_4 = 4;
pub const STOBJ_MF_PNL_BUMPER: _bindgen_ty_4 = 5;
pub const STOBJ_MF_PNL_ELECTRAP: _bindgen_ty_4 = 6;
pub const STOBJ_MF_BULLET_TEST: _bindgen_ty_4 = 7;
pub const STOBJ_MF_BOX: _bindgen_ty_4 = 8;
pub const STOBJ_BUMPER_BGSPECIAL: _bindgen_ty_4 = 9;
pub const STOBJ_NAMEENT_BTN: _bindgen_ty_4 = 10;
pub const STOBJ_BUTTON: _bindgen_ty_4 = 11;
pub const STOBJ_RETURNGATE: _bindgen_ty_4 = 12;
pub type _bindgen_ty_4 = ::core::ffi::c_uint;
pub type StobjType = undefined2;
pub type PVec = *mut Vec;
pub type PGmaModel = *mut GmaModel;
pub type PS16Vec = *mut S16Vec;
pub type s8 = ::core::ffi::c_schar;
pub const GCMF_ATTR_16BIT: _bindgen_ty_5 = 1;
pub const GCMF_ATTR_STITCHING_MODEL: _bindgen_ty_5 = 4;
pub const GCMF_ATTR_SKIN_MODEL: _bindgen_ty_5 = 8;
pub const GCMF_ATTR_EFFECTIVE_MODEL: _bindgen_ty_5 = 16;
pub type _bindgen_ty_5 = ::core::ffi::c_uint;
pub type GcmfAttributes = undefined4;
pub type u16_ = ushort;
pub type PGXTexObj = *mut GXTexObj;
pub type s16 = ::core::ffi::c_short;
pub const GX_TF_I4: _bindgen_ty_6 = 0;
pub const GX_TF_I8: _bindgen_ty_6 = 1;
pub const GX_TF_IA4: _bindgen_ty_6 = 2;
pub const GX_TF_IA8: _bindgen_ty_6 = 3;
pub const GX_TF_RGB565: _bindgen_ty_6 = 4;
pub const GX_TF_RGB5A3: _bindgen_ty_6 = 5;
pub const GX_TF_RGBA8: _bindgen_ty_6 = 6;
pub const GX_TF_CMPR: _bindgen_ty_6 = 14;
pub const GX_CTF_R4: _bindgen_ty_6 = 15;
pub const GX_CTF_RA4: _bindgen_ty_6 = 16;
pub const GX_CTF_RA8: _bindgen_ty_6 = 17;
pub const GX_CTF_YUVA8: _bindgen_ty_6 = 18;
pub const GX_CTF_A8: _bindgen_ty_6 = 19;
pub const GX_CTF_R8: _bindgen_ty_6 = 20;
pub const GX_CTF_G8: _bindgen_ty_6 = 21;
pub const GX_CTF_B8: _bindgen_ty_6 = 22;
pub const GX_CTF_RG8: _bindgen_ty_6 = 23;
pub const GX_CTF_GB8: _bindgen_ty_6 = 24;
pub const GX_TF_Z8: _bindgen_ty_6 = 25;
pub const GX_TF_Z16: _bindgen_ty_6 = 26;
pub const GX_TF_Z24X8: _bindgen_ty_6 = 27;
pub const GX_CTF_Z4: _bindgen_ty_6 = 28;
pub const GX_CTF_Z8M: _bindgen_ty_6 = 29;
pub const GX_CTF_Z8L: _bindgen_ty_6 = 30;
pub const GX_CTF_Z16L: _bindgen_ty_6 = 31;
pub const GX_TF_A8: _bindgen_ty_6 = 32;
pub type _bindgen_ty_6 = ::core::ffi::c_uint;
pub type GXTexFmt = undefined4;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct S16Vec {
    pub x: s16,
    pub y: s16,
    pub z: s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S16Vec"][::core::mem::size_of::<S16Vec>() - 6usize];
    ["Alignment of S16Vec"][::core::mem::align_of::<S16Vec>() - 1usize];
    ["Offset of field: S16Vec::x"][::core::mem::offset_of!(S16Vec, x) - 0usize];
    ["Offset of field: S16Vec::y"][::core::mem::offset_of!(S16Vec, y) - 2usize];
    ["Offset of field: S16Vec::z"][::core::mem::offset_of!(S16Vec, z) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GoalTape {
    pub field_0x0: [undefined; 4usize],
    pub field4_0x4: f32,
    pub field5_0x8: f32,
    pub field6_0xc: f32,
    pub g_timer_frames_remaining: s32,
    pub g_stobj_ptr: *mut Stobj,
    pub field9_0x18: f32,
    pub field10_0x1c: f32,
    pub field11_0x20: f32,
    pub field12_0x24: f32,
    pub field13_0x28: f32,
    pub field14_0x2c: f32,
    pub field15_0x30: f32,
    pub field16_0x34: f32,
    pub field17_0x38: f32,
    pub field18_0x3c: f32,
    pub field19_0x40: f32,
    pub field20_0x44: f32,
    pub field_0x48: [undefined; 328usize],
    pub field349_0x190: uint,
    pub field_0x194: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GoalTape"][::core::mem::size_of::<GoalTape>() - 408usize];
    ["Alignment of GoalTape"][::core::mem::align_of::<GoalTape>() - 1usize];
    ["Offset of field: GoalTape::field_0x0"][::core::mem::offset_of!(GoalTape, field_0x0) - 0usize];
    ["Offset of field: GoalTape::field4_0x4"]
        [::core::mem::offset_of!(GoalTape, field4_0x4) - 4usize];
    ["Offset of field: GoalTape::field5_0x8"]
        [::core::mem::offset_of!(GoalTape, field5_0x8) - 8usize];
    ["Offset of field: GoalTape::field6_0xc"]
        [::core::mem::offset_of!(GoalTape, field6_0xc) - 12usize];
    ["Offset of field: GoalTape::g_timer_frames_remaining"]
        [::core::mem::offset_of!(GoalTape, g_timer_frames_remaining) - 16usize];
    ["Offset of field: GoalTape::g_stobj_ptr"]
        [::core::mem::offset_of!(GoalTape, g_stobj_ptr) - 20usize];
    ["Offset of field: GoalTape::field9_0x18"]
        [::core::mem::offset_of!(GoalTape, field9_0x18) - 24usize];
    ["Offset of field: GoalTape::field10_0x1c"]
        [::core::mem::offset_of!(GoalTape, field10_0x1c) - 28usize];
    ["Offset of field: GoalTape::field11_0x20"]
        [::core::mem::offset_of!(GoalTape, field11_0x20) - 32usize];
    ["Offset of field: GoalTape::field12_0x24"]
        [::core::mem::offset_of!(GoalTape, field12_0x24) - 36usize];
    ["Offset of field: GoalTape::field13_0x28"]
        [::core::mem::offset_of!(GoalTape, field13_0x28) - 40usize];
    ["Offset of field: GoalTape::field14_0x2c"]
        [::core::mem::offset_of!(GoalTape, field14_0x2c) - 44usize];
    ["Offset of field: GoalTape::field15_0x30"]
        [::core::mem::offset_of!(GoalTape, field15_0x30) - 48usize];
    ["Offset of field: GoalTape::field16_0x34"]
        [::core::mem::offset_of!(GoalTape, field16_0x34) - 52usize];
    ["Offset of field: GoalTape::field17_0x38"]
        [::core::mem::offset_of!(GoalTape, field17_0x38) - 56usize];
    ["Offset of field: GoalTape::field18_0x3c"]
        [::core::mem::offset_of!(GoalTape, field18_0x3c) - 60usize];
    ["Offset of field: GoalTape::field19_0x40"]
        [::core::mem::offset_of!(GoalTape, field19_0x40) - 64usize];
    ["Offset of field: GoalTape::field20_0x44"]
        [::core::mem::offset_of!(GoalTape, field20_0x44) - 68usize];
    ["Offset of field: GoalTape::field_0x48"]
        [::core::mem::offset_of!(GoalTape, field_0x48) - 72usize];
    ["Offset of field: GoalTape::field349_0x190"]
        [::core::mem::offset_of!(GoalTape, field349_0x190) - 400usize];
    ["Offset of field: GoalTape::field_0x194"]
        [::core::mem::offset_of!(GoalTape, field_0x194) - 404usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GXTexObj {
    pub field_0x0: [undefined; 20usize],
    pub format: GXTexFmt,
    pub field_0x18: [undefined; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GXTexObj"][::core::mem::size_of::<GXTexObj>() - 32usize];
    ["Alignment of GXTexObj"][::core::mem::align_of::<GXTexObj>() - 1usize];
    ["Offset of field: GXTexObj::field_0x0"][::core::mem::offset_of!(GXTexObj, field_0x0) - 0usize];
    ["Offset of field: GXTexObj::format"][::core::mem::offset_of!(GXTexObj, format) - 20usize];
    ["Offset of field: GXTexObj::field_0x18"]
        [::core::mem::offset_of!(GXTexObj, field_0x18) - 24usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Vec {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vec"][::core::mem::size_of::<Vec>() - 12usize];
    ["Alignment of Vec"][::core::mem::align_of::<Vec>() - 1usize];
    ["Offset of field: Vec::x"][::core::mem::offset_of!(Vec, x) - 0usize];
    ["Offset of field: Vec::y"][::core::mem::offset_of!(Vec, y) - 4usize];
    ["Offset of field: Vec::z"][::core::mem::offset_of!(Vec, z) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PhysicsBall {
    pub flags: dword,
    pub pos: Vec,
    pub prev_pos: Vec,
    pub vel: Vec,
    pub radius: f32,
    pub acceleration: f32,
    pub restitution: f32,
    pub g_jerk: dword,
    pub field_0x38: [undefined; 12usize],
    pub g_some_vec: Vec,
    pub field_0x50: [undefined; 4usize],
    pub field25_0x54: dword,
    pub field26_0x58: f32,
    pub itemgroup_idx: dword,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PhysicsBall"][::core::mem::size_of::<PhysicsBall>() - 96usize];
    ["Alignment of PhysicsBall"][::core::mem::align_of::<PhysicsBall>() - 1usize];
    ["Offset of field: PhysicsBall::flags"][::core::mem::offset_of!(PhysicsBall, flags) - 0usize];
    ["Offset of field: PhysicsBall::pos"][::core::mem::offset_of!(PhysicsBall, pos) - 4usize];
    ["Offset of field: PhysicsBall::prev_pos"]
        [::core::mem::offset_of!(PhysicsBall, prev_pos) - 16usize];
    ["Offset of field: PhysicsBall::vel"][::core::mem::offset_of!(PhysicsBall, vel) - 28usize];
    ["Offset of field: PhysicsBall::radius"]
        [::core::mem::offset_of!(PhysicsBall, radius) - 40usize];
    ["Offset of field: PhysicsBall::acceleration"]
        [::core::mem::offset_of!(PhysicsBall, acceleration) - 44usize];
    ["Offset of field: PhysicsBall::restitution"]
        [::core::mem::offset_of!(PhysicsBall, restitution) - 48usize];
    ["Offset of field: PhysicsBall::g_jerk"]
        [::core::mem::offset_of!(PhysicsBall, g_jerk) - 52usize];
    ["Offset of field: PhysicsBall::field_0x38"]
        [::core::mem::offset_of!(PhysicsBall, field_0x38) - 56usize];
    ["Offset of field: PhysicsBall::g_some_vec"]
        [::core::mem::offset_of!(PhysicsBall, g_some_vec) - 68usize];
    ["Offset of field: PhysicsBall::field_0x50"]
        [::core::mem::offset_of!(PhysicsBall, field_0x50) - 80usize];
    ["Offset of field: PhysicsBall::field25_0x54"]
        [::core::mem::offset_of!(PhysicsBall, field25_0x54) - 84usize];
    ["Offset of field: PhysicsBall::field26_0x58"]
        [::core::mem::offset_of!(PhysicsBall, field26_0x58) - 88usize];
    ["Offset of field: PhysicsBall::itemgroup_idx"]
        [::core::mem::offset_of!(PhysicsBall, itemgroup_idx) - 92usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Stobj {
    pub idx: word,
    pub id: ::core::ffi::c_short,
    pub type_: StobjType,
    pub field_0x6: [undefined; 2usize],
    pub g_some_bitflag: uint,
    pub g_mode: ::core::ffi::c_short,
    pub g_counter: ::core::ffi::c_short,
    pub g_model_origin: Vec,
    pub position: Vec,
    pub position_2: Vec,
    pub bounding_sphere_radius: f32,
    pub coli_func:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Stobj, arg2: *mut PhysicsBall)>,
    pub scale: Vec,
    pub field14_0x48: f32,
    pub field15_0x4c: f32,
    pub field16_0x50: f32,
    pub model: *mut GmaModel,
    pub pos: Vec,
    pub vel: Vec,
    pub rot: S16Vec,
    pub field21_0x76: ::core::ffi::c_short,
    pub field22_0x78: ::core::ffi::c_short,
    pub field_0x7a: [undefined; 2usize],
    pub g_prev_pos: Vec,
    pub g_prev_rot: S16Vec,
    pub field_0x8e: [undefined; 2usize],
    pub field29_0x90: f32,
    pub field30_0x94: f32,
    pub field31_0x98: f32,
    pub field32_0x9c: f32,
    pub itemgroup_idx: s8,
    pub field_0xa1: [undefined; 3usize],
    pub extra_data: *mut ::core::ffi::c_void,
    pub g_some_pos2: Vec,
    pub g_local_position: Vec,
    pub g_local_velocity: Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Stobj"][::core::mem::size_of::<Stobj>() - 204usize];
    ["Alignment of Stobj"][::core::mem::align_of::<Stobj>() - 1usize];
    ["Offset of field: Stobj::idx"][::core::mem::offset_of!(Stobj, idx) - 0usize];
    ["Offset of field: Stobj::id"][::core::mem::offset_of!(Stobj, id) - 2usize];
    ["Offset of field: Stobj::type_"][::core::mem::offset_of!(Stobj, type_) - 4usize];
    ["Offset of field: Stobj::field_0x6"][::core::mem::offset_of!(Stobj, field_0x6) - 6usize];
    ["Offset of field: Stobj::g_some_bitflag"]
        [::core::mem::offset_of!(Stobj, g_some_bitflag) - 8usize];
    ["Offset of field: Stobj::g_mode"][::core::mem::offset_of!(Stobj, g_mode) - 12usize];
    ["Offset of field: Stobj::g_counter"][::core::mem::offset_of!(Stobj, g_counter) - 14usize];
    ["Offset of field: Stobj::g_model_origin"]
        [::core::mem::offset_of!(Stobj, g_model_origin) - 16usize];
    ["Offset of field: Stobj::position"][::core::mem::offset_of!(Stobj, position) - 28usize];
    ["Offset of field: Stobj::position_2"][::core::mem::offset_of!(Stobj, position_2) - 40usize];
    ["Offset of field: Stobj::bounding_sphere_radius"]
        [::core::mem::offset_of!(Stobj, bounding_sphere_radius) - 52usize];
    ["Offset of field: Stobj::coli_func"][::core::mem::offset_of!(Stobj, coli_func) - 56usize];
    ["Offset of field: Stobj::scale"][::core::mem::offset_of!(Stobj, scale) - 60usize];
    ["Offset of field: Stobj::field14_0x48"]
        [::core::mem::offset_of!(Stobj, field14_0x48) - 72usize];
    ["Offset of field: Stobj::field15_0x4c"]
        [::core::mem::offset_of!(Stobj, field15_0x4c) - 76usize];
    ["Offset of field: Stobj::field16_0x50"]
        [::core::mem::offset_of!(Stobj, field16_0x50) - 80usize];
    ["Offset of field: Stobj::model"][::core::mem::offset_of!(Stobj, model) - 84usize];
    ["Offset of field: Stobj::pos"][::core::mem::offset_of!(Stobj, pos) - 88usize];
    ["Offset of field: Stobj::vel"][::core::mem::offset_of!(Stobj, vel) - 100usize];
    ["Offset of field: Stobj::rot"][::core::mem::offset_of!(Stobj, rot) - 112usize];
    ["Offset of field: Stobj::field21_0x76"]
        [::core::mem::offset_of!(Stobj, field21_0x76) - 118usize];
    ["Offset of field: Stobj::field22_0x78"]
        [::core::mem::offset_of!(Stobj, field22_0x78) - 120usize];
    ["Offset of field: Stobj::field_0x7a"][::core::mem::offset_of!(Stobj, field_0x7a) - 122usize];
    ["Offset of field: Stobj::g_prev_pos"][::core::mem::offset_of!(Stobj, g_prev_pos) - 124usize];
    ["Offset of field: Stobj::g_prev_rot"][::core::mem::offset_of!(Stobj, g_prev_rot) - 136usize];
    ["Offset of field: Stobj::field_0x8e"][::core::mem::offset_of!(Stobj, field_0x8e) - 142usize];
    ["Offset of field: Stobj::field29_0x90"]
        [::core::mem::offset_of!(Stobj, field29_0x90) - 144usize];
    ["Offset of field: Stobj::field30_0x94"]
        [::core::mem::offset_of!(Stobj, field30_0x94) - 148usize];
    ["Offset of field: Stobj::field31_0x98"]
        [::core::mem::offset_of!(Stobj, field31_0x98) - 152usize];
    ["Offset of field: Stobj::field32_0x9c"]
        [::core::mem::offset_of!(Stobj, field32_0x9c) - 156usize];
    ["Offset of field: Stobj::itemgroup_idx"]
        [::core::mem::offset_of!(Stobj, itemgroup_idx) - 160usize];
    ["Offset of field: Stobj::field_0xa1"][::core::mem::offset_of!(Stobj, field_0xa1) - 161usize];
    ["Offset of field: Stobj::extra_data"][::core::mem::offset_of!(Stobj, extra_data) - 164usize];
    ["Offset of field: Stobj::g_some_pos2"][::core::mem::offset_of!(Stobj, g_some_pos2) - 168usize];
    ["Offset of field: Stobj::g_local_position"]
        [::core::mem::offset_of!(Stobj, g_local_position) - 180usize];
    ["Offset of field: Stobj::g_local_velocity"]
        [::core::mem::offset_of!(Stobj, g_local_velocity) - 192usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GmaModel {
    pub gcmf_magic: [::core::ffi::c_char; 4usize],
    pub attrs: GcmfAttributes,
    pub bound_sphere_center: Vec,
    pub bound_sphere_radius: f32,
    pub tev_layer_count: u16_,
    pub opaque_shape_count: u16_,
    pub translucent_shape_count: u16_,
    pub mtx_count: s8,
    pub field_0x1f: [undefined; 1usize],
    pub header_size: s32,
    pub texobjs: *mut GXTexObj,
    pub mtx_indexes: [s8; 8usize],
    pub field_0x30: [undefined; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GmaModel"][::core::mem::size_of::<GmaModel>() - 64usize];
    ["Alignment of GmaModel"][::core::mem::align_of::<GmaModel>() - 1usize];
    ["Offset of field: GmaModel::gcmf_magic"]
        [::core::mem::offset_of!(GmaModel, gcmf_magic) - 0usize];
    ["Offset of field: GmaModel::attrs"][::core::mem::offset_of!(GmaModel, attrs) - 4usize];
    ["Offset of field: GmaModel::bound_sphere_center"]
        [::core::mem::offset_of!(GmaModel, bound_sphere_center) - 8usize];
    ["Offset of field: GmaModel::bound_sphere_radius"]
        [::core::mem::offset_of!(GmaModel, bound_sphere_radius) - 20usize];
    ["Offset of field: GmaModel::tev_layer_count"]
        [::core::mem::offset_of!(GmaModel, tev_layer_count) - 24usize];
    ["Offset of field: GmaModel::opaque_shape_count"]
        [::core::mem::offset_of!(GmaModel, opaque_shape_count) - 26usize];
    ["Offset of field: GmaModel::translucent_shape_count"]
        [::core::mem::offset_of!(GmaModel, translucent_shape_count) - 28usize];
    ["Offset of field: GmaModel::mtx_count"]
        [::core::mem::offset_of!(GmaModel, mtx_count) - 30usize];
    ["Offset of field: GmaModel::field_0x1f"]
        [::core::mem::offset_of!(GmaModel, field_0x1f) - 31usize];
    ["Offset of field: GmaModel::header_size"]
        [::core::mem::offset_of!(GmaModel, header_size) - 32usize];
    ["Offset of field: GmaModel::texobjs"][::core::mem::offset_of!(GmaModel, texobjs) - 36usize];
    ["Offset of field: GmaModel::mtx_indexes"]
        [::core::mem::offset_of!(GmaModel, mtx_indexes) - 40usize];
    ["Offset of field: GmaModel::field_0x30"]
        [::core::mem::offset_of!(GmaModel, field_0x30) - 48usize];
};
pub type PMenuScreen = *mut MenuScreen;
pub type PMenuEntry = *mut MenuEntry;
pub type u32_ = u32;
pub const MENUSCREEN_MODE_SELECT: _bindgen_ty_7 = 0;
pub const MENUSCREEN_PARTY_GAME_SELECT: _bindgen_ty_7 = 1;
pub const MENUSCREEN_OPTIONS: _bindgen_ty_7 = 2;
pub const MENUSCREEN_RETURN_TO_TITLE_SCREEN: _bindgen_ty_7 = 3;
pub const MENUSCREEN_NUMBER_OF_PLAYERS: _bindgen_ty_7 = 4;
pub const MENUSCREEN_CHARACTER_SELECT_1: _bindgen_ty_7 = 5;
pub const MENUSCREEN_CHARACTER_SELECT_2: _bindgen_ty_7 = 6;
pub const MENUSCREEN_MAIN_GAME_SELECT: _bindgen_ty_7 = 7;
pub const MENUSCREEN_LEVEL_SELECT_NOMASTER: _bindgen_ty_7 = 8;
pub const MENUSCREEN_LEVEL_SELECT_WITHMASTER: _bindgen_ty_7 = 9;
pub const MENUSCREEN_PRACTICE_STAGE_SELECT: _bindgen_ty_7 = 10;
pub const MENUSCREEN_CHALLENGE_GAMEPLAY_SETTINGS: _bindgen_ty_7 = 11;
pub const MENUSCREEN_STORY_MODE_SELECTED: _bindgen_ty_7 = 12;
pub const MENUSCREEN_CHALLENGE_DIFFICULTY: _bindgen_ty_7 = 13;
pub const MENUSCREEN_MONKEY_RACE_MODE_SELECT: _bindgen_ty_7 = 15;
pub const MENUSCREEN_MONKEY_RACE_COURSE_SELECT: _bindgen_ty_7 = 16;
pub const MENUSCREEN_REPLAY: _bindgen_ty_7 = 80;
pub const MENUSCREEN_PLAY_POINTS: _bindgen_ty_7 = 81;
pub const MENUSCREEN_GIFT: _bindgen_ty_7 = 82;
pub const MENUSCREEN_RANKING: _bindgen_ty_7 = 83;
pub const MENUSCREEN_GAME_DATA_SETTINGS: _bindgen_ty_7 = 84;
pub const MENUSCREEN_CONTROLLER_SETTINGS: _bindgen_ty_7 = 85;
pub const MENUSCREEN_SCREEN_SETTINGS: _bindgen_ty_7 = 86;
pub const MENUSCREEN_SOUND_SETTINGS: _bindgen_ty_7 = 87;
pub type _bindgen_ty_7 = ::core::ffi::c_uint;
pub type MenuScreenID = undefined1;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MenuScreen {
    pub menu_entries: *mut MenuEntry,
    pub tick: *mut ::core::ffi::c_void,
    pub g_some_bitflag: u32_,
    pub field_0xc: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MenuScreen"][::core::mem::size_of::<MenuScreen>() - 16usize];
    ["Alignment of MenuScreen"][::core::mem::align_of::<MenuScreen>() - 1usize];
    ["Offset of field: MenuScreen::menu_entries"]
        [::core::mem::offset_of!(MenuScreen, menu_entries) - 0usize];
    ["Offset of field: MenuScreen::tick"][::core::mem::offset_of!(MenuScreen, tick) - 4usize];
    ["Offset of field: MenuScreen::g_some_bitflag"]
        [::core::mem::offset_of!(MenuScreen, g_some_bitflag) - 8usize];
    ["Offset of field: MenuScreen::field_0xc"]
        [::core::mem::offset_of!(MenuScreen, field_0xc) - 12usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MenuEntry {
    pub next_screen_id: MenuScreenID,
    pub padding_0x1: [undefined; 3usize],
    pub name_en: *mut ::core::ffi::c_char,
    pub name_de: *mut ::core::ffi::c_char,
    pub name_fr: *mut ::core::ffi::c_char,
    pub name_es: *mut ::core::ffi::c_char,
    pub name_it: *mut ::core::ffi::c_char,
    pub name_ja: *mut ::core::ffi::c_char,
    pub description_en: *mut ::core::ffi::c_char,
    pub description_de: *mut ::core::ffi::c_char,
    pub description_fr: *mut ::core::ffi::c_char,
    pub description_es: *mut ::core::ffi::c_char,
    pub description_it: *mut ::core::ffi::c_char,
    pub description_ja: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MenuEntry"][::core::mem::size_of::<MenuEntry>() - 52usize];
    ["Alignment of MenuEntry"][::core::mem::align_of::<MenuEntry>() - 1usize];
    ["Offset of field: MenuEntry::next_screen_id"]
        [::core::mem::offset_of!(MenuEntry, next_screen_id) - 0usize];
    ["Offset of field: MenuEntry::padding_0x1"]
        [::core::mem::offset_of!(MenuEntry, padding_0x1) - 1usize];
    ["Offset of field: MenuEntry::name_en"][::core::mem::offset_of!(MenuEntry, name_en) - 4usize];
    ["Offset of field: MenuEntry::name_de"][::core::mem::offset_of!(MenuEntry, name_de) - 8usize];
    ["Offset of field: MenuEntry::name_fr"][::core::mem::offset_of!(MenuEntry, name_fr) - 12usize];
    ["Offset of field: MenuEntry::name_es"][::core::mem::offset_of!(MenuEntry, name_es) - 16usize];
    ["Offset of field: MenuEntry::name_it"][::core::mem::offset_of!(MenuEntry, name_it) - 20usize];
    ["Offset of field: MenuEntry::name_ja"][::core::mem::offset_of!(MenuEntry, name_ja) - 24usize];
    ["Offset of field: MenuEntry::description_en"]
        [::core::mem::offset_of!(MenuEntry, description_en) - 28usize];
    ["Offset of field: MenuEntry::description_de"]
        [::core::mem::offset_of!(MenuEntry, description_de) - 32usize];
    ["Offset of field: MenuEntry::description_fr"]
        [::core::mem::offset_of!(MenuEntry, description_fr) - 36usize];
    ["Offset of field: MenuEntry::description_es"]
        [::core::mem::offset_of!(MenuEntry, description_es) - 40usize];
    ["Offset of field: MenuEntry::description_it"]
        [::core::mem::offset_of!(MenuEntry, description_it) - 44usize];
    ["Offset of field: MenuEntry::description_ja"]
        [::core::mem::offset_of!(MenuEntry, description_ja) - 48usize];
};
pub type PBmpInfo = *mut BmpInfo;
pub type BOOL32 = ::core::ffi::c_int;
pub type PTplBuffer = *mut TplBuffer;
pub type OSHeapHandle = ::core::ffi::c_int;
pub type PTplTextureHeader = *mut TplTextureHeader;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct TplBuffer {
    pub texture_count: s32,
    pub texture_headers: *mut TplTextureHeader,
    pub raw_tpl_buffer: *mut ::core::ffi::c_void,
    pub texobjs: *mut GXTexObj,
    pub field_0x10: [undefined; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TplBuffer"][::core::mem::size_of::<TplBuffer>() - 32usize];
    ["Alignment of TplBuffer"][::core::mem::align_of::<TplBuffer>() - 1usize];
    ["Offset of field: TplBuffer::texture_count"]
        [::core::mem::offset_of!(TplBuffer, texture_count) - 0usize];
    ["Offset of field: TplBuffer::texture_headers"]
        [::core::mem::offset_of!(TplBuffer, texture_headers) - 4usize];
    ["Offset of field: TplBuffer::raw_tpl_buffer"]
        [::core::mem::offset_of!(TplBuffer, raw_tpl_buffer) - 8usize];
    ["Offset of field: TplBuffer::texobjs"][::core::mem::offset_of!(TplBuffer, texobjs) - 12usize];
    ["Offset of field: TplBuffer::field_0x10"]
        [::core::mem::offset_of!(TplBuffer, field_0x10) - 16usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct BmpInfo {
    pub is_loaded: BOOL32,
    pub filepath: *mut ::core::ffi::c_char,
    pub category: *mut ::core::ffi::c_char,
    pub field_0xc: [undefined; 4usize],
    pub tpl: *mut TplBuffer,
    pub heap: OSHeapHandle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BmpInfo"][::core::mem::size_of::<BmpInfo>() - 24usize];
    ["Alignment of BmpInfo"][::core::mem::align_of::<BmpInfo>() - 1usize];
    ["Offset of field: BmpInfo::is_loaded"][::core::mem::offset_of!(BmpInfo, is_loaded) - 0usize];
    ["Offset of field: BmpInfo::filepath"][::core::mem::offset_of!(BmpInfo, filepath) - 4usize];
    ["Offset of field: BmpInfo::category"][::core::mem::offset_of!(BmpInfo, category) - 8usize];
    ["Offset of field: BmpInfo::field_0xc"][::core::mem::offset_of!(BmpInfo, field_0xc) - 12usize];
    ["Offset of field: BmpInfo::tpl"][::core::mem::offset_of!(BmpInfo, tpl) - 16usize];
    ["Offset of field: BmpInfo::heap"][::core::mem::offset_of!(BmpInfo, heap) - 20usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct TplTextureHeader {
    pub format: GXTexFmt,
    pub data_offset: dword,
    pub width: u16_,
    pub height: u16_,
    pub mipmap_count: u16_,
    pub always_0x1234: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TplTextureHeader"][::core::mem::size_of::<TplTextureHeader>() - 16usize];
    ["Alignment of TplTextureHeader"][::core::mem::align_of::<TplTextureHeader>() - 1usize];
    ["Offset of field: TplTextureHeader::format"]
        [::core::mem::offset_of!(TplTextureHeader, format) - 0usize];
    ["Offset of field: TplTextureHeader::data_offset"]
        [::core::mem::offset_of!(TplTextureHeader, data_offset) - 4usize];
    ["Offset of field: TplTextureHeader::width"]
        [::core::mem::offset_of!(TplTextureHeader, width) - 8usize];
    ["Offset of field: TplTextureHeader::height"]
        [::core::mem::offset_of!(TplTextureHeader, height) - 10usize];
    ["Offset of field: TplTextureHeader::mipmap_count"]
        [::core::mem::offset_of!(TplTextureHeader, mipmap_count) - 12usize];
    ["Offset of field: TplTextureHeader::always_0x1234"]
        [::core::mem::offset_of!(TplTextureHeader, always_0x1234) - 14usize];
};
pub type PCoinType = *mut CoinType;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CoinType {
    pub banana_count: s16,
    pub g_score_increment_flag: s16,
    pub g_score_value: s16,
    pub angular_velocity: S16Vec,
    pub field_0xc: [undefined; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CoinType"][::core::mem::size_of::<CoinType>() - 20usize];
    ["Alignment of CoinType"][::core::mem::align_of::<CoinType>() - 1usize];
    ["Offset of field: CoinType::banana_count"]
        [::core::mem::offset_of!(CoinType, banana_count) - 0usize];
    ["Offset of field: CoinType::g_score_increment_flag"]
        [::core::mem::offset_of!(CoinType, g_score_increment_flag) - 2usize];
    ["Offset of field: CoinType::g_score_value"]
        [::core::mem::offset_of!(CoinType, g_score_value) - 4usize];
    ["Offset of field: CoinType::angular_velocity"]
        [::core::mem::offset_of!(CoinType, angular_velocity) - 6usize];
    ["Offset of field: CoinType::field_0xc"]
        [::core::mem::offset_of!(CoinType, field_0xc) - 12usize];
};
pub type PGMotionData = *mut GMotionData;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GMotionData {
    pub field_0x0: [undefined; 76usize],
    pub progress: f32,
    pub length: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GMotionData"][::core::mem::size_of::<GMotionData>() - 84usize];
    ["Alignment of GMotionData"][::core::mem::align_of::<GMotionData>() - 1usize];
    ["Offset of field: GMotionData::field_0x0"]
        [::core::mem::offset_of!(GMotionData, field_0x0) - 0usize];
    ["Offset of field: GMotionData::progress"]
        [::core::mem::offset_of!(GMotionData, progress) - 76usize];
    ["Offset of field: GMotionData::length"]
        [::core::mem::offset_of!(GMotionData, length) - 80usize];
};
pub const STAT_NULL: _bindgen_ty_8 = 0;
pub const STAT_INIT: _bindgen_ty_8 = 1;
pub const STAT_NORMAL: _bindgen_ty_8 = 2;
pub const STAT_DEST: _bindgen_ty_8 = 3;
pub const STAT_FREEZE: _bindgen_ty_8 = 4;
pub const STAT_INIT_FIRST: _bindgen_ty_8 = 5;
pub const STAT_GOAL_INIT: _bindgen_ty_8 = 6;
pub const STAT_GOAL: _bindgen_ty_8 = 7;
pub const STAT_RINGOUT_INIT: _bindgen_ty_8 = 8;
pub const STAT_RINGOUT: _bindgen_ty_8 = 9;
pub const STAT_MINI_MODE_0_INIT: _bindgen_ty_8 = 10;
pub const STAT_MINI_MODE_0: _bindgen_ty_8 = 11;
pub type _bindgen_ty_8 = ::core::ffi::c_uint;
pub type Status = undefined1;
pub type PGSomeBgStruct = *mut GSomeBgStruct;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GSomeBgStruct {
    pub some_flag: u32_,
    pub bg_model_list: *mut ::core::ffi::c_char,
    pub field2_0x8: u32_,
    pub some_ptr_2: *mut u32_,
    pub field4_0x10: u32_,
    pub some_ptr_3: *mut u32_,
    pub field6_0x18: u32_,
    pub some_ptr_4: *mut u32_,
    pub field8_0x20: u32_,
    pub some_ptr_5: *mut u32_,
    pub some_counter: u32_,
    pub field11_0x2c: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSomeBgStruct"][::core::mem::size_of::<GSomeBgStruct>() - 48usize];
    ["Alignment of GSomeBgStruct"][::core::mem::align_of::<GSomeBgStruct>() - 1usize];
    ["Offset of field: GSomeBgStruct::some_flag"]
        [::core::mem::offset_of!(GSomeBgStruct, some_flag) - 0usize];
    ["Offset of field: GSomeBgStruct::bg_model_list"]
        [::core::mem::offset_of!(GSomeBgStruct, bg_model_list) - 4usize];
    ["Offset of field: GSomeBgStruct::field2_0x8"]
        [::core::mem::offset_of!(GSomeBgStruct, field2_0x8) - 8usize];
    ["Offset of field: GSomeBgStruct::some_ptr_2"]
        [::core::mem::offset_of!(GSomeBgStruct, some_ptr_2) - 12usize];
    ["Offset of field: GSomeBgStruct::field4_0x10"]
        [::core::mem::offset_of!(GSomeBgStruct, field4_0x10) - 16usize];
    ["Offset of field: GSomeBgStruct::some_ptr_3"]
        [::core::mem::offset_of!(GSomeBgStruct, some_ptr_3) - 20usize];
    ["Offset of field: GSomeBgStruct::field6_0x18"]
        [::core::mem::offset_of!(GSomeBgStruct, field6_0x18) - 24usize];
    ["Offset of field: GSomeBgStruct::some_ptr_4"]
        [::core::mem::offset_of!(GSomeBgStruct, some_ptr_4) - 28usize];
    ["Offset of field: GSomeBgStruct::field8_0x20"]
        [::core::mem::offset_of!(GSomeBgStruct, field8_0x20) - 32usize];
    ["Offset of field: GSomeBgStruct::some_ptr_5"]
        [::core::mem::offset_of!(GSomeBgStruct, some_ptr_5) - 36usize];
    ["Offset of field: GSomeBgStruct::some_counter"]
        [::core::mem::offset_of!(GSomeBgStruct, some_counter) - 40usize];
    ["Offset of field: GSomeBgStruct::field11_0x2c"]
        [::core::mem::offset_of!(GSomeBgStruct, field11_0x2c) - 44usize];
};
pub const SMD_ADV_TOP: _bindgen_ty_9 = 0;
pub const SMD_ADV_MOVIE_INIT: _bindgen_ty_9 = 1;
pub const SMD_ADV_MOVIE_RETURN: _bindgen_ty_9 = 2;
pub const SMD_ADV_LOGO_INIT: _bindgen_ty_9 = 3;
pub const SMD_ADV_LOGO_MAIN: _bindgen_ty_9 = 4;
pub const SMD_ADV_WARNING_INIT: _bindgen_ty_9 = 5;
pub const SMD_ADV_WARNING_MAIN: _bindgen_ty_9 = 6;
pub const SMD_ADV_DEMO_INIT: _bindgen_ty_9 = 7;
pub const SMD_ADV_DEMO_MAIN: _bindgen_ty_9 = 8;
pub const SMD_ADV_START_INIT: _bindgen_ty_9 = 9;
pub const SMD_ADV_START_MAIN: _bindgen_ty_9 = 10;
pub const SMD_ADV_RANKING_INIT: _bindgen_ty_9 = 11;
pub const SMD_ADV_RANKING_MAIN: _bindgen_ty_9 = 12;
pub const SMD_ADV_INFO_INIT: _bindgen_ty_9 = 13;
pub const SMD_ADV_INFO_MAIN: _bindgen_ty_9 = 14;
pub const SMD_ADV_GAME_READY_INIT: _bindgen_ty_9 = 15;
pub const SMD_ADV_GAME_READY_MAIN: _bindgen_ty_9 = 16;
pub const SMD_ADV_GAME_PLAY_INIT: _bindgen_ty_9 = 17;
pub const SMD_ADV_GAME_PLAY_MAIN: _bindgen_ty_9 = 18;
pub const SMD_ADV_TITLE_INIT: _bindgen_ty_9 = 19;
pub const SMD_ADV_TITLE_MAIN: _bindgen_ty_9 = 20;
pub const SMD_ADV_TITLE_REINIT: _bindgen_ty_9 = 21;
pub const SMD_ADV_PROG_INIT: _bindgen_ty_9 = 22;
pub const SMD_ADV_PROG_MAIN: _bindgen_ty_9 = 23;
pub const SMD_ADV_FIRST_LOGO_INIT: _bindgen_ty_9 = 24;
pub const SMD_ADV_FIRST_LOGO_MAIN: _bindgen_ty_9 = 25;
pub const SMD_ADV_DMY8: _bindgen_ty_9 = 26;
pub const SMD_ADV_BOTTOM: _bindgen_ty_9 = 27;
pub const SMD_SEL_TOP: _bindgen_ty_9 = 28;
pub const SMD_SEL_STAGE_INIT: _bindgen_ty_9 = 29;
pub const SMD_SEL_STAGE_MAIN: _bindgen_ty_9 = 30;
pub const SMD_SEL_NGC_INIT: _bindgen_ty_9 = 31;
pub const SMD_SEL_NGC_MAIN: _bindgen_ty_9 = 32;
pub const SMD_SEL_NGC_REINIT: _bindgen_ty_9 = 33;
pub const SMD_SEL_NGC_DEST: _bindgen_ty_9 = 34;
pub const SMD_SEL_DMY1: _bindgen_ty_9 = 35;
pub const SMD_SEL_DMY2: _bindgen_ty_9 = 36;
pub const SMD_SEL_DMY3: _bindgen_ty_9 = 37;
pub const SMD_SEL_DMY4: _bindgen_ty_9 = 38;
pub const SMD_SEL_DMY5: _bindgen_ty_9 = 39;
pub const SMD_SEL_DMY6: _bindgen_ty_9 = 40;
pub const SMD_SEL_DMY7: _bindgen_ty_9 = 41;
pub const SMD_SEL_DMY8: _bindgen_ty_9 = 42;
pub const SMD_SEL_DMY9: _bindgen_ty_9 = 43;
pub const SMD_SEL_DMYa: _bindgen_ty_9 = 44;
pub const SMD_SEL_DMYb: _bindgen_ty_9 = 45;
pub const SMD_SEL_BOTTOM: _bindgen_ty_9 = 46;
pub const SMD_GAME_TOP: _bindgen_ty_9 = 47;
pub const SMD_GAME_READY_INIT: _bindgen_ty_9 = 48;
pub const SMD_GAME_READY_MAIN: _bindgen_ty_9 = 49;
pub const SMD_GAME_PLAY_INIT: _bindgen_ty_9 = 50;
pub const SMD_GAME_PLAY_MAIN: _bindgen_ty_9 = 51;
pub const SMD_GAME_GOAL_INIT: _bindgen_ty_9 = 52;
pub const SMD_GAME_GOAL_MAIN: _bindgen_ty_9 = 53;
pub const SMD_GAME_GOAL_REPLAY_INIT: _bindgen_ty_9 = 54;
pub const SMD_GAME_GOAL_REPLAY_MAIN: _bindgen_ty_9 = 55;
pub const SMD_GAME_TIMEOVER_INIT: _bindgen_ty_9 = 56;
pub const SMD_GAME_TIMEOVER_MAIN: _bindgen_ty_9 = 57;
pub const SMD_GAME_RINGOUT_INIT: _bindgen_ty_9 = 58;
pub const SMD_GAME_RINGOUT_MAIN: _bindgen_ty_9 = 59;
pub const SMD_GAME_FIRST_INIT: _bindgen_ty_9 = 60;
pub const SMD_GAME_OVER_INIT: _bindgen_ty_9 = 61;
pub const SMD_GAME_OVER_MAIN: _bindgen_ty_9 = 62;
pub const SMD_GAME_NAMEENTRY_INIT: _bindgen_ty_9 = 63;
pub const SMD_GAME_NAMEENTRY_MAIN: _bindgen_ty_9 = 64;
pub const SMD_GAME_CONTINUE_INIT: _bindgen_ty_9 = 65;
pub const SMD_GAME_CONTINUE_MAIN: _bindgen_ty_9 = 66;
pub const SMD_GAME_RESTART_INIT: _bindgen_ty_9 = 67;
pub const SMD_GAME_NAMEENTRY_READY_INIT: _bindgen_ty_9 = 68;
pub const SMD_GAME_NAMEENTRY_READY_MAIN: _bindgen_ty_9 = 69;
pub const SMD_GAME_BONUS_CLEAR_INIT: _bindgen_ty_9 = 70;
pub const SMD_GAME_BONUS_CLEAR_MAIN: _bindgen_ty_9 = 71;
pub const SMD_GAME_ENDING_INIT: _bindgen_ty_9 = 72;
pub const SMD_GAME_ENDING_MAIN: _bindgen_ty_9 = 73;
pub const SMD_GAME_EXTRA_INIT: _bindgen_ty_9 = 74;
pub const SMD_GAME_EXTRA_WAIT: _bindgen_ty_9 = 75;
pub const SMD_GAME_RESULT_INIT: _bindgen_ty_9 = 76;
pub const SMD_GAME_RESULT_MAIN: _bindgen_ty_9 = 77;
pub const SMD_GAME_RESULT_MENU: _bindgen_ty_9 = 78;
pub const SMD_GAME_INTR_SEL_INIT: _bindgen_ty_9 = 79;
pub const SMD_GAME_INTR_SEL_MAIN: _bindgen_ty_9 = 80;
pub const SMD_GAME_OVER_SAVE: _bindgen_ty_9 = 81;
pub const SMD_GAME_OVER_DEST: _bindgen_ty_9 = 82;
pub const SMD_GAME_ROLL_INIT: _bindgen_ty_9 = 83;
pub const SMD_GAME_ROLL_MAIN: _bindgen_ty_9 = 84;
pub const SMD_GAME_OVER_POINT_INIT: _bindgen_ty_9 = 85;
pub const SMD_GAME_OVER_POINT_MAIN: _bindgen_ty_9 = 86;
pub const SMD_GAME_SCENARIO_INIT: _bindgen_ty_9 = 87;
pub const SMD_GAME_SCENARIO_MAIN: _bindgen_ty_9 = 88;
pub const SMD_GAME_SCENARIO_RETURN: _bindgen_ty_9 = 89;
pub const SMD_GAME_RETRY_INIT: _bindgen_ty_9 = 90;
pub const SMD_GAME_RETRY_MAIN: _bindgen_ty_9 = 91;
pub const SMD_GAME_FORCE_EXIT_INIT: _bindgen_ty_9 = 92;
pub const SMD_GAME_FORCE_EXIT_MAIN: _bindgen_ty_9 = 93;
pub const SMD_GAME_SCENSCNPLAY_RETURN: _bindgen_ty_9 = 94;
pub const SMD_GAME_FORCE_OVER_INIT: _bindgen_ty_9 = 95;
pub const SMD_GAME_FORCE_OVER_MAIN: _bindgen_ty_9 = 96;
pub const SMD_GAME_SUGG_SAVE_INIT: _bindgen_ty_9 = 97;
pub const SMD_GAME_SUGG_SAVE_MAIN: _bindgen_ty_9 = 98;
pub const SMD_GAME_DMY3: _bindgen_ty_9 = 99;
pub const SMD_GAME_DMY4: _bindgen_ty_9 = 100;
pub const SMD_GAME_DMY5: _bindgen_ty_9 = 101;
pub const SMD_GAME_DMY6: _bindgen_ty_9 = 102;
pub const SMD_GAME_DMY7: _bindgen_ty_9 = 103;
pub const SMD_GAME_DMY8: _bindgen_ty_9 = 104;
pub const SMD_GAME_DMY9: _bindgen_ty_9 = 105;
pub const SMD_GAME_DMYA: _bindgen_ty_9 = 106;
pub const SMD_GAME_DMYB: _bindgen_ty_9 = 107;
pub const SMD_GAME_DMYC: _bindgen_ty_9 = 108;
pub const SMD_GAME_DMYD: _bindgen_ty_9 = 109;
pub const SMD_GAME_DMYE: _bindgen_ty_9 = 110;
pub const SMD_GAME_DMYF: _bindgen_ty_9 = 111;
pub const SMD_GAME_BOTTOM: _bindgen_ty_9 = 112;
pub const SMD_TEST_TOP: _bindgen_ty_9 = 113;
pub const SMD_TEST_SELECT_INIT: _bindgen_ty_9 = 114;
pub const SMD_TEST_SELECT_MAIN: _bindgen_ty_9 = 115;
pub const SMD_TEST_INPUT_INIT: _bindgen_ty_9 = 116;
pub const SMD_TEST_INPUT_MAIN: _bindgen_ty_9 = 117;
pub const SMD_TEST_DIP_INIT: _bindgen_ty_9 = 118;
pub const SMD_TEST_DIP_MAIN: _bindgen_ty_9 = 119;
pub const SMD_TEST_SOUND_INIT: _bindgen_ty_9 = 120;
pub const SMD_TEST_SOUND_MAIN: _bindgen_ty_9 = 121;
pub const SMD_TEST_BLUR_INIT: _bindgen_ty_9 = 122;
pub const SMD_TEST_BLUR_MAIN: _bindgen_ty_9 = 123;
pub const SMD_TEST_SHADOW_INIT: _bindgen_ty_9 = 124;
pub const SMD_TEST_SHADOW_MAIN: _bindgen_ty_9 = 125;
pub const SMD_TEST_FOCUS_INIT: _bindgen_ty_9 = 126;
pub const SMD_TEST_FOCUS_MAIN: _bindgen_ty_9 = 127;
pub const SMD_TEST_INDIRECT_INIT: _bindgen_ty_9 = 128;
pub const SMD_TEST_INDIRECT_MAIN: _bindgen_ty_9 = 129;
pub const SMD_TEST_NLOBJPUT_INIT: _bindgen_ty_9 = 130;
pub const SMD_TEST_NLOBJPUT_MAIN: _bindgen_ty_9 = 131;
pub const SMD_TEST_BITMAP_INIT: _bindgen_ty_9 = 132;
pub const SMD_TEST_BITMAP_MAIN: _bindgen_ty_9 = 133;
pub const SMD_TEST_FONT_INIT: _bindgen_ty_9 = 134;
pub const SMD_TEST_FONT_MAIN: _bindgen_ty_9 = 135;
pub const SMD_TEST_REPLAY_INIT: _bindgen_ty_9 = 136;
pub const SMD_TEST_REPLAY_MAIN: _bindgen_ty_9 = 137;
pub const SMD_TEST_MOTION_INIT: _bindgen_ty_9 = 138;
pub const SMD_TEST_MOTION_MAIN: _bindgen_ty_9 = 139;
pub const SMD_TEST_ADVREPLAY_INIT: _bindgen_ty_9 = 140;
pub const SMD_TEST_MODEL_INIT: _bindgen_ty_9 = 141;
pub const SMD_TEST_MODEL_MAIN: _bindgen_ty_9 = 142;
pub const SMD_TEST_NEWMODEL_INIT: _bindgen_ty_9 = 143;
pub const SMD_TEST_NEWMODEL_MAIN: _bindgen_ty_9 = 144;
pub const SMD_TEST_PATTERN_INIT: _bindgen_ty_9 = 145;
pub const SMD_TEST_PATTERN_MAIN: _bindgen_ty_9 = 146;
pub const SMD_TEST_ROMFONT_INIT: _bindgen_ty_9 = 147;
pub const SMD_TEST_ROMFONT_MAIN: _bindgen_ty_9 = 148;
pub const SMD_TEST_PREREND_INIT: _bindgen_ty_9 = 149;
pub const SMD_TEST_PREREND_MAIN: _bindgen_ty_9 = 150;
pub const SMD_TEST_PREVIEW_INIT: _bindgen_ty_9 = 151;
pub const SMD_TEST_PREVIEW_MAIN: _bindgen_ty_9 = 152;
pub const SMD_TEST_ADX_INIT: _bindgen_ty_9 = 153;
pub const SMD_TEST_ADX_MAIN: _bindgen_ty_9 = 154;
pub const SMD_TEST_NEWMOTION_INIT: _bindgen_ty_9 = 155;
pub const SMD_TEST_NEWMOTION_MAIN: _bindgen_ty_9 = 156;
pub const SMD_TEST_ARAM_FONT_INIT: _bindgen_ty_9 = 157;
pub const SMD_TEST_ARAM_FONT_MAIN: _bindgen_ty_9 = 158;
pub const SMD_TEST_SCENE_PLAY_INIT: _bindgen_ty_9 = 159;
pub const SMD_TEST_SCENE_PLAY_MAIN: _bindgen_ty_9 = 160;
pub const SMD_TEST_DIALOG_INIT: _bindgen_ty_9 = 161;
pub const SMD_TEST_DIALOG_MAIN: _bindgen_ty_9 = 162;
pub const SMD_TEST_DIFFICULTY_INIT: _bindgen_ty_9 = 163;
pub const SMD_TEST_DIFFICULTY_MAIN: _bindgen_ty_9 = 164;
pub const SMD_TEST_CHK_REPSIZE_INIT: _bindgen_ty_9 = 165;
pub const SMD_TEST_CHK_REPSIZE_MAIN: _bindgen_ty_9 = 166;
pub const SMD_TEST_BOTTOM: _bindgen_ty_9 = 167;
pub const SMD_MINI_TOP: _bindgen_ty_9 = 168;
pub const SMD_MINI_SELECT_INIT: _bindgen_ty_9 = 169;
pub const SMD_MINI_SELECT_MAIN: _bindgen_ty_9 = 170;
pub const SMD_MINI_BOWLING_INIT: _bindgen_ty_9 = 171;
pub const SMD_MINI_BOWLING_MAIN: _bindgen_ty_9 = 172;
pub const SMD_MINI_BILLIARDS_INIT: _bindgen_ty_9 = 173;
pub const SMD_MINI_BILLIARDS_MAIN: _bindgen_ty_9 = 174;
pub const SMD_MINI_SHOOTING_INIT: _bindgen_ty_9 = 175;
pub const SMD_MINI_SHOOTING_MAIN: _bindgen_ty_9 = 176;
pub const SMD_MINI_REL_SAMPLE_INIT: _bindgen_ty_9 = 177;
pub const SMD_MINI_REL_SAMPLE_MAIN: _bindgen_ty_9 = 178;
pub const SMD_MINI_COMMEND_INIT: _bindgen_ty_9 = 179;
pub const SMD_MINI_COMMEND_MAIN: _bindgen_ty_9 = 180;
pub const SMD_MINI_RANKING_INIT: _bindgen_ty_9 = 181;
pub const SMD_MINI_RANKING_MAIN: _bindgen_ty_9 = 182;
pub const SMD_MINI_ENDING_INIT: _bindgen_ty_9 = 183;
pub const SMD_MINI_ENDING_MAIN: _bindgen_ty_9 = 184;
pub const SMD_MINI_RACE2_INIT: _bindgen_ty_9 = 185;
pub const SMD_MINI_RACE2_MAIN: _bindgen_ty_9 = 186;
pub const SMD_MINI_GOLF2_INIT: _bindgen_ty_9 = 187;
pub const SMD_MINI_GOLF2_MAIN: _bindgen_ty_9 = 188;
pub const SMD_MINI_FIGHT2_INIT: _bindgen_ty_9 = 189;
pub const SMD_MINI_FIGHT2_MAIN: _bindgen_ty_9 = 190;
pub const SMD_MINI_PILOT2_INIT: _bindgen_ty_9 = 191;
pub const SMD_MINI_PILOT2_MAIN: _bindgen_ty_9 = 192;
pub const SMD_MINI_BOAT_INIT: _bindgen_ty_9 = 193;
pub const SMD_MINI_BOAT_MAIN: _bindgen_ty_9 = 194;
pub const SMD_MINI_S_ROLL_INIT: _bindgen_ty_9 = 195;
pub const SMD_MINI_S_ROLL_MAIN: _bindgen_ty_9 = 196;
pub const SMD_MINI_FUTSAL_INIT: _bindgen_ty_9 = 197;
pub const SMD_MINI_FUTSAL_MAIN: _bindgen_ty_9 = 198;
pub const SMD_MINI_DOGFIGHT_INIT: _bindgen_ty_9 = 199;
pub const SMD_MINI_DOGFIGHT_MAIN: _bindgen_ty_9 = 200;
pub const SMD_MINI_BASEBALL_INIT: _bindgen_ty_9 = 201;
pub const SMD_MINI_BASEBALL_MAIN: _bindgen_ty_9 = 202;
pub const SMD_MINI_TENNIS_INIT: _bindgen_ty_9 = 203;
pub const SMD_MINI_TENNIS_MAIN: _bindgen_ty_9 = 204;
pub const SMD_MINI_DMY9: _bindgen_ty_9 = 205;
pub const SMD_MINI_DMY10: _bindgen_ty_9 = 206;
pub const SMD_MINI_DMY11: _bindgen_ty_9 = 207;
pub const SMD_MINI_DMY12: _bindgen_ty_9 = 208;
pub const SMD_MINI_BOTTOM: _bindgen_ty_9 = 209;
pub const SMD_OPTION_TOP: _bindgen_ty_9 = 210;
pub const SMD_OPTION_SELECT_INIT: _bindgen_ty_9 = 211;
pub const SMD_OPTION_SELECT_MAIN: _bindgen_ty_9 = 212;
pub const SMD_OPTION_SOUND_INIT: _bindgen_ty_9 = 213;
pub const SMD_OPTION_SOUND_MAIN: _bindgen_ty_9 = 214;
pub const SMD_OPTION_PAD_INIT: _bindgen_ty_9 = 215;
pub const SMD_OPTION_PAD_MAIN: _bindgen_ty_9 = 216;
pub const SMD_OPTION_MEMCARD_INIT: _bindgen_ty_9 = 217;
pub const SMD_OPTION_MEMCARD_MAIN: _bindgen_ty_9 = 218;
pub const SMD_OPTION_POINT_INIT: _bindgen_ty_9 = 219;
pub const SMD_OPTION_POINT_MAIN: _bindgen_ty_9 = 220;
pub const SMD_OPTION_RANKING_INIT: _bindgen_ty_9 = 221;
pub const SMD_OPTION_RANKING_MAIN: _bindgen_ty_9 = 222;
pub const SMD_OPTION_AUTOSAVE_INIT: _bindgen_ty_9 = 223;
pub const SMD_OPTION_AUTOSAVE_MAIN: _bindgen_ty_9 = 224;
pub const SMD_OPTION_REPLAY_INIT: _bindgen_ty_9 = 225;
pub const SMD_OPTION_REPLAY_MAIN: _bindgen_ty_9 = 226;
pub const SMD_OPTION_SEPARATE_INIT: _bindgen_ty_9 = 227;
pub const SMD_OPTION_SEPARATE_MAIN: _bindgen_ty_9 = 228;
pub const SMD_OPTION_REPLAY_PLAY_INIT: _bindgen_ty_9 = 229;
pub const SMD_OPTION_REPLAY_PLAY_MAIN: _bindgen_ty_9 = 230;
pub const SMD_OPTION_PAD_MENU_INIT: _bindgen_ty_9 = 231;
pub const SMD_OPTION_PAD_MENU_MAIN: _bindgen_ty_9 = 232;
pub const SMD_OPTION_PAD_VIB_INIT: _bindgen_ty_9 = 233;
pub const SMD_OPTION_PAD_VIB_MAIN: _bindgen_ty_9 = 234;
pub const SMD_OPTION_DMY0: _bindgen_ty_9 = 235;
pub const SMD_OPTION_DMY1: _bindgen_ty_9 = 236;
pub const SMD_OPTION_DMY2: _bindgen_ty_9 = 237;
pub const SMD_OPTION_DMY3: _bindgen_ty_9 = 238;
pub const SMD_OPTION_DMY4: _bindgen_ty_9 = 239;
pub const SMD_OPTION_DMY5: _bindgen_ty_9 = 240;
pub const SMD_OPTION_DMY6: _bindgen_ty_9 = 241;
pub const SMD_OPTION_DMY7: _bindgen_ty_9 = 242;
pub const SMD_OPTION_BOTTOM: _bindgen_ty_9 = 243;
pub const SMD_AUTHOR_TOP: _bindgen_ty_9 = 244;
pub const SMD_AUTHOR_SELECT_INIT: _bindgen_ty_9 = 245;
pub const SMD_AUTHOR_SELECT_MAIN: _bindgen_ty_9 = 246;
pub const SMD_AUTHOR_PLAY_INIT: _bindgen_ty_9 = 247;
pub const SMD_AUTHOR_PLAY_MAIN: _bindgen_ty_9 = 248;
pub const SMD_AUTHOR_PLAY_STORY_INIT: _bindgen_ty_9 = 249;
pub const SMD_AUTHOR_PLAY_FROM_SEL: _bindgen_ty_9 = 250;
pub const SMD_AUTHOR_PLAY_RET_SEL: _bindgen_ty_9 = 251;
pub const SMD_AUTHOR_PLAY_ENDING_INIT: _bindgen_ty_9 = 252;
pub const SMD_AUTHOR_DMY6: _bindgen_ty_9 = 253;
pub const SMD_AUTHOR_DMY7: _bindgen_ty_9 = 254;
pub const SMD_AUTHOR_BOTTOM: _bindgen_ty_9 = 255;
pub const SMD_EXOPT_TOP: _bindgen_ty_9 = 256;
pub const SMD_EXOPT_REPLAY_LOAD_INIT: _bindgen_ty_9 = 257;
pub const SMD_EXOPT_REPLAY_LOAD_MAIN: _bindgen_ty_9 = 258;
pub const SMD_EXOPT_REPLAY_INIT: _bindgen_ty_9 = 259;
pub const SMD_EXOPT_REPLAY_MAIN: _bindgen_ty_9 = 260;
pub const SMD_EXOPT_DMY5: _bindgen_ty_9 = 261;
pub const SMD_EXOPT_DMY6: _bindgen_ty_9 = 262;
pub const SMD_EXOPT_DMY7: _bindgen_ty_9 = 263;
pub const SMD_EXOPT_BOTTOM: _bindgen_ty_9 = 264;
pub const SMD_INVALID: _bindgen_ty_9 = 4294967295;
pub type _bindgen_ty_9 = ::core::ffi::c_uint;
pub type SubMode = undefined4;
pub const MD_ADV: _bindgen_ty_10 = 0;
pub const MD_SEL: _bindgen_ty_10 = 1;
pub const MD_GAME: _bindgen_ty_10 = 2;
pub const MD_TEST: _bindgen_ty_10 = 3;
pub const MD_MINI: _bindgen_ty_10 = 4;
pub const MD_OPTION: _bindgen_ty_10 = 5;
pub const MD_AUTHOR: _bindgen_ty_10 = 6;
pub const MD_EXOPT: _bindgen_ty_10 = 7;
pub const MD_INVALID: _bindgen_ty_10 = 4294967295;
pub type _bindgen_ty_10 = ::core::ffi::c_uint;
pub type MainMode = undefined4;
pub const DIP_NONE: _bindgen_ty_11 = 0;
pub const DIP_DEBUG: _bindgen_ty_11 = 1;
pub const DIP_DISP: _bindgen_ty_11 = 2;
pub const DIP_STCOLI: _bindgen_ty_11 = 4;
pub const DIP_TRIANGLE: _bindgen_ty_11 = 8;
pub const DIP_TAIKEN: _bindgen_ty_11 = 16;
pub const DIP_TIME_STOP: _bindgen_ty_11 = 32;
pub const DIP_NAMEENTRY: _bindgen_ty_11 = 64;
pub const DIP_FIX_WORLD: _bindgen_ty_11 = 128;
pub const DIP_TEST_CAM: _bindgen_ty_11 = 256;
pub const DIP_NO_INTR: _bindgen_ty_11 = 512;
pub const DIP_CAPTURE: _bindgen_ty_11 = 1024;
pub const DIP_PERF_ALWAYS: _bindgen_ty_11 = 2048;
pub const DIP_PLAY_STG_ALL: _bindgen_ty_11 = 4096;
pub const DIP_PLAY_PNT_x10: _bindgen_ty_11 = 8192;
pub const DIP_SARU_0: _bindgen_ty_11 = 16384;
pub const DIP_SWITCH15: _bindgen_ty_11 = 32768;
pub const DIP_ONLY24MB: _bindgen_ty_11 = 65536;
pub const DIP_SHADOW_DISP: _bindgen_ty_11 = 131072;
pub const DIP_SPRITE_OFF: _bindgen_ty_11 = 262144;
pub const DIP_SNDREQ_DISP: _bindgen_ty_11 = 524288;
pub const DIP_SE_VOL_RESET: _bindgen_ty_11 = 1048576;
pub const DIP_APE_FACEDIR: _bindgen_ty_11 = 2097152;
pub const DIP_SEL_ALL_CTRL: _bindgen_ty_11 = 4194304;
pub const DIP_APE_NUMBER: _bindgen_ty_11 = 8388608;
pub const DIP_1P_TEST_CAM: _bindgen_ty_11 = 16777216;
pub const DIP_PREVIEW_SAVE: _bindgen_ty_11 = 33554432;
pub const DIP_AUTHOR_DEBUG: _bindgen_ty_11 = 67108864;
pub const DIP_SWITCH27: _bindgen_ty_11 = 134217728;
pub const DIP_SOA: _bindgen_ty_11 = 268435456;
pub const DIP_TEST_TEAM: _bindgen_ty_11 = 536870912;
pub const DIP_NO_MINIMAP: _bindgen_ty_11 = 1073741824;
pub const DIP_NO_STAGE: _bindgen_ty_11 = 2147483648;
pub type _bindgen_ty_11 = ::core::ffi::c_uint;
pub type DipSwitch = undefined4;
pub type PReplay = *mut Replay;
pub type u8_ = uchar;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Replay {
    pub field_0x0: [undefined; 4usize],
    pub difficulty: u8_,
    pub floorNum: u8_,
    pub monkey: u8_,
    pub field_0x7: [undefined; 9usize],
    pub field16_0x10: u32_,
    pub field_0x14: [undefined; 4usize],
    pub g_stageTimeLimit1: s16,
    pub g_duration: s16,
    pub field_0x1c: [undefined; 2usize],
    pub goalId: s16,
    pub field_0x20: [undefined; 4usize],
    pub g_ballVelAtGoal: Vec,
    pub field_0x30: [undefined; 4usize],
    pub size: u32_,
    pub g_currFrame: s16,
    pub g_stageTimeLimit2: s16,
    pub initBallPos: Vec,
    pub ballDeltaXLo: *mut u8_,
    pub ballDeltaXHi: *mut u8_,
    pub ballDeltaYLo: *mut u8_,
    pub ballDeltaYHi: *mut u8_,
    pub ballDeltaZLo: *mut u8_,
    pub ballDeltaZHi: *mut u8_,
    pub ballRotXLo: *mut u8_,
    pub ballRotXHi: *mut u8_,
    pub ballRotYLo: *mut u8_,
    pub ballRotYHi: *mut u8_,
    pub ballRotZLo: *mut u8_,
    pub ballRotZHi: *mut u8_,
    pub sparkDirX: *mut u8_,
    pub sparkDirY: *mut u8_,
    pub sparkDirZ: *mut u8_,
    pub sparkIntensity: *mut u8_,
    pub coliFlags0: *mut u8_,
    pub coliFlags1: *mut u8_,
    pub coliFlags2: *mut u8_,
    pub coliFlags3: *mut u8_,
    pub stageTiltXLo: *mut u8_,
    pub stageTiltXHi: *mut u8_,
    pub stageTiltZLo: *mut u8_,
    pub stageTiltZHi: *mut u8_,
    pub field63_0xa8: [u8_; 4usize],
    pub playableItemgroupCount: s16,
    pub seesawCount: s16,
    pub playableItemgroupAnimFrames: *mut u8_,
    pub seesawState: *mut u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Replay"][::core::mem::size_of::<Replay>() - 184usize];
    ["Alignment of Replay"][::core::mem::align_of::<Replay>() - 1usize];
    ["Offset of field: Replay::field_0x0"][::core::mem::offset_of!(Replay, field_0x0) - 0usize];
    ["Offset of field: Replay::difficulty"][::core::mem::offset_of!(Replay, difficulty) - 4usize];
    ["Offset of field: Replay::floorNum"][::core::mem::offset_of!(Replay, floorNum) - 5usize];
    ["Offset of field: Replay::monkey"][::core::mem::offset_of!(Replay, monkey) - 6usize];
    ["Offset of field: Replay::field_0x7"][::core::mem::offset_of!(Replay, field_0x7) - 7usize];
    ["Offset of field: Replay::field16_0x10"]
        [::core::mem::offset_of!(Replay, field16_0x10) - 16usize];
    ["Offset of field: Replay::field_0x14"][::core::mem::offset_of!(Replay, field_0x14) - 20usize];
    ["Offset of field: Replay::g_stageTimeLimit1"]
        [::core::mem::offset_of!(Replay, g_stageTimeLimit1) - 24usize];
    ["Offset of field: Replay::g_duration"][::core::mem::offset_of!(Replay, g_duration) - 26usize];
    ["Offset of field: Replay::field_0x1c"][::core::mem::offset_of!(Replay, field_0x1c) - 28usize];
    ["Offset of field: Replay::goalId"][::core::mem::offset_of!(Replay, goalId) - 30usize];
    ["Offset of field: Replay::field_0x20"][::core::mem::offset_of!(Replay, field_0x20) - 32usize];
    ["Offset of field: Replay::g_ballVelAtGoal"]
        [::core::mem::offset_of!(Replay, g_ballVelAtGoal) - 36usize];
    ["Offset of field: Replay::field_0x30"][::core::mem::offset_of!(Replay, field_0x30) - 48usize];
    ["Offset of field: Replay::size"][::core::mem::offset_of!(Replay, size) - 52usize];
    ["Offset of field: Replay::g_currFrame"]
        [::core::mem::offset_of!(Replay, g_currFrame) - 56usize];
    ["Offset of field: Replay::g_stageTimeLimit2"]
        [::core::mem::offset_of!(Replay, g_stageTimeLimit2) - 58usize];
    ["Offset of field: Replay::initBallPos"]
        [::core::mem::offset_of!(Replay, initBallPos) - 60usize];
    ["Offset of field: Replay::ballDeltaXLo"]
        [::core::mem::offset_of!(Replay, ballDeltaXLo) - 72usize];
    ["Offset of field: Replay::ballDeltaXHi"]
        [::core::mem::offset_of!(Replay, ballDeltaXHi) - 76usize];
    ["Offset of field: Replay::ballDeltaYLo"]
        [::core::mem::offset_of!(Replay, ballDeltaYLo) - 80usize];
    ["Offset of field: Replay::ballDeltaYHi"]
        [::core::mem::offset_of!(Replay, ballDeltaYHi) - 84usize];
    ["Offset of field: Replay::ballDeltaZLo"]
        [::core::mem::offset_of!(Replay, ballDeltaZLo) - 88usize];
    ["Offset of field: Replay::ballDeltaZHi"]
        [::core::mem::offset_of!(Replay, ballDeltaZHi) - 92usize];
    ["Offset of field: Replay::ballRotXLo"][::core::mem::offset_of!(Replay, ballRotXLo) - 96usize];
    ["Offset of field: Replay::ballRotXHi"][::core::mem::offset_of!(Replay, ballRotXHi) - 100usize];
    ["Offset of field: Replay::ballRotYLo"][::core::mem::offset_of!(Replay, ballRotYLo) - 104usize];
    ["Offset of field: Replay::ballRotYHi"][::core::mem::offset_of!(Replay, ballRotYHi) - 108usize];
    ["Offset of field: Replay::ballRotZLo"][::core::mem::offset_of!(Replay, ballRotZLo) - 112usize];
    ["Offset of field: Replay::ballRotZHi"][::core::mem::offset_of!(Replay, ballRotZHi) - 116usize];
    ["Offset of field: Replay::sparkDirX"][::core::mem::offset_of!(Replay, sparkDirX) - 120usize];
    ["Offset of field: Replay::sparkDirY"][::core::mem::offset_of!(Replay, sparkDirY) - 124usize];
    ["Offset of field: Replay::sparkDirZ"][::core::mem::offset_of!(Replay, sparkDirZ) - 128usize];
    ["Offset of field: Replay::sparkIntensity"]
        [::core::mem::offset_of!(Replay, sparkIntensity) - 132usize];
    ["Offset of field: Replay::coliFlags0"][::core::mem::offset_of!(Replay, coliFlags0) - 136usize];
    ["Offset of field: Replay::coliFlags1"][::core::mem::offset_of!(Replay, coliFlags1) - 140usize];
    ["Offset of field: Replay::coliFlags2"][::core::mem::offset_of!(Replay, coliFlags2) - 144usize];
    ["Offset of field: Replay::coliFlags3"][::core::mem::offset_of!(Replay, coliFlags3) - 148usize];
    ["Offset of field: Replay::stageTiltXLo"]
        [::core::mem::offset_of!(Replay, stageTiltXLo) - 152usize];
    ["Offset of field: Replay::stageTiltXHi"]
        [::core::mem::offset_of!(Replay, stageTiltXHi) - 156usize];
    ["Offset of field: Replay::stageTiltZLo"]
        [::core::mem::offset_of!(Replay, stageTiltZLo) - 160usize];
    ["Offset of field: Replay::stageTiltZHi"]
        [::core::mem::offset_of!(Replay, stageTiltZHi) - 164usize];
    ["Offset of field: Replay::field63_0xa8"]
        [::core::mem::offset_of!(Replay, field63_0xa8) - 168usize];
    ["Offset of field: Replay::playableItemgroupCount"]
        [::core::mem::offset_of!(Replay, playableItemgroupCount) - 172usize];
    ["Offset of field: Replay::seesawCount"]
        [::core::mem::offset_of!(Replay, seesawCount) - 174usize];
    ["Offset of field: Replay::playableItemgroupAnimFrames"]
        [::core::mem::offset_of!(Replay, playableItemgroupAnimFrames) - 176usize];
    ["Offset of field: Replay::seesawState"]
        [::core::mem::offset_of!(Replay, seesawState) - 180usize];
};
pub type PApe = *mut Ape;
pub type PSomeApeState = *mut SomeApeState;
pub type PMal = *mut Mal;
pub type PSKLRoot = *mut SKLRoot;
pub type PArcFileInfo = *mut ArcFileInfo;
pub type PSKLFile = *mut SKLFile;
pub type PGApeAnim = *mut GApeAnim;
pub type PGmaBuffer = *mut GmaBuffer;
pub const GAME_COMMON: _bindgen_ty_12 = 0;
pub const GAME_MAIN: _bindgen_ty_12 = 1;
pub const GAME_DUMMY1: _bindgen_ty_12 = 2;
pub const GAME_DUMMY2: _bindgen_ty_12 = 3;
pub const GAME_DUMMY3: _bindgen_ty_12 = 4;
pub const GAME_DUMMY4: _bindgen_ty_12 = 5;
pub const GAME_DUMMY5: _bindgen_ty_12 = 6;
pub const GAME_DUMMY6: _bindgen_ty_12 = 7;
pub const GAME_DUMMY7: _bindgen_ty_12 = 8;
pub const GAME_DUMMY8: _bindgen_ty_12 = 9;
pub const GAME_DUMMY9: _bindgen_ty_12 = 10;
pub const GAME_DUMMY10: _bindgen_ty_12 = 11;
pub const GAME_RACE: _bindgen_ty_12 = 12;
pub const GAME_FGT: _bindgen_ty_12 = 13;
pub const GAME_PILOT: _bindgen_ty_12 = 14;
pub const GAME_GOLF: _bindgen_ty_12 = 15;
pub const GAME_BOWL: _bindgen_ty_12 = 16;
pub const GAME_BILL: _bindgen_ty_12 = 17;
pub const GAME_BOAT: _bindgen_ty_12 = 18;
pub const GAME_DOGF: _bindgen_ty_12 = 19;
pub const GAME_TENNIS: _bindgen_ty_12 = 20;
pub const GAME_BBALL: _bindgen_ty_12 = 21;
pub const GAME_GUNS: _bindgen_ty_12 = 22;
pub const GAME_ADV: _bindgen_ty_12 = 23;
pub const GAME_SEL: _bindgen_ty_12 = 24;
pub const GAME_COMMEND: _bindgen_ty_12 = 25;
pub const GAME_SCENE1A: _bindgen_ty_12 = 26;
pub const GAME_SCENE1B: _bindgen_ty_12 = 27;
pub const GAME_SCENE2: _bindgen_ty_12 = 28;
pub const GAME_SCENE3: _bindgen_ty_12 = 29;
pub const GAME_SCENE4: _bindgen_ty_12 = 30;
pub const GAME_SCENE5: _bindgen_ty_12 = 31;
pub const GAME_SCENE6: _bindgen_ty_12 = 32;
pub const GAME_SCENE7: _bindgen_ty_12 = 33;
pub const GAME_SCENE8: _bindgen_ty_12 = 34;
pub const GAME_SCENE9: _bindgen_ty_12 = 35;
pub const GAME_SCENE10: _bindgen_ty_12 = 36;
pub const GAME_LASTSCENE: _bindgen_ty_12 = 37;
pub const GAME_ENDING1: _bindgen_ty_12 = 38;
pub const GAME_ENDING2: _bindgen_ty_12 = 39;
pub const GAME_ENDING3: _bindgen_ty_12 = 40;
pub const GAME_ENDING4: _bindgen_ty_12 = 41;
pub type _bindgen_ty_12 = ::core::ffi::c_uint;
pub type ApeGame = undefined2;
pub const FACE_BASE: _bindgen_ty_13 = 0;
pub const FACE_CLOSEEYE: _bindgen_ty_13 = 1;
pub const FACE_SMILE: _bindgen_ty_13 = 2;
pub const FACE_PISTOFF: _bindgen_ty_13 = 3;
pub const FACE_SOB: _bindgen_ty_13 = 4;
pub const FACE_SURPRISE: _bindgen_ty_13 = 5;
pub const FACE_TALK: _bindgen_ty_13 = 6;
pub const FACE_SMILETALK: _bindgen_ty_13 = 7;
pub const FACE_PISTOFFTALK: _bindgen_ty_13 = 8;
pub const FACE_SOBTALK: _bindgen_ty_13 = 9;
pub type _bindgen_ty_13 = ::core::ffi::c_uint;
pub type ApeFace = undefined2;
pub type PQuat = *mut Quat;
pub const LOD_HIGH: _bindgen_ty_14 = 0;
pub const LOD_MIDDLE: _bindgen_ty_14 = 1;
pub const LOD_LOW: _bindgen_ty_14 = 2;
pub const LOD_LOWEST: _bindgen_ty_14 = 3;
pub type _bindgen_ty_14 = ::core::ffi::c_uint;
pub type ApeLOD = undefined4;
pub type PSKLInfo = *mut SKLInfo;
pub type PgFloats = *mut gFloats;
pub type PARCHandle = *mut ARCHandle;
pub type PSKLBone = *mut SKLBone;
pub type Pg_thing = *mut g_thing;
pub type PGmaModelEntry = *mut GmaModelEntry;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Quat {
    pub x: f32_,
    pub y: f32_,
    pub z: f32_,
    pub w: f32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Quat"][::core::mem::size_of::<Quat>() - 16usize];
    ["Alignment of Quat"][::core::mem::align_of::<Quat>() - 1usize];
    ["Offset of field: Quat::x"][::core::mem::offset_of!(Quat, x) - 0usize];
    ["Offset of field: Quat::y"][::core::mem::offset_of!(Quat, y) - 4usize];
    ["Offset of field: Quat::z"][::core::mem::offset_of!(Quat, z) - 8usize];
    ["Offset of field: Quat::w"][::core::mem::offset_of!(Quat, w) - 12usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct gFloats {
    pub field0_0x0: ::core::ffi::c_short,
    pub field1_0x2: ::core::ffi::c_short,
    pub field2_0x4: ::core::ffi::c_short,
    pub field3_0x6: ::core::ffi::c_short,
    pub vec3: Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gFloats"][::core::mem::size_of::<gFloats>() - 20usize];
    ["Alignment of gFloats"][::core::mem::align_of::<gFloats>() - 1usize];
    ["Offset of field: gFloats::field0_0x0"][::core::mem::offset_of!(gFloats, field0_0x0) - 0usize];
    ["Offset of field: gFloats::field1_0x2"][::core::mem::offset_of!(gFloats, field1_0x2) - 2usize];
    ["Offset of field: gFloats::field2_0x4"][::core::mem::offset_of!(gFloats, field2_0x4) - 4usize];
    ["Offset of field: gFloats::field3_0x6"][::core::mem::offset_of!(gFloats, field3_0x6) - 6usize];
    ["Offset of field: gFloats::vec3"][::core::mem::offset_of!(gFloats, vec3) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SKLRoot {
    pub bone_count: ushort,
    pub g_flag: ushort,
    pub g_some_float: f32,
    pub bones: *mut SKLInfo,
    pub rotation1: Quat,
    pub rotation2: Quat,
    pub g_bone_name: *mut ::core::ffi::c_char,
    pub translation: Vec,
    pub field_0x3c: [undefined; 4usize],
    pub float_thing1: gFloats,
    pub field_0x54: [undefined; 4usize],
    pub float_thing2: gFloats,
    pub field_0x6c: [undefined; 4usize],
    pub gBoneData: *mut SKLInfo,
    pub field_0x74: [undefined; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SKLRoot"][::core::mem::size_of::<SKLRoot>() - 372usize];
    ["Alignment of SKLRoot"][::core::mem::align_of::<SKLRoot>() - 1usize];
    ["Offset of field: SKLRoot::bone_count"][::core::mem::offset_of!(SKLRoot, bone_count) - 0usize];
    ["Offset of field: SKLRoot::g_flag"][::core::mem::offset_of!(SKLRoot, g_flag) - 2usize];
    ["Offset of field: SKLRoot::g_some_float"]
        [::core::mem::offset_of!(SKLRoot, g_some_float) - 4usize];
    ["Offset of field: SKLRoot::bones"][::core::mem::offset_of!(SKLRoot, bones) - 8usize];
    ["Offset of field: SKLRoot::rotation1"][::core::mem::offset_of!(SKLRoot, rotation1) - 12usize];
    ["Offset of field: SKLRoot::rotation2"][::core::mem::offset_of!(SKLRoot, rotation2) - 28usize];
    ["Offset of field: SKLRoot::g_bone_name"]
        [::core::mem::offset_of!(SKLRoot, g_bone_name) - 44usize];
    ["Offset of field: SKLRoot::translation"]
        [::core::mem::offset_of!(SKLRoot, translation) - 48usize];
    ["Offset of field: SKLRoot::field_0x3c"]
        [::core::mem::offset_of!(SKLRoot, field_0x3c) - 60usize];
    ["Offset of field: SKLRoot::float_thing1"]
        [::core::mem::offset_of!(SKLRoot, float_thing1) - 64usize];
    ["Offset of field: SKLRoot::field_0x54"]
        [::core::mem::offset_of!(SKLRoot, field_0x54) - 84usize];
    ["Offset of field: SKLRoot::float_thing2"]
        [::core::mem::offset_of!(SKLRoot, float_thing2) - 88usize];
    ["Offset of field: SKLRoot::field_0x6c"]
        [::core::mem::offset_of!(SKLRoot, field_0x6c) - 108usize];
    ["Offset of field: SKLRoot::gBoneData"][::core::mem::offset_of!(SKLRoot, gBoneData) - 112usize];
    ["Offset of field: SKLRoot::field_0x74"]
        [::core::mem::offset_of!(SKLRoot, field_0x74) - 116usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SomeApeState {
    pub g_chara_idx: u8_,
    pub field_0x1: [undefined; 7usize],
    pub g_buf5: *mut ::core::ffi::c_void,
    pub field_0xc: [undefined; 16usize],
    pub g_arc: *mut ArcFileInfo,
    pub field_0x20: [undefined; 8usize],
    pub g_buf3: *mut ::core::ffi::c_void,
    pub g_buf1: *mut ::core::ffi::c_void,
    pub g_buf2: *mut ::core::ffi::c_void,
    pub g_buf4: *mut ::core::ffi::c_void,
    pub field_0x38: [undefined; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SomeApeState"][::core::mem::size_of::<SomeApeState>() - 96usize];
    ["Alignment of SomeApeState"][::core::mem::align_of::<SomeApeState>() - 1usize];
    ["Offset of field: SomeApeState::g_chara_idx"]
        [::core::mem::offset_of!(SomeApeState, g_chara_idx) - 0usize];
    ["Offset of field: SomeApeState::field_0x1"]
        [::core::mem::offset_of!(SomeApeState, field_0x1) - 1usize];
    ["Offset of field: SomeApeState::g_buf5"]
        [::core::mem::offset_of!(SomeApeState, g_buf5) - 8usize];
    ["Offset of field: SomeApeState::field_0xc"]
        [::core::mem::offset_of!(SomeApeState, field_0xc) - 12usize];
    ["Offset of field: SomeApeState::g_arc"]
        [::core::mem::offset_of!(SomeApeState, g_arc) - 28usize];
    ["Offset of field: SomeApeState::field_0x20"]
        [::core::mem::offset_of!(SomeApeState, field_0x20) - 32usize];
    ["Offset of field: SomeApeState::g_buf3"]
        [::core::mem::offset_of!(SomeApeState, g_buf3) - 40usize];
    ["Offset of field: SomeApeState::g_buf1"]
        [::core::mem::offset_of!(SomeApeState, g_buf1) - 44usize];
    ["Offset of field: SomeApeState::g_buf2"]
        [::core::mem::offset_of!(SomeApeState, g_buf2) - 48usize];
    ["Offset of field: SomeApeState::g_buf4"]
        [::core::mem::offset_of!(SomeApeState, g_buf4) - 52usize];
    ["Offset of field: SomeApeState::field_0x38"]
        [::core::mem::offset_of!(SomeApeState, field_0x38) - 56usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SKLBone {
    pub parentNumber: ::core::ffi::c_short,
    pub g_maybe_flag: ::core::ffi::c_short,
    pub Rotation1: Quat,
    pub Rotation2: Quat,
    pub Translation: Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SKLBone"][::core::mem::size_of::<SKLBone>() - 48usize];
    ["Alignment of SKLBone"][::core::mem::align_of::<SKLBone>() - 1usize];
    ["Offset of field: SKLBone::parentNumber"]
        [::core::mem::offset_of!(SKLBone, parentNumber) - 0usize];
    ["Offset of field: SKLBone::g_maybe_flag"]
        [::core::mem::offset_of!(SKLBone, g_maybe_flag) - 2usize];
    ["Offset of field: SKLBone::Rotation1"][::core::mem::offset_of!(SKLBone, Rotation1) - 4usize];
    ["Offset of field: SKLBone::Rotation2"][::core::mem::offset_of!(SKLBone, Rotation2) - 20usize];
    ["Offset of field: SKLBone::Translation"]
        [::core::mem::offset_of!(SKLBone, Translation) - 36usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SKLFile {
    pub bone_count: ::core::ffi::c_short,
    pub padding: undefined2,
    pub bone_section: SKLBone,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SKLFile"][::core::mem::size_of::<SKLFile>() - 52usize];
    ["Alignment of SKLFile"][::core::mem::align_of::<SKLFile>() - 1usize];
    ["Offset of field: SKLFile::bone_count"][::core::mem::offset_of!(SKLFile, bone_count) - 0usize];
    ["Offset of field: SKLFile::padding"][::core::mem::offset_of!(SKLFile, padding) - 2usize];
    ["Offset of field: SKLFile::bone_section"]
        [::core::mem::offset_of!(SKLFile, bone_section) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ArcFileInfo {
    pub Handle: *mut ARCHandle,
    pub startoffset: ::core::ffi::c_int,
    pub length: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArcFileInfo"][::core::mem::size_of::<ArcFileInfo>() - 12usize];
    ["Alignment of ArcFileInfo"][::core::mem::align_of::<ArcFileInfo>() - 1usize];
    ["Offset of field: ArcFileInfo::Handle"][::core::mem::offset_of!(ArcFileInfo, Handle) - 0usize];
    ["Offset of field: ArcFileInfo::startoffset"]
        [::core::mem::offset_of!(ArcFileInfo, startoffset) - 4usize];
    ["Offset of field: ArcFileInfo::length"][::core::mem::offset_of!(ArcFileInfo, length) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct g_thing {
    pub field_0x0: [undefined; 8usize],
    pub Name: *mut ::core::ffi::c_char,
    pub field_0xc: [undefined; 28usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of g_thing"][::core::mem::size_of::<g_thing>() - 40usize];
    ["Alignment of g_thing"][::core::mem::align_of::<g_thing>() - 1usize];
    ["Offset of field: g_thing::field_0x0"][::core::mem::offset_of!(g_thing, field_0x0) - 0usize];
    ["Offset of field: g_thing::Name"][::core::mem::offset_of!(g_thing, Name) - 8usize];
    ["Offset of field: g_thing::field_0xc"][::core::mem::offset_of!(g_thing, field_0xc) - 12usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GmaBuffer {
    pub model_count: s32,
    pub model_list_ptr: *mut ::core::ffi::c_void,
    pub model_entries: *mut GmaModelEntry,
    pub model_names_ptr: dword,
    pub g_initially_zero: dword,
    pub field_0x14: [undefined; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GmaBuffer"][::core::mem::size_of::<GmaBuffer>() - 32usize];
    ["Alignment of GmaBuffer"][::core::mem::align_of::<GmaBuffer>() - 1usize];
    ["Offset of field: GmaBuffer::model_count"]
        [::core::mem::offset_of!(GmaBuffer, model_count) - 0usize];
    ["Offset of field: GmaBuffer::model_list_ptr"]
        [::core::mem::offset_of!(GmaBuffer, model_list_ptr) - 4usize];
    ["Offset of field: GmaBuffer::model_entries"]
        [::core::mem::offset_of!(GmaBuffer, model_entries) - 8usize];
    ["Offset of field: GmaBuffer::model_names_ptr"]
        [::core::mem::offset_of!(GmaBuffer, model_names_ptr) - 12usize];
    ["Offset of field: GmaBuffer::g_initially_zero"]
        [::core::mem::offset_of!(GmaBuffer, g_initially_zero) - 16usize];
    ["Offset of field: GmaBuffer::field_0x14"]
        [::core::mem::offset_of!(GmaBuffer, field_0x14) - 20usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SKLInfo {
    pub bone_name: *mut ::core::ffi::c_char,
    pub g_flag: ::core::ffi::c_short,
    pub parentNumber: ::core::ffi::c_short,
    pub vec3f1: Vec,
    pub vec3f1_len: f32,
    pub vec3f1copy: Vec,
    pub g_float: f32,
    pub g_mtx1: Mtx,
    pub g_mtx2: undefined1,
    pub field_0x59: [undefined; 47usize],
    pub matrix: Mtx,
    pub vec3f3: Vec,
    pub field_0xc4: [undefined; 12usize],
    pub g_float2: f32,
    pub field_0xd4: [undefined; 160usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SKLInfo"][::core::mem::size_of::<SKLInfo>() - 372usize];
    ["Alignment of SKLInfo"][::core::mem::align_of::<SKLInfo>() - 1usize];
    ["Offset of field: SKLInfo::bone_name"][::core::mem::offset_of!(SKLInfo, bone_name) - 0usize];
    ["Offset of field: SKLInfo::g_flag"][::core::mem::offset_of!(SKLInfo, g_flag) - 4usize];
    ["Offset of field: SKLInfo::parentNumber"]
        [::core::mem::offset_of!(SKLInfo, parentNumber) - 6usize];
    ["Offset of field: SKLInfo::vec3f1"][::core::mem::offset_of!(SKLInfo, vec3f1) - 8usize];
    ["Offset of field: SKLInfo::vec3f1_len"]
        [::core::mem::offset_of!(SKLInfo, vec3f1_len) - 20usize];
    ["Offset of field: SKLInfo::vec3f1copy"]
        [::core::mem::offset_of!(SKLInfo, vec3f1copy) - 24usize];
    ["Offset of field: SKLInfo::g_float"][::core::mem::offset_of!(SKLInfo, g_float) - 36usize];
    ["Offset of field: SKLInfo::g_mtx1"][::core::mem::offset_of!(SKLInfo, g_mtx1) - 40usize];
    ["Offset of field: SKLInfo::g_mtx2"][::core::mem::offset_of!(SKLInfo, g_mtx2) - 88usize];
    ["Offset of field: SKLInfo::field_0x59"]
        [::core::mem::offset_of!(SKLInfo, field_0x59) - 89usize];
    ["Offset of field: SKLInfo::matrix"][::core::mem::offset_of!(SKLInfo, matrix) - 136usize];
    ["Offset of field: SKLInfo::vec3f3"][::core::mem::offset_of!(SKLInfo, vec3f3) - 184usize];
    ["Offset of field: SKLInfo::field_0xc4"]
        [::core::mem::offset_of!(SKLInfo, field_0xc4) - 196usize];
    ["Offset of field: SKLInfo::g_float2"][::core::mem::offset_of!(SKLInfo, g_float2) - 208usize];
    ["Offset of field: SKLInfo::field_0xd4"]
        [::core::mem::offset_of!(SKLInfo, field_0xd4) - 212usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ARCHandle {
    pub arc_data: *mut ::core::ffi::c_void,
    pub g_first_node_offset: *mut ::core::ffi::c_void,
    pub c: s32,
    pub d: s32,
    pub e: s32,
    pub f: s32,
    pub g: s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ARCHandle"][::core::mem::size_of::<ARCHandle>() - 28usize];
    ["Alignment of ARCHandle"][::core::mem::align_of::<ARCHandle>() - 1usize];
    ["Offset of field: ARCHandle::arc_data"][::core::mem::offset_of!(ARCHandle, arc_data) - 0usize];
    ["Offset of field: ARCHandle::g_first_node_offset"]
        [::core::mem::offset_of!(ARCHandle, g_first_node_offset) - 4usize];
    ["Offset of field: ARCHandle::c"][::core::mem::offset_of!(ARCHandle, c) - 8usize];
    ["Offset of field: ARCHandle::d"][::core::mem::offset_of!(ARCHandle, d) - 12usize];
    ["Offset of field: ARCHandle::e"][::core::mem::offset_of!(ARCHandle, e) - 16usize];
    ["Offset of field: ARCHandle::f"][::core::mem::offset_of!(ARCHandle, f) - 20usize];
    ["Offset of field: ARCHandle::g"][::core::mem::offset_of!(ARCHandle, g) - 24usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GApeAnim {
    pub field0_0x0: u8_,
    pub field_0x1: [undefined; 3usize],
    pub count: *mut g_thing,
    pub ape: *mut GApeAnim,
    pub field6_0xc: *mut s32,
    pub field_0x10: [undefined; 12usize],
    pub g_either_motion_or_skel2: s32,
    pub field_0x20: [undefined; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GApeAnim"][::core::mem::size_of::<GApeAnim>() - 40usize];
    ["Alignment of GApeAnim"][::core::mem::align_of::<GApeAnim>() - 1usize];
    ["Offset of field: GApeAnim::field0_0x0"]
        [::core::mem::offset_of!(GApeAnim, field0_0x0) - 0usize];
    ["Offset of field: GApeAnim::field_0x1"][::core::mem::offset_of!(GApeAnim, field_0x1) - 1usize];
    ["Offset of field: GApeAnim::count"][::core::mem::offset_of!(GApeAnim, count) - 4usize];
    ["Offset of field: GApeAnim::ape"][::core::mem::offset_of!(GApeAnim, ape) - 8usize];
    ["Offset of field: GApeAnim::field6_0xc"]
        [::core::mem::offset_of!(GApeAnim, field6_0xc) - 12usize];
    ["Offset of field: GApeAnim::field_0x10"]
        [::core::mem::offset_of!(GApeAnim, field_0x10) - 16usize];
    ["Offset of field: GApeAnim::g_either_motion_or_skel2"]
        [::core::mem::offset_of!(GApeAnim, g_either_motion_or_skel2) - 28usize];
    ["Offset of field: GApeAnim::field_0x20"]
        [::core::mem::offset_of!(GApeAnim, field_0x20) - 32usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Ape {
    pub g_some_ape_state: *mut SomeApeState,
    pub common_mal: *mut Mal,
    pub game_mal: *mut ::core::ffi::c_void,
    pub frame_ptr: *mut SKLRoot,
    pub arc_location: *mut ArcFileInfo,
    pub g_some_ptr: f32,
    pub faceSKLStorage: *mut SKLRoot,
    pub faceSKLFile: *mut SKLFile,
    pub faceMTA: *mut ::core::ffi::c_void,
    pub handRSKLStorage: *mut SKLRoot,
    pub handRSKLFile: *mut SKLFile,
    pub handrMTA: *mut ::core::ffi::c_void,
    pub handLSKLStorage: *mut SKLRoot,
    pub handLSKLFile: *mut SKLFile,
    pub handlMTA: *mut ::core::ffi::c_void,
    pub tailSKLStorage: *mut SKLRoot,
    pub tailSKLFile: *mut SKLFile,
    pub animLengthBytes: *mut GApeAnim,
    pub g_some_skl: *mut SKLRoot,
    pub GMABuffer: *mut GmaBuffer,
    pub TPLBuffer: *mut TplBuffer,
    pub field21_0x54: undefined2,
    pub field_0x56: [undefined; 2usize],
    pub field24_0x58: undefined2,
    pub field_0x5a: [undefined; 2usize],
    pub anim_func: *mut ::core::ffi::c_void,
    pub float_0x60: f32,
    pub field_0x64: [undefined; 16usize],
    pub game: ApeGame,
    pub g_ape_variant: ::core::ffi::c_char,
    pub field_0x77: [undefined; 1usize],
    pub g_smth_with_game: ::core::ffi::c_int,
    pub field49_0x7c: undefined4,
    pub field50_0x80: undefined2,
    pub field_0x82: [undefined; 2usize],
    pub field53_0x84: ::core::ffi::c_short,
    pub chara_anim_type: u8_,
    pub g_anim_step: byte,
    pub ape_total_index: ::core::ffi::c_int,
    pub g_handr_short: ushort,
    pub g_handl_short: ushort,
    pub face: ApeFace,
    pub field_0x92: [undefined; 6usize],
    pub g_handl_float: f32,
    pub g_handr_float: f32,
    pub some_flag: ushort,
    pub some_flag_1: ushort,
    pub field_0xa4: [undefined; 4usize],
    pub g_some_length1: ::core::ffi::c_int,
    pub field75_0xac: ::core::ffi::c_int,
    pub field76_0xb0: f32,
    pub field77_0xb4: undefined4,
    pub field78_0xb8: undefined4,
    pub field79_0xbc: undefined4,
    pub field80_0xc0: ::core::ffi::c_int,
    pub g_frames1: [*mut ::core::ffi::c_void; 40usize],
    pub field82_0x164: *mut ::core::ffi::c_void,
    pub field83_0x168: *mut ::core::ffi::c_void,
    pub field84_0x16c: *mut ::core::ffi::c_void,
    pub field85_0x170: *mut ::core::ffi::c_void,
    pub field86_0x174: *mut ::core::ffi::c_void,
    pub field87_0x178: *mut ::core::ffi::c_void,
    pub field88_0x17c: *mut ::core::ffi::c_void,
    pub field89_0x180: *mut ::core::ffi::c_void,
    pub field90_0x184: *mut ::core::ffi::c_void,
    pub field91_0x188: *mut ::core::ffi::c_void,
    pub field92_0x18c: *mut ::core::ffi::c_void,
    pub field93_0x190: *mut ::core::ffi::c_void,
    pub field94_0x194: *mut ::core::ffi::c_void,
    pub field95_0x198: *mut ::core::ffi::c_void,
    pub field96_0x19c: *mut ::core::ffi::c_void,
    pub field97_0x1a0: *mut ::core::ffi::c_void,
    pub field98_0x1a4: *mut ::core::ffi::c_void,
    pub field99_0x1a8: *mut ::core::ffi::c_void,
    pub field100_0x1ac: *mut ::core::ffi::c_void,
    pub field101_0x1b0: *mut ::core::ffi::c_void,
    pub field102_0x1b4: *mut ::core::ffi::c_void,
    pub field103_0x1b8: *mut ::core::ffi::c_void,
    pub field104_0x1bc: *mut ::core::ffi::c_void,
    pub field_0x1c0: [undefined; 28usize],
    pub expression_models: [*mut ::core::ffi::c_void; 9usize],
    pub field_0x200: [undefined; 4usize],
    pub HandL_GHA_model: *mut ::core::ffi::c_void,
    pub HandL_PHA_model: *mut ::core::ffi::c_void,
    pub HandR_GHA_model: *mut ::core::ffi::c_void,
    pub HANDR_PHA_model: *mut ::core::ffi::c_void,
    pub float_0x214: f32,
    pub field143_0x218: ::core::ffi::c_short,
    pub field_0x21a: [undefined; 2usize],
    pub flag2: ::core::ffi::c_char,
    pub field_0x21d: [undefined; 3usize],
    pub flag3: uint,
    pub flag4: uint,
    pub field_0x228: [undefined; 20usize],
    pub field172_0x23c: undefined4,
    pub field173_0x240: undefined4,
    pub character: ::core::ffi::c_int,
    pub flag1: u32_,
    pub field176_0x24c: undefined4,
    pub field177_0x250: undefined4,
    pub field178_0x254: undefined4,
    pub pos: Vec,
    pub some_vec3: Vec,
    pub field181_0x270: undefined4,
    pub field182_0x274: undefined4,
    pub field183_0x278: undefined4,
    pub field184_0x27c: undefined4,
    pub scale: f32,
    pub field_0x284: [undefined; 4usize],
    pub chara_rotation: Quat,
    pub ape_index: ::core::ffi::c_int,
    pub field192_0x29c: undefined4,
    pub lod: ApeLOD,
    pub field194_0x2a4: undefined4,
    pub g_smth_w_velocity1: f32,
    pub g_smth_w_velocity2: f32,
    pub g_smth_w_velocity3: f32,
    pub g_smth_w_velocity4: f32,
    pub field199_0x2b8: undefined4,
    pub color_index: ::core::ffi::c_int,
    pub field_0x2c0: [undefined; 8usize],
    pub ball_idx: ::core::ffi::c_char,
    pub camera_visible_bitmask: byte,
    pub field_0x2ca: [undefined; 2usize],
    pub field213_0x2cc: f32,
    pub field214_0x2d0: f32,
    pub field215_0x2d4: f32,
    pub field216_0x2d8: f32,
    pub field217_0x2dc: f32,
    pub field218_0x2e0: f32,
    pub field219_0x2e4: f32,
    pub field220_0x2e8: f32,
    pub field221_0x2ec: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Ape"][::core::mem::size_of::<Ape>() - 752usize];
    ["Alignment of Ape"][::core::mem::align_of::<Ape>() - 1usize];
    ["Offset of field: Ape::g_some_ape_state"]
        [::core::mem::offset_of!(Ape, g_some_ape_state) - 0usize];
    ["Offset of field: Ape::common_mal"][::core::mem::offset_of!(Ape, common_mal) - 4usize];
    ["Offset of field: Ape::game_mal"][::core::mem::offset_of!(Ape, game_mal) - 8usize];
    ["Offset of field: Ape::frame_ptr"][::core::mem::offset_of!(Ape, frame_ptr) - 12usize];
    ["Offset of field: Ape::arc_location"][::core::mem::offset_of!(Ape, arc_location) - 16usize];
    ["Offset of field: Ape::g_some_ptr"][::core::mem::offset_of!(Ape, g_some_ptr) - 20usize];
    ["Offset of field: Ape::faceSKLStorage"]
        [::core::mem::offset_of!(Ape, faceSKLStorage) - 24usize];
    ["Offset of field: Ape::faceSKLFile"][::core::mem::offset_of!(Ape, faceSKLFile) - 28usize];
    ["Offset of field: Ape::faceMTA"][::core::mem::offset_of!(Ape, faceMTA) - 32usize];
    ["Offset of field: Ape::handRSKLStorage"]
        [::core::mem::offset_of!(Ape, handRSKLStorage) - 36usize];
    ["Offset of field: Ape::handRSKLFile"][::core::mem::offset_of!(Ape, handRSKLFile) - 40usize];
    ["Offset of field: Ape::handrMTA"][::core::mem::offset_of!(Ape, handrMTA) - 44usize];
    ["Offset of field: Ape::handLSKLStorage"]
        [::core::mem::offset_of!(Ape, handLSKLStorage) - 48usize];
    ["Offset of field: Ape::handLSKLFile"][::core::mem::offset_of!(Ape, handLSKLFile) - 52usize];
    ["Offset of field: Ape::handlMTA"][::core::mem::offset_of!(Ape, handlMTA) - 56usize];
    ["Offset of field: Ape::tailSKLStorage"]
        [::core::mem::offset_of!(Ape, tailSKLStorage) - 60usize];
    ["Offset of field: Ape::tailSKLFile"][::core::mem::offset_of!(Ape, tailSKLFile) - 64usize];
    ["Offset of field: Ape::animLengthBytes"]
        [::core::mem::offset_of!(Ape, animLengthBytes) - 68usize];
    ["Offset of field: Ape::g_some_skl"][::core::mem::offset_of!(Ape, g_some_skl) - 72usize];
    ["Offset of field: Ape::GMABuffer"][::core::mem::offset_of!(Ape, GMABuffer) - 76usize];
    ["Offset of field: Ape::TPLBuffer"][::core::mem::offset_of!(Ape, TPLBuffer) - 80usize];
    ["Offset of field: Ape::field21_0x54"][::core::mem::offset_of!(Ape, field21_0x54) - 84usize];
    ["Offset of field: Ape::field_0x56"][::core::mem::offset_of!(Ape, field_0x56) - 86usize];
    ["Offset of field: Ape::field24_0x58"][::core::mem::offset_of!(Ape, field24_0x58) - 88usize];
    ["Offset of field: Ape::field_0x5a"][::core::mem::offset_of!(Ape, field_0x5a) - 90usize];
    ["Offset of field: Ape::anim_func"][::core::mem::offset_of!(Ape, anim_func) - 92usize];
    ["Offset of field: Ape::float_0x60"][::core::mem::offset_of!(Ape, float_0x60) - 96usize];
    ["Offset of field: Ape::field_0x64"][::core::mem::offset_of!(Ape, field_0x64) - 100usize];
    ["Offset of field: Ape::game"][::core::mem::offset_of!(Ape, game) - 116usize];
    ["Offset of field: Ape::g_ape_variant"][::core::mem::offset_of!(Ape, g_ape_variant) - 118usize];
    ["Offset of field: Ape::field_0x77"][::core::mem::offset_of!(Ape, field_0x77) - 119usize];
    ["Offset of field: Ape::g_smth_with_game"]
        [::core::mem::offset_of!(Ape, g_smth_with_game) - 120usize];
    ["Offset of field: Ape::field49_0x7c"][::core::mem::offset_of!(Ape, field49_0x7c) - 124usize];
    ["Offset of field: Ape::field50_0x80"][::core::mem::offset_of!(Ape, field50_0x80) - 128usize];
    ["Offset of field: Ape::field_0x82"][::core::mem::offset_of!(Ape, field_0x82) - 130usize];
    ["Offset of field: Ape::field53_0x84"][::core::mem::offset_of!(Ape, field53_0x84) - 132usize];
    ["Offset of field: Ape::chara_anim_type"]
        [::core::mem::offset_of!(Ape, chara_anim_type) - 134usize];
    ["Offset of field: Ape::g_anim_step"][::core::mem::offset_of!(Ape, g_anim_step) - 135usize];
    ["Offset of field: Ape::ape_total_index"]
        [::core::mem::offset_of!(Ape, ape_total_index) - 136usize];
    ["Offset of field: Ape::g_handr_short"][::core::mem::offset_of!(Ape, g_handr_short) - 140usize];
    ["Offset of field: Ape::g_handl_short"][::core::mem::offset_of!(Ape, g_handl_short) - 142usize];
    ["Offset of field: Ape::face"][::core::mem::offset_of!(Ape, face) - 144usize];
    ["Offset of field: Ape::field_0x92"][::core::mem::offset_of!(Ape, field_0x92) - 146usize];
    ["Offset of field: Ape::g_handl_float"][::core::mem::offset_of!(Ape, g_handl_float) - 152usize];
    ["Offset of field: Ape::g_handr_float"][::core::mem::offset_of!(Ape, g_handr_float) - 156usize];
    ["Offset of field: Ape::some_flag"][::core::mem::offset_of!(Ape, some_flag) - 160usize];
    ["Offset of field: Ape::some_flag_1"][::core::mem::offset_of!(Ape, some_flag_1) - 162usize];
    ["Offset of field: Ape::field_0xa4"][::core::mem::offset_of!(Ape, field_0xa4) - 164usize];
    ["Offset of field: Ape::g_some_length1"]
        [::core::mem::offset_of!(Ape, g_some_length1) - 168usize];
    ["Offset of field: Ape::field75_0xac"][::core::mem::offset_of!(Ape, field75_0xac) - 172usize];
    ["Offset of field: Ape::field76_0xb0"][::core::mem::offset_of!(Ape, field76_0xb0) - 176usize];
    ["Offset of field: Ape::field77_0xb4"][::core::mem::offset_of!(Ape, field77_0xb4) - 180usize];
    ["Offset of field: Ape::field78_0xb8"][::core::mem::offset_of!(Ape, field78_0xb8) - 184usize];
    ["Offset of field: Ape::field79_0xbc"][::core::mem::offset_of!(Ape, field79_0xbc) - 188usize];
    ["Offset of field: Ape::field80_0xc0"][::core::mem::offset_of!(Ape, field80_0xc0) - 192usize];
    ["Offset of field: Ape::g_frames1"][::core::mem::offset_of!(Ape, g_frames1) - 196usize];
    ["Offset of field: Ape::field82_0x164"][::core::mem::offset_of!(Ape, field82_0x164) - 356usize];
    ["Offset of field: Ape::field83_0x168"][::core::mem::offset_of!(Ape, field83_0x168) - 360usize];
    ["Offset of field: Ape::field84_0x16c"][::core::mem::offset_of!(Ape, field84_0x16c) - 364usize];
    ["Offset of field: Ape::field85_0x170"][::core::mem::offset_of!(Ape, field85_0x170) - 368usize];
    ["Offset of field: Ape::field86_0x174"][::core::mem::offset_of!(Ape, field86_0x174) - 372usize];
    ["Offset of field: Ape::field87_0x178"][::core::mem::offset_of!(Ape, field87_0x178) - 376usize];
    ["Offset of field: Ape::field88_0x17c"][::core::mem::offset_of!(Ape, field88_0x17c) - 380usize];
    ["Offset of field: Ape::field89_0x180"][::core::mem::offset_of!(Ape, field89_0x180) - 384usize];
    ["Offset of field: Ape::field90_0x184"][::core::mem::offset_of!(Ape, field90_0x184) - 388usize];
    ["Offset of field: Ape::field91_0x188"][::core::mem::offset_of!(Ape, field91_0x188) - 392usize];
    ["Offset of field: Ape::field92_0x18c"][::core::mem::offset_of!(Ape, field92_0x18c) - 396usize];
    ["Offset of field: Ape::field93_0x190"][::core::mem::offset_of!(Ape, field93_0x190) - 400usize];
    ["Offset of field: Ape::field94_0x194"][::core::mem::offset_of!(Ape, field94_0x194) - 404usize];
    ["Offset of field: Ape::field95_0x198"][::core::mem::offset_of!(Ape, field95_0x198) - 408usize];
    ["Offset of field: Ape::field96_0x19c"][::core::mem::offset_of!(Ape, field96_0x19c) - 412usize];
    ["Offset of field: Ape::field97_0x1a0"][::core::mem::offset_of!(Ape, field97_0x1a0) - 416usize];
    ["Offset of field: Ape::field98_0x1a4"][::core::mem::offset_of!(Ape, field98_0x1a4) - 420usize];
    ["Offset of field: Ape::field99_0x1a8"][::core::mem::offset_of!(Ape, field99_0x1a8) - 424usize];
    ["Offset of field: Ape::field100_0x1ac"]
        [::core::mem::offset_of!(Ape, field100_0x1ac) - 428usize];
    ["Offset of field: Ape::field101_0x1b0"]
        [::core::mem::offset_of!(Ape, field101_0x1b0) - 432usize];
    ["Offset of field: Ape::field102_0x1b4"]
        [::core::mem::offset_of!(Ape, field102_0x1b4) - 436usize];
    ["Offset of field: Ape::field103_0x1b8"]
        [::core::mem::offset_of!(Ape, field103_0x1b8) - 440usize];
    ["Offset of field: Ape::field104_0x1bc"]
        [::core::mem::offset_of!(Ape, field104_0x1bc) - 444usize];
    ["Offset of field: Ape::field_0x1c0"][::core::mem::offset_of!(Ape, field_0x1c0) - 448usize];
    ["Offset of field: Ape::expression_models"]
        [::core::mem::offset_of!(Ape, expression_models) - 476usize];
    ["Offset of field: Ape::field_0x200"][::core::mem::offset_of!(Ape, field_0x200) - 512usize];
    ["Offset of field: Ape::HandL_GHA_model"]
        [::core::mem::offset_of!(Ape, HandL_GHA_model) - 516usize];
    ["Offset of field: Ape::HandL_PHA_model"]
        [::core::mem::offset_of!(Ape, HandL_PHA_model) - 520usize];
    ["Offset of field: Ape::HandR_GHA_model"]
        [::core::mem::offset_of!(Ape, HandR_GHA_model) - 524usize];
    ["Offset of field: Ape::HANDR_PHA_model"]
        [::core::mem::offset_of!(Ape, HANDR_PHA_model) - 528usize];
    ["Offset of field: Ape::float_0x214"][::core::mem::offset_of!(Ape, float_0x214) - 532usize];
    ["Offset of field: Ape::field143_0x218"]
        [::core::mem::offset_of!(Ape, field143_0x218) - 536usize];
    ["Offset of field: Ape::field_0x21a"][::core::mem::offset_of!(Ape, field_0x21a) - 538usize];
    ["Offset of field: Ape::flag2"][::core::mem::offset_of!(Ape, flag2) - 540usize];
    ["Offset of field: Ape::field_0x21d"][::core::mem::offset_of!(Ape, field_0x21d) - 541usize];
    ["Offset of field: Ape::flag3"][::core::mem::offset_of!(Ape, flag3) - 544usize];
    ["Offset of field: Ape::flag4"][::core::mem::offset_of!(Ape, flag4) - 548usize];
    ["Offset of field: Ape::field_0x228"][::core::mem::offset_of!(Ape, field_0x228) - 552usize];
    ["Offset of field: Ape::field172_0x23c"]
        [::core::mem::offset_of!(Ape, field172_0x23c) - 572usize];
    ["Offset of field: Ape::field173_0x240"]
        [::core::mem::offset_of!(Ape, field173_0x240) - 576usize];
    ["Offset of field: Ape::character"][::core::mem::offset_of!(Ape, character) - 580usize];
    ["Offset of field: Ape::flag1"][::core::mem::offset_of!(Ape, flag1) - 584usize];
    ["Offset of field: Ape::field176_0x24c"]
        [::core::mem::offset_of!(Ape, field176_0x24c) - 588usize];
    ["Offset of field: Ape::field177_0x250"]
        [::core::mem::offset_of!(Ape, field177_0x250) - 592usize];
    ["Offset of field: Ape::field178_0x254"]
        [::core::mem::offset_of!(Ape, field178_0x254) - 596usize];
    ["Offset of field: Ape::pos"][::core::mem::offset_of!(Ape, pos) - 600usize];
    ["Offset of field: Ape::some_vec3"][::core::mem::offset_of!(Ape, some_vec3) - 612usize];
    ["Offset of field: Ape::field181_0x270"]
        [::core::mem::offset_of!(Ape, field181_0x270) - 624usize];
    ["Offset of field: Ape::field182_0x274"]
        [::core::mem::offset_of!(Ape, field182_0x274) - 628usize];
    ["Offset of field: Ape::field183_0x278"]
        [::core::mem::offset_of!(Ape, field183_0x278) - 632usize];
    ["Offset of field: Ape::field184_0x27c"]
        [::core::mem::offset_of!(Ape, field184_0x27c) - 636usize];
    ["Offset of field: Ape::scale"][::core::mem::offset_of!(Ape, scale) - 640usize];
    ["Offset of field: Ape::field_0x284"][::core::mem::offset_of!(Ape, field_0x284) - 644usize];
    ["Offset of field: Ape::chara_rotation"]
        [::core::mem::offset_of!(Ape, chara_rotation) - 648usize];
    ["Offset of field: Ape::ape_index"][::core::mem::offset_of!(Ape, ape_index) - 664usize];
    ["Offset of field: Ape::field192_0x29c"]
        [::core::mem::offset_of!(Ape, field192_0x29c) - 668usize];
    ["Offset of field: Ape::lod"][::core::mem::offset_of!(Ape, lod) - 672usize];
    ["Offset of field: Ape::field194_0x2a4"]
        [::core::mem::offset_of!(Ape, field194_0x2a4) - 676usize];
    ["Offset of field: Ape::g_smth_w_velocity1"]
        [::core::mem::offset_of!(Ape, g_smth_w_velocity1) - 680usize];
    ["Offset of field: Ape::g_smth_w_velocity2"]
        [::core::mem::offset_of!(Ape, g_smth_w_velocity2) - 684usize];
    ["Offset of field: Ape::g_smth_w_velocity3"]
        [::core::mem::offset_of!(Ape, g_smth_w_velocity3) - 688usize];
    ["Offset of field: Ape::g_smth_w_velocity4"]
        [::core::mem::offset_of!(Ape, g_smth_w_velocity4) - 692usize];
    ["Offset of field: Ape::field199_0x2b8"]
        [::core::mem::offset_of!(Ape, field199_0x2b8) - 696usize];
    ["Offset of field: Ape::color_index"][::core::mem::offset_of!(Ape, color_index) - 700usize];
    ["Offset of field: Ape::field_0x2c0"][::core::mem::offset_of!(Ape, field_0x2c0) - 704usize];
    ["Offset of field: Ape::ball_idx"][::core::mem::offset_of!(Ape, ball_idx) - 712usize];
    ["Offset of field: Ape::camera_visible_bitmask"]
        [::core::mem::offset_of!(Ape, camera_visible_bitmask) - 713usize];
    ["Offset of field: Ape::field_0x2ca"][::core::mem::offset_of!(Ape, field_0x2ca) - 714usize];
    ["Offset of field: Ape::field213_0x2cc"]
        [::core::mem::offset_of!(Ape, field213_0x2cc) - 716usize];
    ["Offset of field: Ape::field214_0x2d0"]
        [::core::mem::offset_of!(Ape, field214_0x2d0) - 720usize];
    ["Offset of field: Ape::field215_0x2d4"]
        [::core::mem::offset_of!(Ape, field215_0x2d4) - 724usize];
    ["Offset of field: Ape::field216_0x2d8"]
        [::core::mem::offset_of!(Ape, field216_0x2d8) - 728usize];
    ["Offset of field: Ape::field217_0x2dc"]
        [::core::mem::offset_of!(Ape, field217_0x2dc) - 732usize];
    ["Offset of field: Ape::field218_0x2e0"]
        [::core::mem::offset_of!(Ape, field218_0x2e0) - 736usize];
    ["Offset of field: Ape::field219_0x2e4"]
        [::core::mem::offset_of!(Ape, field219_0x2e4) - 740usize];
    ["Offset of field: Ape::field220_0x2e8"]
        [::core::mem::offset_of!(Ape, field220_0x2e8) - 744usize];
    ["Offset of field: Ape::field221_0x2ec"]
        [::core::mem::offset_of!(Ape, field221_0x2ec) - 748usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Mal {
    pub field_0x0: [undefined; 33usize],
    pub g_some_count: u8_,
    pub field_0x22: [undefined; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Mal"][::core::mem::size_of::<Mal>() - 48usize];
    ["Alignment of Mal"][::core::mem::align_of::<Mal>() - 1usize];
    ["Offset of field: Mal::field_0x0"][::core::mem::offset_of!(Mal, field_0x0) - 0usize];
    ["Offset of field: Mal::g_some_count"][::core::mem::offset_of!(Mal, g_some_count) - 33usize];
    ["Offset of field: Mal::field_0x22"][::core::mem::offset_of!(Mal, field_0x22) - 34usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GmaModelEntry {
    pub model: *mut GmaModel,
    pub name: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GmaModelEntry"][::core::mem::size_of::<GmaModelEntry>() - 8usize];
    ["Alignment of GmaModelEntry"][::core::mem::align_of::<GmaModelEntry>() - 1usize];
    ["Offset of field: GmaModelEntry::model"]
        [::core::mem::offset_of!(GmaModelEntry, model) - 0usize];
    ["Offset of field: GmaModelEntry::name"][::core::mem::offset_of!(GmaModelEntry, name) - 4usize];
};
pub type PCamera = *mut Camera;
pub type PVec2d = *mut Vec2d;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Vec2d {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vec2d"][::core::mem::size_of::<Vec2d>() - 8usize];
    ["Alignment of Vec2d"][::core::mem::align_of::<Vec2d>() - 1usize];
    ["Offset of field: Vec2d::x"][::core::mem::offset_of!(Vec2d, x) - 0usize];
    ["Offset of field: Vec2d::y"][::core::mem::offset_of!(Vec2d, y) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Camera {
    pub pos: Vec,
    pub pivot: Vec,
    pub rot: S16Vec,
    pub mode: u8_,
    pub submode: u8_,
    pub g_some_float: f32,
    pub g_some_bitflags: u16_,
    pub g_some_flag: u8_,
    pub g_some_flag2: u8_,
    pub g_some_float2: f32,
    pub g_some_float3: f32,
    pub fov: s16,
    pub next_fov: s16,
    pub aspect: f32,
    pub fov_tangent: f32,
    pub fov_cotangent: f32,
    pub near: f32,
    pub far: f32,
    pub viewport_pos: Vec2d,
    pub viewport_size: Vec2d,
    pub g_some_counter1: u16_,
    pub g_some_short: u16_,
    pub g_initial_pivot: Vec,
    pub g_spinin_value_1: f32,
    pub g_spinin_value_2: f32,
    pub field25_0x70: undefined2,
    pub field26_0x72: undefined2,
    pub field27_0x74: undefined2,
    pub field28_0x76: undefined2,
    pub field_0x78: [undefined; 4usize],
    pub g_final_pivot: Vec,
    pub field_0x88: [undefined; 8usize],
    pub field42_0x90: undefined2,
    pub field43_0x92: undefined2,
    pub field_0x94: [undefined; 8usize],
    pub vel: Vec,
    pub pivot_vel: Vec,
    pub g_pos_desire: Vec,
    pub g_pivot_x_rot: s16,
    pub field_0xc2: [undefined; 82usize],
    pub g_y_rot_vel: s16,
    pub field_0x116: [undefined; 2usize],
    pub g_some_goal_idx: undefined1,
    pub field_0x119: [undefined; 27usize],
    pub g_some_vec5: Vec,
    pub g_some_vec6: Vec,
    pub g_some_mtx1: Mtx,
    pub g_some_mtx2: Mtx,
    pub g_some_mtx3: Mtx,
    pub g_some_mtx4: Mtx,
    pub idx: u32_,
    pub field_0x210: [undefined; 124usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Camera"][::core::mem::size_of::<Camera>() - 652usize];
    ["Alignment of Camera"][::core::mem::align_of::<Camera>() - 1usize];
    ["Offset of field: Camera::pos"][::core::mem::offset_of!(Camera, pos) - 0usize];
    ["Offset of field: Camera::pivot"][::core::mem::offset_of!(Camera, pivot) - 12usize];
    ["Offset of field: Camera::rot"][::core::mem::offset_of!(Camera, rot) - 24usize];
    ["Offset of field: Camera::mode"][::core::mem::offset_of!(Camera, mode) - 30usize];
    ["Offset of field: Camera::submode"][::core::mem::offset_of!(Camera, submode) - 31usize];
    ["Offset of field: Camera::g_some_float"]
        [::core::mem::offset_of!(Camera, g_some_float) - 32usize];
    ["Offset of field: Camera::g_some_bitflags"]
        [::core::mem::offset_of!(Camera, g_some_bitflags) - 36usize];
    ["Offset of field: Camera::g_some_flag"]
        [::core::mem::offset_of!(Camera, g_some_flag) - 38usize];
    ["Offset of field: Camera::g_some_flag2"]
        [::core::mem::offset_of!(Camera, g_some_flag2) - 39usize];
    ["Offset of field: Camera::g_some_float2"]
        [::core::mem::offset_of!(Camera, g_some_float2) - 40usize];
    ["Offset of field: Camera::g_some_float3"]
        [::core::mem::offset_of!(Camera, g_some_float3) - 44usize];
    ["Offset of field: Camera::fov"][::core::mem::offset_of!(Camera, fov) - 48usize];
    ["Offset of field: Camera::next_fov"][::core::mem::offset_of!(Camera, next_fov) - 50usize];
    ["Offset of field: Camera::aspect"][::core::mem::offset_of!(Camera, aspect) - 52usize];
    ["Offset of field: Camera::fov_tangent"]
        [::core::mem::offset_of!(Camera, fov_tangent) - 56usize];
    ["Offset of field: Camera::fov_cotangent"]
        [::core::mem::offset_of!(Camera, fov_cotangent) - 60usize];
    ["Offset of field: Camera::near"][::core::mem::offset_of!(Camera, near) - 64usize];
    ["Offset of field: Camera::far"][::core::mem::offset_of!(Camera, far) - 68usize];
    ["Offset of field: Camera::viewport_pos"]
        [::core::mem::offset_of!(Camera, viewport_pos) - 72usize];
    ["Offset of field: Camera::viewport_size"]
        [::core::mem::offset_of!(Camera, viewport_size) - 80usize];
    ["Offset of field: Camera::g_some_counter1"]
        [::core::mem::offset_of!(Camera, g_some_counter1) - 88usize];
    ["Offset of field: Camera::g_some_short"]
        [::core::mem::offset_of!(Camera, g_some_short) - 90usize];
    ["Offset of field: Camera::g_initial_pivot"]
        [::core::mem::offset_of!(Camera, g_initial_pivot) - 92usize];
    ["Offset of field: Camera::g_spinin_value_1"]
        [::core::mem::offset_of!(Camera, g_spinin_value_1) - 104usize];
    ["Offset of field: Camera::g_spinin_value_2"]
        [::core::mem::offset_of!(Camera, g_spinin_value_2) - 108usize];
    ["Offset of field: Camera::field25_0x70"]
        [::core::mem::offset_of!(Camera, field25_0x70) - 112usize];
    ["Offset of field: Camera::field26_0x72"]
        [::core::mem::offset_of!(Camera, field26_0x72) - 114usize];
    ["Offset of field: Camera::field27_0x74"]
        [::core::mem::offset_of!(Camera, field27_0x74) - 116usize];
    ["Offset of field: Camera::field28_0x76"]
        [::core::mem::offset_of!(Camera, field28_0x76) - 118usize];
    ["Offset of field: Camera::field_0x78"][::core::mem::offset_of!(Camera, field_0x78) - 120usize];
    ["Offset of field: Camera::g_final_pivot"]
        [::core::mem::offset_of!(Camera, g_final_pivot) - 124usize];
    ["Offset of field: Camera::field_0x88"][::core::mem::offset_of!(Camera, field_0x88) - 136usize];
    ["Offset of field: Camera::field42_0x90"]
        [::core::mem::offset_of!(Camera, field42_0x90) - 144usize];
    ["Offset of field: Camera::field43_0x92"]
        [::core::mem::offset_of!(Camera, field43_0x92) - 146usize];
    ["Offset of field: Camera::field_0x94"][::core::mem::offset_of!(Camera, field_0x94) - 148usize];
    ["Offset of field: Camera::vel"][::core::mem::offset_of!(Camera, vel) - 156usize];
    ["Offset of field: Camera::pivot_vel"][::core::mem::offset_of!(Camera, pivot_vel) - 168usize];
    ["Offset of field: Camera::g_pos_desire"]
        [::core::mem::offset_of!(Camera, g_pos_desire) - 180usize];
    ["Offset of field: Camera::g_pivot_x_rot"]
        [::core::mem::offset_of!(Camera, g_pivot_x_rot) - 192usize];
    ["Offset of field: Camera::field_0xc2"][::core::mem::offset_of!(Camera, field_0xc2) - 194usize];
    ["Offset of field: Camera::g_y_rot_vel"]
        [::core::mem::offset_of!(Camera, g_y_rot_vel) - 276usize];
    ["Offset of field: Camera::field_0x116"]
        [::core::mem::offset_of!(Camera, field_0x116) - 278usize];
    ["Offset of field: Camera::g_some_goal_idx"]
        [::core::mem::offset_of!(Camera, g_some_goal_idx) - 280usize];
    ["Offset of field: Camera::field_0x119"]
        [::core::mem::offset_of!(Camera, field_0x119) - 281usize];
    ["Offset of field: Camera::g_some_vec5"]
        [::core::mem::offset_of!(Camera, g_some_vec5) - 308usize];
    ["Offset of field: Camera::g_some_vec6"]
        [::core::mem::offset_of!(Camera, g_some_vec6) - 320usize];
    ["Offset of field: Camera::g_some_mtx1"]
        [::core::mem::offset_of!(Camera, g_some_mtx1) - 332usize];
    ["Offset of field: Camera::g_some_mtx2"]
        [::core::mem::offset_of!(Camera, g_some_mtx2) - 380usize];
    ["Offset of field: Camera::g_some_mtx3"]
        [::core::mem::offset_of!(Camera, g_some_mtx3) - 428usize];
    ["Offset of field: Camera::g_some_mtx4"]
        [::core::mem::offset_of!(Camera, g_some_mtx4) - 476usize];
    ["Offset of field: Camera::idx"][::core::mem::offset_of!(Camera, idx) - 524usize];
    ["Offset of field: Camera::field_0x210"]
        [::core::mem::offset_of!(Camera, field_0x210) - 528usize];
};
pub type PRect = *mut Rect;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Rect {
    pub pos: Vec,
    pub rot: S16Vec,
    pub field_0x12: [undefined; 14usize],
    pub width: f32,
    pub height: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Rect"][::core::mem::size_of::<Rect>() - 40usize];
    ["Alignment of Rect"][::core::mem::align_of::<Rect>() - 1usize];
    ["Offset of field: Rect::pos"][::core::mem::offset_of!(Rect, pos) - 0usize];
    ["Offset of field: Rect::rot"][::core::mem::offset_of!(Rect, rot) - 12usize];
    ["Offset of field: Rect::field_0x12"][::core::mem::offset_of!(Rect, field_0x12) - 18usize];
    ["Offset of field: Rect::width"][::core::mem::offset_of!(Rect, width) - 32usize];
    ["Offset of field: Rect::height"][::core::mem::offset_of!(Rect, height) - 36usize];
};
pub type POrdTblNode = *mut OrdTblNode;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OrdTblNode {
    pub next: *mut OrdTblNode,
    pub draw_func: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OrdTblNode"][::core::mem::size_of::<OrdTblNode>() - 8usize];
    ["Alignment of OrdTblNode"][::core::mem::align_of::<OrdTblNode>() - 1usize];
    ["Offset of field: OrdTblNode::next"][::core::mem::offset_of!(OrdTblNode, next) - 0usize];
    ["Offset of field: OrdTblNode::draw_func"]
        [::core::mem::offset_of!(OrdTblNode, draw_func) - 4usize];
};
pub const CHALLENGE_MODE: _bindgen_ty_15 = 0;
pub const COMPETITION_MODE: _bindgen_ty_15 = 1;
pub const PRACTICE_MODE: _bindgen_ty_15 = 2;
pub const MONKEY_RACE: _bindgen_ty_15 = 3;
pub const MONKEY_FIGHT: _bindgen_ty_15 = 4;
pub const MONKEY_TARGET: _bindgen_ty_15 = 5;
pub const MONKEY_BILLIARDS: _bindgen_ty_15 = 6;
pub const MONKEY_BOWLING: _bindgen_ty_15 = 7;
pub const MONKEY_GOLF: _bindgen_ty_15 = 8;
pub const MONKEY_SHOT: _bindgen_ty_15 = 9;
pub const MONKEY_BOAT: _bindgen_ty_15 = 10;
pub const G_SPAWN_OPPOSITE_OF_STARTPOS: _bindgen_ty_15 = 11;
pub const MONKEY_SOCCER: _bindgen_ty_15 = 12;
pub const MONKEY_DOGFIGHT: _bindgen_ty_15 = 13;
pub const STORY_MODE: _bindgen_ty_15 = 14;
pub const MONKEY_BASEBALL: _bindgen_ty_15 = 15;
pub const MONKEY_TENNIS: _bindgen_ty_15 = 16;
pub type _bindgen_ty_15 = ::core::ffi::c_uint;
pub type MainGameMode = undefined4;
pub type PSprite = *mut Sprite;
pub const SPRT_TEXT: _bindgen_ty_16 = 0;
pub const SPRT_BMP: _bindgen_ty_16 = 1;
pub const SPRT_TEXTURE: _bindgen_ty_16 = 2;
pub type _bindgen_ty_16 = ::core::ffi::c_uint;
pub type SpriteType = undefined1;
pub const FONT_ASCII: _bindgen_ty_17 = 0;
pub const FONT_ASC_8x16: _bindgen_ty_17 = 1;
pub const FONT_ASC_12x12: _bindgen_ty_17 = 2;
pub const FONT_ASC_24x24: _bindgen_ty_17 = 3;
pub const FONT_ASC_16x16P: _bindgen_ty_17 = 4;
pub const FONT_ASC_16x16: _bindgen_ty_17 = 5;
pub const FONT_DMY03: _bindgen_ty_17 = 6;
pub const FONT_DMY04: _bindgen_ty_17 = 7;
pub const FONT_DMY05: _bindgen_ty_17 = 8;
pub const FONT_ASC_72x64: _bindgen_ty_17 = 9;
pub const FONT_DMY06: _bindgen_ty_17 = 10;
pub const FONT_DMY07: _bindgen_ty_17 = 11;
pub const FONT_DMY08: _bindgen_ty_17 = 12;
pub const FONT_DMY09: _bindgen_ty_17 = 13;
pub const FONT_DMY10: _bindgen_ty_17 = 14;
pub const FONT_DMY11: _bindgen_ty_17 = 15;
pub const FONT_DMY12: _bindgen_ty_17 = 16;
pub const FONT_DMY13: _bindgen_ty_17 = 17;
pub const FONT_DMY14: _bindgen_ty_17 = 18;
pub const FONT_DMY15: _bindgen_ty_17 = 19;
pub const FONT_DMY16: _bindgen_ty_17 = 20;
pub const FONT_ICON_SD: _bindgen_ty_17 = 21;
pub const FONT_ICON_SD2: _bindgen_ty_17 = 22;
pub const FONT_DMY20: _bindgen_ty_17 = 23;
pub const FONT_DMY21: _bindgen_ty_17 = 24;
pub const FONT_DMY22: _bindgen_ty_17 = 25;
pub const FONT_DMY23: _bindgen_ty_17 = 26;
pub const FONT_DMY_RNK00: _bindgen_ty_17 = 27;
pub const FONT_DMY_RNK01: _bindgen_ty_17 = 28;
pub const FONT_DMY_RNK02: _bindgen_ty_17 = 29;
pub const FONT_DMY_RNK03: _bindgen_ty_17 = 30;
pub const FONT_DMY_RNK04: _bindgen_ty_17 = 31;
pub const FONT_RNK_32x32: _bindgen_ty_17 = 32;
pub const FONT_RNK_NUM: _bindgen_ty_17 = 33;
pub const FONT_MINI_RNK: _bindgen_ty_17 = 34;
pub const FONT_SCORE_NUM: _bindgen_ty_17 = 35;
pub const FONT_DMY_RNK0: _bindgen_ty_17 = 36;
pub const FONT_DMY_RNK1: _bindgen_ty_17 = 37;
pub const FONT_DMY_RNK2: _bindgen_ty_17 = 38;
pub const FONT_DMY_RNK3: _bindgen_ty_17 = 39;
pub const FONT_DMY_RNK4: _bindgen_ty_17 = 40;
pub const FONT_DMY_RNK5: _bindgen_ty_17 = 41;
pub const FONT_DMY_RNK6: _bindgen_ty_17 = 42;
pub const FONT_DMY_RNK7: _bindgen_ty_17 = 43;
pub const FONT_DMY_RNK8: _bindgen_ty_17 = 44;
pub const FONT_DMY_RNK9: _bindgen_ty_17 = 45;
pub const FONT_DMY_RNKa: _bindgen_ty_17 = 46;
pub const FONT_DMY_RNKb: _bindgen_ty_17 = 47;
pub const FONT_DMY_RNKc: _bindgen_ty_17 = 48;
pub const FONT_DMY_RNKd: _bindgen_ty_17 = 49;
pub const FONT_DMY_RNKe: _bindgen_ty_17 = 50;
pub const FONT_DMY_RNKf: _bindgen_ty_17 = 51;
pub const FONT_SEL_CTRL_PORT: _bindgen_ty_17 = 52;
pub const FONT_SEL_CTRL_R: _bindgen_ty_17 = 53;
pub const FONT_SEL_CTRL_B: _bindgen_ty_17 = 54;
pub const FONT_SEL_CTRL_Y: _bindgen_ty_17 = 55;
pub const FONT_SEL_CTRL_G: _bindgen_ty_17 = 56;
pub const FONT_SEL_CTRL_SDW: _bindgen_ty_17 = 57;
pub const FONT_DMY42: _bindgen_ty_17 = 58;
pub const FONT_DMY43: _bindgen_ty_17 = 59;
pub const FONT_BWL_SCORE: _bindgen_ty_17 = 60;
pub const FONT_DMY50: _bindgen_ty_17 = 61;
pub const FONT_DMY51: _bindgen_ty_17 = 62;
pub const FONT_DMY52: _bindgen_ty_17 = 63;
pub const FONT_DMY53: _bindgen_ty_17 = 64;
pub const FONT_DMY54: _bindgen_ty_17 = 65;
pub const FONT_DMY55: _bindgen_ty_17 = 66;
pub const FONT_DMY56: _bindgen_ty_17 = 67;
pub const FONT_DMY57: _bindgen_ty_17 = 68;
pub const FONT_RAC_DMY01: _bindgen_ty_17 = 69;
pub const FONT_RAC_PLAYER: _bindgen_ty_17 = 70;
pub const FONT_RAC_RANK: _bindgen_ty_17 = 71;
pub const FONT_RAC_LAP_MARK_NUM: _bindgen_ty_17 = 72;
pub const FONT_RAC_LAP_NUM: _bindgen_ty_17 = 73;
pub const FONT_RAC_TIME_NUM: _bindgen_ty_17 = 74;
pub const FONT_RAC_LAP_MARK_NUM_S: _bindgen_ty_17 = 75;
pub const FONT_RAC_DMY08: _bindgen_ty_17 = 76;
pub const FONT_RAC_DMY09: _bindgen_ty_17 = 77;
pub const FONT_RAC_DMY10: _bindgen_ty_17 = 78;
pub const FONT_RAC_SPD_NUM: _bindgen_ty_17 = 79;
pub const FONT_RAC_DMY12: _bindgen_ty_17 = 80;
pub const FONT_RAC_DMY13: _bindgen_ty_17 = 81;
pub const FONT_TGT_PLAYER: _bindgen_ty_17 = 82;
pub const FONT_TGT_MSCORE: _bindgen_ty_17 = 83;
pub const FONT_TGT_SCORE: _bindgen_ty_17 = 84;
pub const FONT_TGT_SCORE_S: _bindgen_ty_17 = 85;
pub const FONT_TGT_SPEED: _bindgen_ty_17 = 86;
pub const FONT_TGT_ROUND: _bindgen_ty_17 = 87;
pub const FONT_TGT_ALT: _bindgen_ty_17 = 88;
pub const FONT_TGT_WIND: _bindgen_ty_17 = 89;
pub const FONT_DMY71: _bindgen_ty_17 = 90;
pub const FONT_DMY72: _bindgen_ty_17 = 91;
pub const FONT_DMY73: _bindgen_ty_17 = 92;
pub const FONT_NUM_NML_SCORE: _bindgen_ty_17 = 93;
pub const FONT_NUM_NML_TIME: _bindgen_ty_17 = 94;
pub const FONT_NUM_NML_TIME_S: _bindgen_ty_17 = 95;
pub const FONT_NUM_NML_SPEED: _bindgen_ty_17 = 96;
pub const FONT_NUM_NML_SARU: _bindgen_ty_17 = 97;
pub const FONT_ASC_NML_D5: _bindgen_ty_17 = 98;
pub const FONT_ASC_NML_D6: _bindgen_ty_17 = 99;
pub const FONT_ASC_NML_D7: _bindgen_ty_17 = 100;
pub const FONT_ASC_NML_D8: _bindgen_ty_17 = 101;
pub const FONT_ASC_NML_D9: _bindgen_ty_17 = 102;
pub const FONT_DMY79: _bindgen_ty_17 = 103;
pub const FONT_DMY7a: _bindgen_ty_17 = 104;
pub const FONT_DMY7b: _bindgen_ty_17 = 105;
pub const FONT_DMY7c: _bindgen_ty_17 = 106;
pub const FONT_DMY7d: _bindgen_ty_17 = 107;
pub const FONT_DMY7e: _bindgen_ty_17 = 108;
pub const FONT_DMY7f: _bindgen_ty_17 = 109;
pub const FONT_BOA_TIME_NUM: _bindgen_ty_17 = 110;
pub const FONT_BOA_DMY02: _bindgen_ty_17 = 111;
pub const FONT_BOA_RANK: _bindgen_ty_17 = 112;
pub const FONT_BOA_PLAYER: _bindgen_ty_17 = 113;
pub const FONT_BOA_SPD_NUM: _bindgen_ty_17 = 114;
pub const FONT_BOA_LAP_MARK_NUM: _bindgen_ty_17 = 115;
pub const FONT_BOA_LAP_MARK_NUM_S: _bindgen_ty_17 = 116;
pub const FONT_BOA_DMY08: _bindgen_ty_17 = 117;
pub const FONT_BOA_DMY09: _bindgen_ty_17 = 118;
pub const FONT_BOA_DMY10: _bindgen_ty_17 = 119;
pub const FONT_BOA_LAP_NUM: _bindgen_ty_17 = 120;
pub const FONT_BOA_DMY12: _bindgen_ty_17 = 121;
pub const FONT_BOA_DMY13: _bindgen_ty_17 = 122;
pub const FONT_BOA_DMY14: _bindgen_ty_17 = 123;
pub const FONT_BOA_DMY15: _bindgen_ty_17 = 124;
pub const FONT_BOA_DMY16: _bindgen_ty_17 = 125;
pub const FONT_DOG_SPEED: _bindgen_ty_17 = 126;
pub const FONT_DOG_SPEED_S: _bindgen_ty_17 = 127;
pub const FONT_DOG_MSCORE: _bindgen_ty_17 = 128;
pub const FONT_DOG_SCORE: _bindgen_ty_17 = 129;
pub const FONT_DOG_SCORE_M: _bindgen_ty_17 = 130;
pub const FONT_DOG_SCORE_S: _bindgen_ty_17 = 131;
pub const FONT_DOG_ROUND: _bindgen_ty_17 = 132;
pub const FONT_DOG_ALT: _bindgen_ty_17 = 133;
pub const FONT_DOG_RESULT: _bindgen_ty_17 = 134;
pub const FONT_DOG_TIME: _bindgen_ty_17 = 135;
pub const FONT_DOG_DMY02: _bindgen_ty_17 = 136;
pub const FONT_DOG_DMY03: _bindgen_ty_17 = 137;
pub const FONT_DOG_DMY04: _bindgen_ty_17 = 138;
pub const FONT_DOG_DMY05: _bindgen_ty_17 = 139;
pub const FONT_JAP_TAG: _bindgen_ty_17 = 140;
pub const FONT_JAP_DMY: _bindgen_ty_17 = 141;
pub const FONT_JAP_24x24_2: _bindgen_ty_17 = 142;
pub const FONT_JAP_24x24_2P: _bindgen_ty_17 = 143;
pub const FONT_JAP_24x24_I: _bindgen_ty_17 = 144;
pub type _bindgen_ty_17 = ::core::ffi::c_uint;
pub type Font8 = undefined1;
pub const ALIGN_LOWER_RIGHT: _bindgen_ty_18 = 0;
pub const ALIGN_CENTER_RIGHT: _bindgen_ty_18 = 1;
pub const ALIGN_UPPER_RIGHT: _bindgen_ty_18 = 2;
pub const ALIGN_LOWER_CENTER: _bindgen_ty_18 = 3;
pub const ALIGN_CENTER: _bindgen_ty_18 = 4;
pub const ALIGN_UPPER_CENTER: _bindgen_ty_18 = 5;
pub const ALIGN_LOWER_LEFT: _bindgen_ty_18 = 6;
pub const ALIGN_CENTER_LEFT: _bindgen_ty_18 = 7;
pub const ALIGN_UPPER_LEFT: _bindgen_ty_18 = 8;
pub type _bindgen_ty_18 = ::core::ffi::c_uint;
pub type SpriteAlignment = undefined1;
pub type PRgb24 = *mut Rgb24;
pub const SPRITE_PRESS_START: _bindgen_ty_19 = 1;
pub const SPRITE_LOGO: _bindgen_ty_19 = 3;
pub const SPRITE_PAUSE_MENU: _bindgen_ty_19 = 4;
pub const SPRITE_HOW_TO: _bindgen_ty_19 = 10;
pub const SPRITE_SPECIAL_STAGE: _bindgen_ty_19 = 14;
pub const SPRITE_LOADIN_STAGE_NAME: _bindgen_ty_19 = 15;
pub const SPRITE_1UP: _bindgen_ty_19 = 16;
pub const SPRITE_SARU_CONTROL_DESCRIPTION: _bindgen_ty_19 = 17;
pub const SPRITE_BANANA_ICON: _bindgen_ty_19 = 21;
pub const SPRITE_HUD_STAGE_NAME: _bindgen_ty_19 = 34;
pub const SPRITE_HUD_STAGE_NUMBER: _bindgen_ty_19 = 35;
pub const SPRITE_COPYRIGHT_TEXT_1: _bindgen_ty_19 = 37;
pub const SPRITE_COPYRIGHT_TEXT_2: _bindgen_ty_19 = 38;
pub const SPRITE_COPYRIGHT_TEXT_3: _bindgen_ty_19 = 39;
pub const SPRITE_DEMO_MES: _bindgen_ty_19 = 58;
pub const SPRITE_HUD_KIWAKU_WORLD: _bindgen_ty_19 = 112;
pub const SPRITE_TITLE: _bindgen_ty_19 = 113;
pub type _bindgen_ty_19 = ::core::ffi::c_uint;
pub type SpriteUniqueID = undefined1;
pub type PSpriteTex = *mut SpriteTex;
pub type PDVDFileInfo = *mut DVDFileInfo;
pub type PDVDCommandBlock = *mut DVDCommandBlock;
pub type PDVDDiskID = *mut DVDDiskID;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Rgb24 {
    pub red: u8_,
    pub green: u8_,
    pub blue: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Rgb24"][::core::mem::size_of::<Rgb24>() - 3usize];
    ["Alignment of Rgb24"][::core::mem::align_of::<Rgb24>() - 1usize];
    ["Offset of field: Rgb24::red"][::core::mem::offset_of!(Rgb24, red) - 0usize];
    ["Offset of field: Rgb24::green"][::core::mem::offset_of!(Rgb24, green) - 1usize];
    ["Offset of field: Rgb24::blue"][::core::mem::offset_of!(Rgb24, blue) - 2usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Sprite {
    pub type_: SpriteType,
    pub font: Font8,
    pub index: u8_,
    pub alignment: SpriteAlignment,
    pub pos: Vec2d,
    pub mult_color: Rgb24,
    pub unique_id: SpriteUniqueID,
    pub g_counter: s16,
    pub widescreen_translation_x: s16,
    pub field_0x14: [undefined; 6usize],
    pub horizontal_spacing: u8_,
    pub vertical_spacing: u8_,
    pub field_0x1c: [undefined; 4usize],
    pub field21_0x20: f32,
    pub field22_0x24: undefined4,
    pub field_0x28: [undefined; 4usize],
    pub tex: *mut SpriteTex,
    pub dest_func: ::core::option::Option<unsafe extern "C" fn(arg1: *mut Sprite)>,
    pub tick_func: ::core::option::Option<unsafe extern "C" fn(arg1: *mut u8_, arg2: *mut Sprite)>,
    pub disp_func: ::core::option::Option<unsafe extern "C" fn(arg1: *mut Sprite)>,
    pub bmp: undefined2,
    pub field_0x3e: [undefined; 2usize],
    pub width: f32,
    pub height: f32,
    pub depth: f32,
    pub para1: s32,
    pub para2: s32,
    pub para3: s32,
    pub fpara1: f32_,
    pub fpara2: f32_,
    pub fpara3: f32_,
    pub prev_sprite: *mut Sprite,
    pub next_sprite: *mut Sprite,
    pub g_maybe_pos_x: undefined4,
    pub g_maybe_pos_y: undefined4,
    pub field47_0x74: undefined4,
    pub field48_0x78: undefined4,
    pub field_0x7c: [undefined; 4usize],
    pub alpha: f32,
    pub add_color: Rgb24,
    pub field_0x87: [undefined; 1usize],
    pub g_flags1: u32_,
    pub g_flags2: u32_,
    pub u1: f32_,
    pub v1: f32_,
    pub u2: f32_,
    pub v2: f32_,
    pub text: [::core::ffi::c_char; 48usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sprite"][::core::mem::size_of::<Sprite>() - 208usize];
    ["Alignment of Sprite"][::core::mem::align_of::<Sprite>() - 1usize];
    ["Offset of field: Sprite::type_"][::core::mem::offset_of!(Sprite, type_) - 0usize];
    ["Offset of field: Sprite::font"][::core::mem::offset_of!(Sprite, font) - 1usize];
    ["Offset of field: Sprite::index"][::core::mem::offset_of!(Sprite, index) - 2usize];
    ["Offset of field: Sprite::alignment"][::core::mem::offset_of!(Sprite, alignment) - 3usize];
    ["Offset of field: Sprite::pos"][::core::mem::offset_of!(Sprite, pos) - 4usize];
    ["Offset of field: Sprite::mult_color"][::core::mem::offset_of!(Sprite, mult_color) - 12usize];
    ["Offset of field: Sprite::unique_id"][::core::mem::offset_of!(Sprite, unique_id) - 15usize];
    ["Offset of field: Sprite::g_counter"][::core::mem::offset_of!(Sprite, g_counter) - 16usize];
    ["Offset of field: Sprite::widescreen_translation_x"]
        [::core::mem::offset_of!(Sprite, widescreen_translation_x) - 18usize];
    ["Offset of field: Sprite::field_0x14"][::core::mem::offset_of!(Sprite, field_0x14) - 20usize];
    ["Offset of field: Sprite::horizontal_spacing"]
        [::core::mem::offset_of!(Sprite, horizontal_spacing) - 26usize];
    ["Offset of field: Sprite::vertical_spacing"]
        [::core::mem::offset_of!(Sprite, vertical_spacing) - 27usize];
    ["Offset of field: Sprite::field_0x1c"][::core::mem::offset_of!(Sprite, field_0x1c) - 28usize];
    ["Offset of field: Sprite::field21_0x20"]
        [::core::mem::offset_of!(Sprite, field21_0x20) - 32usize];
    ["Offset of field: Sprite::field22_0x24"]
        [::core::mem::offset_of!(Sprite, field22_0x24) - 36usize];
    ["Offset of field: Sprite::field_0x28"][::core::mem::offset_of!(Sprite, field_0x28) - 40usize];
    ["Offset of field: Sprite::tex"][::core::mem::offset_of!(Sprite, tex) - 44usize];
    ["Offset of field: Sprite::dest_func"][::core::mem::offset_of!(Sprite, dest_func) - 48usize];
    ["Offset of field: Sprite::tick_func"][::core::mem::offset_of!(Sprite, tick_func) - 52usize];
    ["Offset of field: Sprite::disp_func"][::core::mem::offset_of!(Sprite, disp_func) - 56usize];
    ["Offset of field: Sprite::bmp"][::core::mem::offset_of!(Sprite, bmp) - 60usize];
    ["Offset of field: Sprite::field_0x3e"][::core::mem::offset_of!(Sprite, field_0x3e) - 62usize];
    ["Offset of field: Sprite::width"][::core::mem::offset_of!(Sprite, width) - 64usize];
    ["Offset of field: Sprite::height"][::core::mem::offset_of!(Sprite, height) - 68usize];
    ["Offset of field: Sprite::depth"][::core::mem::offset_of!(Sprite, depth) - 72usize];
    ["Offset of field: Sprite::para1"][::core::mem::offset_of!(Sprite, para1) - 76usize];
    ["Offset of field: Sprite::para2"][::core::mem::offset_of!(Sprite, para2) - 80usize];
    ["Offset of field: Sprite::para3"][::core::mem::offset_of!(Sprite, para3) - 84usize];
    ["Offset of field: Sprite::fpara1"][::core::mem::offset_of!(Sprite, fpara1) - 88usize];
    ["Offset of field: Sprite::fpara2"][::core::mem::offset_of!(Sprite, fpara2) - 92usize];
    ["Offset of field: Sprite::fpara3"][::core::mem::offset_of!(Sprite, fpara3) - 96usize];
    ["Offset of field: Sprite::prev_sprite"]
        [::core::mem::offset_of!(Sprite, prev_sprite) - 100usize];
    ["Offset of field: Sprite::next_sprite"]
        [::core::mem::offset_of!(Sprite, next_sprite) - 104usize];
    ["Offset of field: Sprite::g_maybe_pos_x"]
        [::core::mem::offset_of!(Sprite, g_maybe_pos_x) - 108usize];
    ["Offset of field: Sprite::g_maybe_pos_y"]
        [::core::mem::offset_of!(Sprite, g_maybe_pos_y) - 112usize];
    ["Offset of field: Sprite::field47_0x74"]
        [::core::mem::offset_of!(Sprite, field47_0x74) - 116usize];
    ["Offset of field: Sprite::field48_0x78"]
        [::core::mem::offset_of!(Sprite, field48_0x78) - 120usize];
    ["Offset of field: Sprite::field_0x7c"][::core::mem::offset_of!(Sprite, field_0x7c) - 124usize];
    ["Offset of field: Sprite::alpha"][::core::mem::offset_of!(Sprite, alpha) - 128usize];
    ["Offset of field: Sprite::add_color"][::core::mem::offset_of!(Sprite, add_color) - 132usize];
    ["Offset of field: Sprite::field_0x87"][::core::mem::offset_of!(Sprite, field_0x87) - 135usize];
    ["Offset of field: Sprite::g_flags1"][::core::mem::offset_of!(Sprite, g_flags1) - 136usize];
    ["Offset of field: Sprite::g_flags2"][::core::mem::offset_of!(Sprite, g_flags2) - 140usize];
    ["Offset of field: Sprite::u1"][::core::mem::offset_of!(Sprite, u1) - 144usize];
    ["Offset of field: Sprite::v1"][::core::mem::offset_of!(Sprite, v1) - 148usize];
    ["Offset of field: Sprite::u2"][::core::mem::offset_of!(Sprite, u2) - 152usize];
    ["Offset of field: Sprite::v2"][::core::mem::offset_of!(Sprite, v2) - 156usize];
    ["Offset of field: Sprite::text"][::core::mem::offset_of!(Sprite, text) - 160usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DVDCommandBlock {
    pub next: *mut DVDCommandBlock,
    pub prev: *mut DVDCommandBlock,
    pub command: u32_,
    pub state: s32,
    pub offset: u32_,
    pub length: u32_,
    pub addr: *mut ::core::ffi::c_void,
    pub currTransferSize: u32_,
    pub transferredSize: u32_,
    pub id: *mut DVDDiskID,
    pub callback:
        ::core::option::Option<unsafe extern "C" fn(arg1: s32, arg2: *mut DVDCommandBlock)>,
    pub userData: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DVDCommandBlock"][::core::mem::size_of::<DVDCommandBlock>() - 48usize];
    ["Alignment of DVDCommandBlock"][::core::mem::align_of::<DVDCommandBlock>() - 1usize];
    ["Offset of field: DVDCommandBlock::next"]
        [::core::mem::offset_of!(DVDCommandBlock, next) - 0usize];
    ["Offset of field: DVDCommandBlock::prev"]
        [::core::mem::offset_of!(DVDCommandBlock, prev) - 4usize];
    ["Offset of field: DVDCommandBlock::command"]
        [::core::mem::offset_of!(DVDCommandBlock, command) - 8usize];
    ["Offset of field: DVDCommandBlock::state"]
        [::core::mem::offset_of!(DVDCommandBlock, state) - 12usize];
    ["Offset of field: DVDCommandBlock::offset"]
        [::core::mem::offset_of!(DVDCommandBlock, offset) - 16usize];
    ["Offset of field: DVDCommandBlock::length"]
        [::core::mem::offset_of!(DVDCommandBlock, length) - 20usize];
    ["Offset of field: DVDCommandBlock::addr"]
        [::core::mem::offset_of!(DVDCommandBlock, addr) - 24usize];
    ["Offset of field: DVDCommandBlock::currTransferSize"]
        [::core::mem::offset_of!(DVDCommandBlock, currTransferSize) - 28usize];
    ["Offset of field: DVDCommandBlock::transferredSize"]
        [::core::mem::offset_of!(DVDCommandBlock, transferredSize) - 32usize];
    ["Offset of field: DVDCommandBlock::id"]
        [::core::mem::offset_of!(DVDCommandBlock, id) - 36usize];
    ["Offset of field: DVDCommandBlock::callback"]
        [::core::mem::offset_of!(DVDCommandBlock, callback) - 40usize];
    ["Offset of field: DVDCommandBlock::userData"]
        [::core::mem::offset_of!(DVDCommandBlock, userData) - 44usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DVDFileInfo {
    pub cb: DVDCommandBlock,
    pub startAddr: u32_,
    pub length: u32_,
    pub next: *mut DVDFileInfo,
    pub callback: ::core::option::Option<unsafe extern "C" fn(arg1: s32, arg2: *mut DVDFileInfo)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DVDFileInfo"][::core::mem::size_of::<DVDFileInfo>() - 64usize];
    ["Alignment of DVDFileInfo"][::core::mem::align_of::<DVDFileInfo>() - 1usize];
    ["Offset of field: DVDFileInfo::cb"][::core::mem::offset_of!(DVDFileInfo, cb) - 0usize];
    ["Offset of field: DVDFileInfo::startAddr"]
        [::core::mem::offset_of!(DVDFileInfo, startAddr) - 48usize];
    ["Offset of field: DVDFileInfo::length"]
        [::core::mem::offset_of!(DVDFileInfo, length) - 52usize];
    ["Offset of field: DVDFileInfo::next"][::core::mem::offset_of!(DVDFileInfo, next) - 56usize];
    ["Offset of field: DVDFileInfo::callback"]
        [::core::mem::offset_of!(DVDFileInfo, callback) - 60usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DVDDiskID {
    pub gameName: [::core::ffi::c_char; 4usize],
    pub company: [::core::ffi::c_char; 2usize],
    pub diskNumber: u8_,
    pub gameVersion: u8_,
    pub streaming: u8_,
    pub streamingBufSize: u8_,
    pub padding: [u8_; 22usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DVDDiskID"][::core::mem::size_of::<DVDDiskID>() - 32usize];
    ["Alignment of DVDDiskID"][::core::mem::align_of::<DVDDiskID>() - 1usize];
    ["Offset of field: DVDDiskID::gameName"][::core::mem::offset_of!(DVDDiskID, gameName) - 0usize];
    ["Offset of field: DVDDiskID::company"][::core::mem::offset_of!(DVDDiskID, company) - 4usize];
    ["Offset of field: DVDDiskID::diskNumber"]
        [::core::mem::offset_of!(DVDDiskID, diskNumber) - 6usize];
    ["Offset of field: DVDDiskID::gameVersion"]
        [::core::mem::offset_of!(DVDDiskID, gameVersion) - 7usize];
    ["Offset of field: DVDDiskID::streaming"]
        [::core::mem::offset_of!(DVDDiskID, streaming) - 8usize];
    ["Offset of field: DVDDiskID::streamingBufSize"]
        [::core::mem::offset_of!(DVDDiskID, streamingBufSize) - 9usize];
    ["Offset of field: DVDDiskID::padding"][::core::mem::offset_of!(DVDDiskID, padding) - 10usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SpriteTex {
    pub field0_0x0: u8_,
    pub field1_0x1: s8,
    pub field2_0x2: u16_,
    pub tex_index: s32,
    pub texobj: GXTexObj,
    pub tex_data: *mut ::core::ffi::c_void,
    pub tex_data_size: u32_,
    pub width: u16_,
    pub height: u16_,
    pub format: GXTexFmt,
    pub heap: OSHeapHandle,
    pub dvd_file: DVDFileInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SpriteTex"][::core::mem::size_of::<SpriteTex>() - 124usize];
    ["Alignment of SpriteTex"][::core::mem::align_of::<SpriteTex>() - 1usize];
    ["Offset of field: SpriteTex::field0_0x0"]
        [::core::mem::offset_of!(SpriteTex, field0_0x0) - 0usize];
    ["Offset of field: SpriteTex::field1_0x1"]
        [::core::mem::offset_of!(SpriteTex, field1_0x1) - 1usize];
    ["Offset of field: SpriteTex::field2_0x2"]
        [::core::mem::offset_of!(SpriteTex, field2_0x2) - 2usize];
    ["Offset of field: SpriteTex::tex_index"]
        [::core::mem::offset_of!(SpriteTex, tex_index) - 4usize];
    ["Offset of field: SpriteTex::texobj"][::core::mem::offset_of!(SpriteTex, texobj) - 8usize];
    ["Offset of field: SpriteTex::tex_data"]
        [::core::mem::offset_of!(SpriteTex, tex_data) - 40usize];
    ["Offset of field: SpriteTex::tex_data_size"]
        [::core::mem::offset_of!(SpriteTex, tex_data_size) - 44usize];
    ["Offset of field: SpriteTex::width"][::core::mem::offset_of!(SpriteTex, width) - 48usize];
    ["Offset of field: SpriteTex::height"][::core::mem::offset_of!(SpriteTex, height) - 50usize];
    ["Offset of field: SpriteTex::format"][::core::mem::offset_of!(SpriteTex, format) - 52usize];
    ["Offset of field: SpriteTex::heap"][::core::mem::offset_of!(SpriteTex, heap) - 56usize];
    ["Offset of field: SpriteTex::dvd_file"]
        [::core::mem::offset_of!(SpriteTex, dvd_file) - 60usize];
};
pub type PHeapConfig = *mut HeapConfig;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct HeapConfig {
    pub stage_heap_size: u32_,
    pub bg_heap_size: u32_,
    pub chara_heap_size: u32_,
    pub replay_heap_size: u32_,
    pub flags: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HeapConfig"][::core::mem::size_of::<HeapConfig>() - 20usize];
    ["Alignment of HeapConfig"][::core::mem::align_of::<HeapConfig>() - 1usize];
    ["Offset of field: HeapConfig::stage_heap_size"]
        [::core::mem::offset_of!(HeapConfig, stage_heap_size) - 0usize];
    ["Offset of field: HeapConfig::bg_heap_size"]
        [::core::mem::offset_of!(HeapConfig, bg_heap_size) - 4usize];
    ["Offset of field: HeapConfig::chara_heap_size"]
        [::core::mem::offset_of!(HeapConfig, chara_heap_size) - 8usize];
    ["Offset of field: HeapConfig::replay_heap_size"]
        [::core::mem::offset_of!(HeapConfig, replay_heap_size) - 12usize];
    ["Offset of field: HeapConfig::flags"][::core::mem::offset_of!(HeapConfig, flags) - 16usize];
};
pub type PGSomethingWithPadMotorsStruct = *mut GSomethingWithPadMotorsStruct;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GSomethingWithPadMotorsStruct {
    pub a: undefined1,
    pub field_0x1: [undefined; 1usize],
    pub b: undefined2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSomethingWithPadMotorsStruct"]
        [::core::mem::size_of::<GSomethingWithPadMotorsStruct>() - 4usize];
    ["Alignment of GSomethingWithPadMotorsStruct"]
        [::core::mem::align_of::<GSomethingWithPadMotorsStruct>() - 1usize];
    ["Offset of field: GSomethingWithPadMotorsStruct::a"]
        [::core::mem::offset_of!(GSomethingWithPadMotorsStruct, a) - 0usize];
    ["Offset of field: GSomethingWithPadMotorsStruct::field_0x1"]
        [::core::mem::offset_of!(GSomethingWithPadMotorsStruct, field_0x1) - 1usize];
    ["Offset of field: GSomethingWithPadMotorsStruct::b"]
        [::core::mem::offset_of!(GSomethingWithPadMotorsStruct, b) - 2usize];
};
pub type PSpriteDrawRequest = *mut SpriteDrawRequest;
pub const SDRF_G_SCREENFADE_RELATED: _bindgen_ty_20 = 262144;
pub const SDRF_FLIP_X: _bindgen_ty_20 = 524288;
pub const SDRF_FLIP_Y: _bindgen_ty_20 = 1048576;
pub const SDRF_G_ID_FORMAT_RELATED: _bindgen_ty_20 = 4194304;
pub const SDRF_G_X_SCALE_RELATED: _bindgen_ty_20 = 16777216;
pub type _bindgen_ty_20 = ::core::ffi::c_uint;
pub type SpriteDrawReqFlags = undefined4;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SpriteDrawRequest {
    pub id: s32,
    pub pos: Vec,
    pub scale: Vec2d,
    pub u1: f32,
    pub v1: f32,
    pub u2: f32,
    pub v2: f32,
    pub rot_z: s32,
    pub alpha: f32,
    pub g_unk1: s32,
    pub flags: SpriteDrawReqFlags,
    pub mult_color: u32_,
    pub add_color: u32_,
    pub widescreen_translation_x: s16,
    pub field_0x42: [undefined; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SpriteDrawRequest"][::core::mem::size_of::<SpriteDrawRequest>() - 80usize];
    ["Alignment of SpriteDrawRequest"][::core::mem::align_of::<SpriteDrawRequest>() - 1usize];
    ["Offset of field: SpriteDrawRequest::id"]
        [::core::mem::offset_of!(SpriteDrawRequest, id) - 0usize];
    ["Offset of field: SpriteDrawRequest::pos"]
        [::core::mem::offset_of!(SpriteDrawRequest, pos) - 4usize];
    ["Offset of field: SpriteDrawRequest::scale"]
        [::core::mem::offset_of!(SpriteDrawRequest, scale) - 16usize];
    ["Offset of field: SpriteDrawRequest::u1"]
        [::core::mem::offset_of!(SpriteDrawRequest, u1) - 24usize];
    ["Offset of field: SpriteDrawRequest::v1"]
        [::core::mem::offset_of!(SpriteDrawRequest, v1) - 28usize];
    ["Offset of field: SpriteDrawRequest::u2"]
        [::core::mem::offset_of!(SpriteDrawRequest, u2) - 32usize];
    ["Offset of field: SpriteDrawRequest::v2"]
        [::core::mem::offset_of!(SpriteDrawRequest, v2) - 36usize];
    ["Offset of field: SpriteDrawRequest::rot_z"]
        [::core::mem::offset_of!(SpriteDrawRequest, rot_z) - 40usize];
    ["Offset of field: SpriteDrawRequest::alpha"]
        [::core::mem::offset_of!(SpriteDrawRequest, alpha) - 44usize];
    ["Offset of field: SpriteDrawRequest::g_unk1"]
        [::core::mem::offset_of!(SpriteDrawRequest, g_unk1) - 48usize];
    ["Offset of field: SpriteDrawRequest::flags"]
        [::core::mem::offset_of!(SpriteDrawRequest, flags) - 52usize];
    ["Offset of field: SpriteDrawRequest::mult_color"]
        [::core::mem::offset_of!(SpriteDrawRequest, mult_color) - 56usize];
    ["Offset of field: SpriteDrawRequest::add_color"]
        [::core::mem::offset_of!(SpriteDrawRequest, add_color) - 60usize];
    ["Offset of field: SpriteDrawRequest::widescreen_translation_x"]
        [::core::mem::offset_of!(SpriteDrawRequest, widescreen_translation_x) - 64usize];
    ["Offset of field: SpriteDrawRequest::field_0x42"]
        [::core::mem::offset_of!(SpriteDrawRequest, field_0x42) - 66usize];
};
pub type PCmPlayerProgress = *mut CmPlayerProgress;
pub type PCmStage = *mut CmStage;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CmStage {
    pub stage_course_num: s32,
    pub stage_id: s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmStage"][::core::mem::size_of::<CmStage>() - 8usize];
    ["Alignment of CmStage"][::core::mem::align_of::<CmStage>() - 1usize];
    ["Offset of field: CmStage::stage_course_num"]
        [::core::mem::offset_of!(CmStage, stage_course_num) - 0usize];
    ["Offset of field: CmStage::stage_id"][::core::mem::offset_of!(CmStage, stage_id) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CmPlayerProgress {
    pub curr_stage: CmStage,
    pub next_stages: [CmStage; 3usize],
    pub field2_0x20: s16,
    pub g_next_stage_idx: s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmPlayerProgress"][::core::mem::size_of::<CmPlayerProgress>() - 36usize];
    ["Alignment of CmPlayerProgress"][::core::mem::align_of::<CmPlayerProgress>() - 1usize];
    ["Offset of field: CmPlayerProgress::curr_stage"]
        [::core::mem::offset_of!(CmPlayerProgress, curr_stage) - 0usize];
    ["Offset of field: CmPlayerProgress::next_stages"]
        [::core::mem::offset_of!(CmPlayerProgress, next_stages) - 8usize];
    ["Offset of field: CmPlayerProgress::field2_0x20"]
        [::core::mem::offset_of!(CmPlayerProgress, field2_0x20) - 32usize];
    ["Offset of field: CmPlayerProgress::g_next_stage_idx"]
        [::core::mem::offset_of!(CmPlayerProgress, g_next_stage_idx) - 34usize];
};
pub const PAD_ERR_NONE: _bindgen_ty_21 = 0;
pub const PAD_ERR_TRANSFER: _bindgen_ty_21 = 253;
pub const PAD_ERR_NOT_READY: _bindgen_ty_21 = 254;
pub const PAD_ERR_NO_CONTROLLER: _bindgen_ty_21 = 255;
pub type _bindgen_ty_21 = ::core::ffi::c_uint;
pub type PadError = undefined1;
pub type PGoalBag = *mut GoalBag;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GoalBag {
    pub field_0x0: [undefined; 4usize],
    pub field4_0x4: undefined4,
    pub field5_0x8: undefined4,
    pub stobj: *mut Stobj,
    pub g_pos: Vec,
    pub field_0x1c: [undefined; 8usize],
    pub field16_0x24: undefined4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GoalBag"][::core::mem::size_of::<GoalBag>() - 40usize];
    ["Alignment of GoalBag"][::core::mem::align_of::<GoalBag>() - 1usize];
    ["Offset of field: GoalBag::field_0x0"][::core::mem::offset_of!(GoalBag, field_0x0) - 0usize];
    ["Offset of field: GoalBag::field4_0x4"][::core::mem::offset_of!(GoalBag, field4_0x4) - 4usize];
    ["Offset of field: GoalBag::field5_0x8"][::core::mem::offset_of!(GoalBag, field5_0x8) - 8usize];
    ["Offset of field: GoalBag::stobj"][::core::mem::offset_of!(GoalBag, stobj) - 12usize];
    ["Offset of field: GoalBag::g_pos"][::core::mem::offset_of!(GoalBag, g_pos) - 16usize];
    ["Offset of field: GoalBag::field_0x1c"]
        [::core::mem::offset_of!(GoalBag, field_0x1c) - 28usize];
    ["Offset of field: GoalBag::field16_0x24"]
        [::core::mem::offset_of!(GoalBag, field16_0x24) - 36usize];
};
pub type PWorldInfo = *mut WorldInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct WorldInfo {
    pub stage_tilt_x: s16,
    pub stage_tilt_z: s16,
    pub field_0x4: [undefined; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WorldInfo"][::core::mem::size_of::<WorldInfo>() - 60usize];
    ["Alignment of WorldInfo"][::core::mem::align_of::<WorldInfo>() - 1usize];
    ["Offset of field: WorldInfo::stage_tilt_x"]
        [::core::mem::offset_of!(WorldInfo, stage_tilt_x) - 0usize];
    ["Offset of field: WorldInfo::stage_tilt_z"]
        [::core::mem::offset_of!(WorldInfo, stage_tilt_z) - 2usize];
    ["Offset of field: WorldInfo::field_0x4"]
        [::core::mem::offset_of!(WorldInfo, field_0x4) - 4usize];
};
pub const RETURN_WIDTH: _bindgen_ty_22 = 0;
pub const RETURN_CHARACTER_COUNT: _bindgen_ty_22 = 1;
pub const G_RETURN_SOME_BOOL: _bindgen_ty_22 = 2;
pub const RETURN_LINE_COUNT: _bindgen_ty_22 = 3;
pub const G_LOAD_ARAM_FONT: _bindgen_ty_22 = 4;
pub const G_LOAD_ARAM_FONT_2: _bindgen_ty_22 = 5;
pub type _bindgen_ty_22 = ::core::ffi::c_uint;
pub type TextdrawCharaLoadReturnParameter = undefined1;
pub type PSeesawInfo = *mut SeesawInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SeesawInfo {
    pub itemgroup_idx: ::core::ffi::c_short,
    pub g_type: word,
    pub state: *mut SeesawState,
    pub init_func: *mut ::core::ffi::c_void,
    pub dest_func: *mut ::core::ffi::c_void,
    pub tick_func: *mut ::core::ffi::c_void,
    pub coli_func: *mut ::core::ffi::c_void,
    pub g_some_func5: *mut ::core::ffi::c_void,
    pub g_replay_func: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SeesawInfo"][::core::mem::size_of::<SeesawInfo>() - 32usize];
    ["Alignment of SeesawInfo"][::core::mem::align_of::<SeesawInfo>() - 1usize];
    ["Offset of field: SeesawInfo::itemgroup_idx"]
        [::core::mem::offset_of!(SeesawInfo, itemgroup_idx) - 0usize];
    ["Offset of field: SeesawInfo::g_type"][::core::mem::offset_of!(SeesawInfo, g_type) - 2usize];
    ["Offset of field: SeesawInfo::state"][::core::mem::offset_of!(SeesawInfo, state) - 4usize];
    ["Offset of field: SeesawInfo::init_func"]
        [::core::mem::offset_of!(SeesawInfo, init_func) - 8usize];
    ["Offset of field: SeesawInfo::dest_func"]
        [::core::mem::offset_of!(SeesawInfo, dest_func) - 12usize];
    ["Offset of field: SeesawInfo::tick_func"]
        [::core::mem::offset_of!(SeesawInfo, tick_func) - 16usize];
    ["Offset of field: SeesawInfo::coli_func"]
        [::core::mem::offset_of!(SeesawInfo, coli_func) - 20usize];
    ["Offset of field: SeesawInfo::g_some_func5"]
        [::core::mem::offset_of!(SeesawInfo, g_some_func5) - 24usize];
    ["Offset of field: SeesawInfo::g_replay_func"]
        [::core::mem::offset_of!(SeesawInfo, g_replay_func) - 28usize];
};
pub type PGSoundCue = *mut GSoundCue;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GSoundCue {
    pub g_sfx_id: ::core::ffi::c_short,
    pub g_sfx_rid: ::core::ffi::c_short,
    pub field2_0x4: ::core::ffi::c_char,
    pub g_sfx_pan: byte,
    pub g_sfx_span: ::core::ffi::c_char,
    pub g_sfx_grp: ::core::ffi::c_char,
    pub player_id: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSoundCue"][::core::mem::size_of::<GSoundCue>() - 12usize];
    ["Alignment of GSoundCue"][::core::mem::align_of::<GSoundCue>() - 1usize];
    ["Offset of field: GSoundCue::g_sfx_id"][::core::mem::offset_of!(GSoundCue, g_sfx_id) - 0usize];
    ["Offset of field: GSoundCue::g_sfx_rid"]
        [::core::mem::offset_of!(GSoundCue, g_sfx_rid) - 2usize];
    ["Offset of field: GSoundCue::field2_0x4"]
        [::core::mem::offset_of!(GSoundCue, field2_0x4) - 4usize];
    ["Offset of field: GSoundCue::g_sfx_pan"]
        [::core::mem::offset_of!(GSoundCue, g_sfx_pan) - 5usize];
    ["Offset of field: GSoundCue::g_sfx_span"]
        [::core::mem::offset_of!(GSoundCue, g_sfx_span) - 6usize];
    ["Offset of field: GSoundCue::g_sfx_grp"]
        [::core::mem::offset_of!(GSoundCue, g_sfx_grp) - 7usize];
    ["Offset of field: GSoundCue::player_id"]
        [::core::mem::offset_of!(GSoundCue, player_id) - 8usize];
};
pub const DATA_SELECT: _bindgen_ty_23 = 0;
pub const STAGE_SELECT_PRE_INTRO_SEQUENCE: _bindgen_ty_23 = 1;
pub const STAGE_SELECT_INTRO_SEQUENCE: _bindgen_ty_23 = 2;
pub const STAGE_SELECT_IDLE: _bindgen_ty_23 = 4;
pub const STAGE_SELECTED: _bindgen_ty_23 = 6;
pub type _bindgen_ty_23 = ::core::ffi::c_uint;
pub type StoryModeStageSelectState = undefined2;
pub type PGCachedFileEntry = *mut GCachedFileEntry;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GCachedFileEntry {
    pub field_0x0: [undefined; 4usize],
    pub dvd_entrynum: ::core::ffi::c_int,
    pub next: *mut DVDCommandBlock,
    pub prev: *mut DVDCommandBlock,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GCachedFileEntry"][::core::mem::size_of::<GCachedFileEntry>() - 16usize];
    ["Alignment of GCachedFileEntry"][::core::mem::align_of::<GCachedFileEntry>() - 1usize];
    ["Offset of field: GCachedFileEntry::field_0x0"]
        [::core::mem::offset_of!(GCachedFileEntry, field_0x0) - 0usize];
    ["Offset of field: GCachedFileEntry::dvd_entrynum"]
        [::core::mem::offset_of!(GCachedFileEntry, dvd_entrynum) - 4usize];
    ["Offset of field: GCachedFileEntry::next"]
        [::core::mem::offset_of!(GCachedFileEntry, next) - 8usize];
    ["Offset of field: GCachedFileEntry::prev"]
        [::core::mem::offset_of!(GCachedFileEntry, prev) - 12usize];
};
pub const MF_NONE: _bindgen_ty_24 = 0;
pub const MF_0x1: _bindgen_ty_24 = 1;
pub const MF_0x2: _bindgen_ty_24 = 2;
pub const MF_0x4: _bindgen_ty_24 = 4;
pub const MF_PLAYING_EXTRA_COURSE: _bindgen_ty_24 = 8;
pub const MF_PLAYING_MASTER_NOEX_COURSE: _bindgen_ty_24 = 16;
pub const MF_0x20: _bindgen_ty_24 = 32;
pub const MF_ADDITIONAL_REL_LOADED: _bindgen_ty_24 = 512;
pub const MG_G_NO_BANANAS: _bindgen_ty_24 = 4096;
pub const MF_0x2000: _bindgen_ty_24 = 8192;
pub const MF_OPTION_MODE: _bindgen_ty_24 = 262144;
pub const MF_G_STOP_GAME_LOOP: _bindgen_ty_24 = 2097152;
pub const MF_0x400000: _bindgen_ty_24 = 4194304;
pub const MF_PLAYING_MASTER_EX_COURSE: _bindgen_ty_24 = 8388608;
pub const MF_G_PLAYING_MASTER_COURSE: _bindgen_ty_24 = 33554432;
pub type _bindgen_ty_24 = ::core::ffi::c_uint;
pub type ModeFlag = undefined4;
pub type PGSomeSpriteStruct = *mut GSomeSpriteStruct;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GSomeSpriteStruct {
    pub g_some_sprite: *mut Sprite,
    pub g_prev: *mut GSomeSpriteStruct,
    pub g_next: *mut GSomeSpriteStruct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSomeSpriteStruct"][::core::mem::size_of::<GSomeSpriteStruct>() - 12usize];
    ["Alignment of GSomeSpriteStruct"][::core::mem::align_of::<GSomeSpriteStruct>() - 1usize];
    ["Offset of field: GSomeSpriteStruct::g_some_sprite"]
        [::core::mem::offset_of!(GSomeSpriteStruct, g_some_sprite) - 0usize];
    ["Offset of field: GSomeSpriteStruct::g_prev"]
        [::core::mem::offset_of!(GSomeSpriteStruct, g_prev) - 4usize];
    ["Offset of field: GSomeSpriteStruct::g_next"]
        [::core::mem::offset_of!(GSomeSpriteStruct, g_next) - 8usize];
};
pub type PItem = *mut Item;
pub const ITEM_COIN: _bindgen_ty_25 = 0;
pub const ITEM_FGT_BANANA: _bindgen_ty_25 = 1;
pub const ITEM_MINI_RACE: _bindgen_ty_25 = 2;
pub const ITEM_FGT_POWER: _bindgen_ty_25 = 3;
pub const ITEM_FGT_PUNCH: _bindgen_ty_25 = 4;
pub const ITEM_PILOT: _bindgen_ty_25 = 5;
pub const ITEM_DOGFIGHT: _bindgen_ty_25 = 6;
pub const ITEM_TMP001: _bindgen_ty_25 = 7;
pub const ITEM_TMP002: _bindgen_ty_25 = 8;
pub const ITEM_TMP003: _bindgen_ty_25 = 9;
pub const ITEM_TMP004: _bindgen_ty_25 = 10;
pub const ITEM_TMP005: _bindgen_ty_25 = 11;
pub const ITEM_TMP006: _bindgen_ty_25 = 12;
pub const ITEM_TMP007: _bindgen_ty_25 = 13;
pub const ITEM_TMP008: _bindgen_ty_25 = 14;
pub const ITEM_TMP009: _bindgen_ty_25 = 15;
pub const ITEM_TMP010: _bindgen_ty_25 = 16;
pub const ITEM_TMP011: _bindgen_ty_25 = 17;
pub const ITEM_TMP012: _bindgen_ty_25 = 18;
pub const ITEM_TMP013: _bindgen_ty_25 = 19;
pub const ITEM_TMP014: _bindgen_ty_25 = 20;
pub const ITEM_TMP015: _bindgen_ty_25 = 21;
pub const ITEM_TMP016: _bindgen_ty_25 = 22;
pub type _bindgen_ty_25 = ::core::ffi::c_uint;
pub type ItemType = undefined2;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Item {
    pub index: word,
    pub id: ::core::ffi::c_short,
    pub type_: ItemType,
    pub coin_type: s16,
    pub g_some_bitfield: u32_,
    pub field5_0xc: undefined2,
    pub g_some_flag: undefined2,
    pub field7_0x10: ::core::ffi::c_short,
    pub g_some_flag2: undefined2,
    pub scale: f32,
    pub field10_0x18: f32,
    pub g_something_with_gma_model: *mut undefined,
    pub position: Vec,
    pub velocity: Vec,
    pub rotation: S16Vec,
    pub angular_velocity: S16Vec,
    pub g_position_copy: Vec,
    pub g_rotation_copy: S16Vec,
    pub field_0x56: [undefined; 2usize],
    pub item_coli_func:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Item, arg2: *mut PhysicsBall)>,
    pub itemgroup_idx: u8_,
    pub field_0x5d: [undefined; 1usize],
    pub g_some_frame_counter: s16,
    pub g_some_vec3f_ptr: *mut Vec,
    pub field25_0x64: undefined4,
    pub model_ptr: *mut GmaModel,
    pub field27_0x6c: f32,
    pub negative_y_rotation: s16,
    pub field_0x72: [undefined; 2usize],
    pub field31_0x74: f32,
    pub g_something_with_shadow_disp: f32,
    pub shadow_scale: Vec,
    pub shadow_intensity: f32,
    pub g_position_copy_2: Vec,
    pub g_some_flag_2: u32_,
    pub shadow_position: Vec,
    pub g_something_with_shadows: Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Item"][::core::mem::size_of::<Item>() - 180usize];
    ["Alignment of Item"][::core::mem::align_of::<Item>() - 1usize];
    ["Offset of field: Item::index"][::core::mem::offset_of!(Item, index) - 0usize];
    ["Offset of field: Item::id"][::core::mem::offset_of!(Item, id) - 2usize];
    ["Offset of field: Item::type_"][::core::mem::offset_of!(Item, type_) - 4usize];
    ["Offset of field: Item::coin_type"][::core::mem::offset_of!(Item, coin_type) - 6usize];
    ["Offset of field: Item::g_some_bitfield"]
        [::core::mem::offset_of!(Item, g_some_bitfield) - 8usize];
    ["Offset of field: Item::field5_0xc"][::core::mem::offset_of!(Item, field5_0xc) - 12usize];
    ["Offset of field: Item::g_some_flag"][::core::mem::offset_of!(Item, g_some_flag) - 14usize];
    ["Offset of field: Item::field7_0x10"][::core::mem::offset_of!(Item, field7_0x10) - 16usize];
    ["Offset of field: Item::g_some_flag2"][::core::mem::offset_of!(Item, g_some_flag2) - 18usize];
    ["Offset of field: Item::scale"][::core::mem::offset_of!(Item, scale) - 20usize];
    ["Offset of field: Item::field10_0x18"][::core::mem::offset_of!(Item, field10_0x18) - 24usize];
    ["Offset of field: Item::g_something_with_gma_model"]
        [::core::mem::offset_of!(Item, g_something_with_gma_model) - 28usize];
    ["Offset of field: Item::position"][::core::mem::offset_of!(Item, position) - 32usize];
    ["Offset of field: Item::velocity"][::core::mem::offset_of!(Item, velocity) - 44usize];
    ["Offset of field: Item::rotation"][::core::mem::offset_of!(Item, rotation) - 56usize];
    ["Offset of field: Item::angular_velocity"]
        [::core::mem::offset_of!(Item, angular_velocity) - 62usize];
    ["Offset of field: Item::g_position_copy"]
        [::core::mem::offset_of!(Item, g_position_copy) - 68usize];
    ["Offset of field: Item::g_rotation_copy"]
        [::core::mem::offset_of!(Item, g_rotation_copy) - 80usize];
    ["Offset of field: Item::field_0x56"][::core::mem::offset_of!(Item, field_0x56) - 86usize];
    ["Offset of field: Item::item_coli_func"]
        [::core::mem::offset_of!(Item, item_coli_func) - 88usize];
    ["Offset of field: Item::itemgroup_idx"]
        [::core::mem::offset_of!(Item, itemgroup_idx) - 92usize];
    ["Offset of field: Item::field_0x5d"][::core::mem::offset_of!(Item, field_0x5d) - 93usize];
    ["Offset of field: Item::g_some_frame_counter"]
        [::core::mem::offset_of!(Item, g_some_frame_counter) - 94usize];
    ["Offset of field: Item::g_some_vec3f_ptr"]
        [::core::mem::offset_of!(Item, g_some_vec3f_ptr) - 96usize];
    ["Offset of field: Item::field25_0x64"][::core::mem::offset_of!(Item, field25_0x64) - 100usize];
    ["Offset of field: Item::model_ptr"][::core::mem::offset_of!(Item, model_ptr) - 104usize];
    ["Offset of field: Item::field27_0x6c"][::core::mem::offset_of!(Item, field27_0x6c) - 108usize];
    ["Offset of field: Item::negative_y_rotation"]
        [::core::mem::offset_of!(Item, negative_y_rotation) - 112usize];
    ["Offset of field: Item::field_0x72"][::core::mem::offset_of!(Item, field_0x72) - 114usize];
    ["Offset of field: Item::field31_0x74"][::core::mem::offset_of!(Item, field31_0x74) - 116usize];
    ["Offset of field: Item::g_something_with_shadow_disp"]
        [::core::mem::offset_of!(Item, g_something_with_shadow_disp) - 120usize];
    ["Offset of field: Item::shadow_scale"][::core::mem::offset_of!(Item, shadow_scale) - 124usize];
    ["Offset of field: Item::shadow_intensity"]
        [::core::mem::offset_of!(Item, shadow_intensity) - 136usize];
    ["Offset of field: Item::g_position_copy_2"]
        [::core::mem::offset_of!(Item, g_position_copy_2) - 140usize];
    ["Offset of field: Item::g_some_flag_2"]
        [::core::mem::offset_of!(Item, g_some_flag_2) - 152usize];
    ["Offset of field: Item::shadow_position"]
        [::core::mem::offset_of!(Item, shadow_position) - 156usize];
    ["Offset of field: Item::g_something_with_shadows"]
        [::core::mem::offset_of!(Item, g_something_with_shadows) - 168usize];
};
pub const BGM_SEL_WORLD: _bindgen_ty_26 = 0;
pub const BGM_CAVE: _bindgen_ty_26 = 1;
pub const BGM_SEL_FUTSAL: _bindgen_ty_26 = 2;
pub const BGM_FUTSAL: _bindgen_ty_26 = 3;
pub const BGM_WATER: _bindgen_ty_26 = 4;
pub const BGM_SEL_DEF: _bindgen_ty_26 = 5;
pub const BGM_NABE: _bindgen_ty_26 = 6;
pub const BGM_JUNGLE: _bindgen_ty_26 = 7;
pub const BGM_BOAT: _bindgen_ty_26 = 8;
pub const BGM_BILI: _bindgen_ty_26 = 9;
pub const BGM_SEL_BOWLING: _bindgen_ty_26 = 10;
pub const BGM_SEL_GOLF: _bindgen_ty_26 = 11;
pub const BGM_CONTINUE: _bindgen_ty_26 = 12;
pub const BGM_OVER: _bindgen_ty_26 = 13;
pub const BGM_FIGHT: _bindgen_ty_26 = 14;
pub const BGM_SEL_FIGHT: _bindgen_ty_26 = 15;
pub const BGM_COLONY: _bindgen_ty_26 = 16;
pub const BGM_BILL_FOUL: _bindgen_ty_26 = 17;
pub const BGM_BILL_LOSE: _bindgen_ty_26 = 18;
pub const BGM_BILL_SENKOU: _bindgen_ty_26 = 19;
pub const BGM_BILL_WIN: _bindgen_ty_26 = 20;
pub const BGM_BOWL_MISS: _bindgen_ty_26 = 21;
pub const BGM_BOWL_NORMAL: _bindgen_ty_26 = 22;
pub const BGM_BOWL_PERFECT: _bindgen_ty_26 = 23;
pub const BGM_BOWL_SPARE: _bindgen_ty_26 = 24;
pub const BGM_BOWL_STRIKE: _bindgen_ty_26 = 25;
pub const BGM_BOWL_TURKEY: _bindgen_ty_26 = 26;
pub const BGM_FIGHT_WIN: _bindgen_ty_26 = 27;
pub const BGM_GOLF_BIRDIE: _bindgen_ty_26 = 28;
pub const BGM_GOLF_BOGIE: _bindgen_ty_26 = 29;
pub const BGM_GOLF_GIVEUP1: _bindgen_ty_26 = 30;
pub const BGM_GOLF_HOLEIN1: _bindgen_ty_26 = 31;
pub const BGM_GOLF_OB: _bindgen_ty_26 = 32;
pub const BGM_GOLF_PAR: _bindgen_ty_26 = 33;
pub const BGM_RACE_LOSE: _bindgen_ty_26 = 34;
pub const BGM_RACE_WIN: _bindgen_ty_26 = 35;
pub const BGM_TAG_MISS: _bindgen_ty_26 = 36;
pub const BGM_TAG_SCORE_HI: _bindgen_ty_26 = 37;
pub const BGM_TAG_SCORE_NML: _bindgen_ty_26 = 38;
pub const BGM_TAG_SCORE_SP: _bindgen_ty_26 = 39;
pub const BGM_AVLOGO: _bindgen_ty_26 = 40;
pub const BGM_10MIN1: _bindgen_ty_26 = 41;
pub const BGM_BONUS: _bindgen_ty_26 = 42;
pub const BGM_BOWLING: _bindgen_ty_26 = 43;
pub const BGM_10MIN2: _bindgen_ty_26 = 44;
pub const BGM_SEL_BASEBALL: _bindgen_ty_26 = 45;
pub const BGM_SEL_BOAT: _bindgen_ty_26 = 46;
pub const BGM_SEL_TARGET: _bindgen_ty_26 = 47;
pub const BGM_ENTRY: _bindgen_ty_26 = 48;
pub const BGM_HYOSHO: _bindgen_ty_26 = 49;
pub const BGM_ROLL: _bindgen_ty_26 = 50;
pub const BGM_S1A_SNG1: _bindgen_ty_26 = 51;
pub const BGM_S1A_SNG2: _bindgen_ty_26 = 52;
pub const BGM_S1A_SNG3: _bindgen_ty_26 = 53;
pub const BGM_TITLE: _bindgen_ty_26 = 54;
pub const BGM_S1A_SNG4: _bindgen_ty_26 = 55;
pub const BGM_FIGHT_VIEW: _bindgen_ty_26 = 56;
pub const BGM_GOLF_VIEW: _bindgen_ty_26 = 57;
pub const BGM_SF: _bindgen_ty_26 = 58;
pub const BGM_SEL_TENNIS: _bindgen_ty_26 = 59;
pub const BGM_TARGET: _bindgen_ty_26 = 60;
pub const BGM_YUENCHI: _bindgen_ty_26 = 61;
pub const BGM_SEL_RACE: _bindgen_ty_26 = 62;
pub const BGM_SENTAKU: _bindgen_ty_26 = 63;
pub const BGM_KUJIRA: _bindgen_ty_26 = 64;
pub const BGM_RACE: _bindgen_ty_26 = 65;
pub const BGM_GOLF: _bindgen_ty_26 = 66;
pub const BGM_SEL_BILI: _bindgen_ty_26 = 67;
pub const BGM_GREP: _bindgen_ty_26 = 68;
pub const BGM_RACE_ADVAN: _bindgen_ty_26 = 69;
pub const BGM_CLOCKTOWER: _bindgen_ty_26 = 70;
pub const BGM_BOAT_ADVAN: _bindgen_ty_26 = 71;
pub const BGM_SEL_SHOT: _bindgen_ty_26 = 72;
pub const BGM_RACE_EXPERT: _bindgen_ty_26 = 73;
pub const BGM_SEL_DOG: _bindgen_ty_26 = 74;
pub const BGM_BOAT_EXPERT: _bindgen_ty_26 = 75;
pub const BGM_BOAT_LOSE: _bindgen_ty_26 = 76;
pub const BGM_BOAT_WIN: _bindgen_ty_26 = 77;
pub const BGM_SHOT: _bindgen_ty_26 = 78;
pub const BGM_SHOT_CLEAR: _bindgen_ty_26 = 79;
pub const BGM_SHOT_LOSE: _bindgen_ty_26 = 80;
pub const BGM_DOG: _bindgen_ty_26 = 81;
pub const BGM_SHOT_ADVAN: _bindgen_ty_26 = 82;
pub const BGM_SHOT_BOSS: _bindgen_ty_26 = 83;
pub const BGM_DOG_WIN: _bindgen_ty_26 = 84;
pub const BGM_DOG_LOSE: _bindgen_ty_26 = 85;
pub const BGM_FUTSAL_GOAL: _bindgen_ty_26 = 86;
pub const BGM_POINT: _bindgen_ty_26 = 87;
pub const BGM_SHOT_EXPERT: _bindgen_ty_26 = 88;
pub const BGM_GOLF_EAGLE: _bindgen_ty_26 = 89;
pub const BGM_SEL_CLEAR: _bindgen_ty_26 = 90;
pub const BGM_SCEN_ENDING: _bindgen_ty_26 = 91;
pub const BGM_S3_SNG1: _bindgen_ty_26 = 92;
pub const BGM_S3_SNG2: _bindgen_ty_26 = 93;
pub const BGM_S3_SNG3: _bindgen_ty_26 = 94;
pub const BGM_ADV: _bindgen_ty_26 = 95;
pub const BGM_S3_SNG4: _bindgen_ty_26 = 96;
pub const BGM_S3_SNG5: _bindgen_ty_26 = 97;
pub const BGM_S3_SNG6: _bindgen_ty_26 = 98;
pub const BGM_S3_SNG7: _bindgen_ty_26 = 99;
pub const BGM_S3_SNG8: _bindgen_ty_26 = 100;
pub const BGM_SCEN_ENDING4: _bindgen_ty_26 = 101;
pub const BGM_S1B_SNG1: _bindgen_ty_26 = 102;
pub const BGM_S1B_SNG2: _bindgen_ty_26 = 103;
pub const BGM_S1B_SNG3: _bindgen_ty_26 = 104;
pub const BGM_S2_SNG1: _bindgen_ty_26 = 105;
pub const BGM_S2_SNG2: _bindgen_ty_26 = 106;
pub const BGM_S2_SNG3: _bindgen_ty_26 = 107;
pub const BGM_S2_SNG4: _bindgen_ty_26 = 108;
pub const BGM_S2_SNG5: _bindgen_ty_26 = 109;
pub const BGM_S2_SNG6: _bindgen_ty_26 = 110;
pub const BGM_S2_SNG7: _bindgen_ty_26 = 111;
pub const BGM_S2_SNG8: _bindgen_ty_26 = 112;
pub const BGM_S4_SNG1: _bindgen_ty_26 = 113;
pub const BGM_S4_SNG2: _bindgen_ty_26 = 114;
pub const BGM_S4_SNG3: _bindgen_ty_26 = 115;
pub const BGM_S4_SNG4: _bindgen_ty_26 = 116;
pub const BGM_S4_SNG5: _bindgen_ty_26 = 117;
pub const BGM_S4_SNG6: _bindgen_ty_26 = 118;
pub const BGM_S4_SNG7: _bindgen_ty_26 = 119;
pub const BGM_S6_SNG1: _bindgen_ty_26 = 120;
pub const BGM_S6_SNG2: _bindgen_ty_26 = 121;
pub const BGM_S6_SNG3: _bindgen_ty_26 = 122;
pub const BGM_S5_SNG1: _bindgen_ty_26 = 123;
pub const BGM_S5_SNG2: _bindgen_ty_26 = 124;
pub const BGM_S5_SNG3: _bindgen_ty_26 = 125;
pub const BGM_S5_SNG4: _bindgen_ty_26 = 126;
pub const BGM_S5_SNG5: _bindgen_ty_26 = 127;
pub const BGM_S5_SNG6: _bindgen_ty_26 = 128;
pub const BGM_S5_SNG7: _bindgen_ty_26 = 129;
pub const BGM_S7_SNG1: _bindgen_ty_26 = 130;
pub const BGM_S7_SNG2: _bindgen_ty_26 = 131;
pub const BGM_S7_SNG3: _bindgen_ty_26 = 132;
pub const BGM_S7_SNG4: _bindgen_ty_26 = 133;
pub const BGM_S7_SNG5: _bindgen_ty_26 = 134;
pub const BGM_S7_SNG6: _bindgen_ty_26 = 135;
pub const BGM_SLAST_SNG1: _bindgen_ty_26 = 136;
pub const BGM_SLAST_SNG2: _bindgen_ty_26 = 137;
pub const BGM_S8_SNG1: _bindgen_ty_26 = 138;
pub const BGM_S8_SNG2: _bindgen_ty_26 = 139;
pub const BGM_S9_SNG1: _bindgen_ty_26 = 140;
pub const BGM_S9_SNG2: _bindgen_ty_26 = 141;
pub const BGM_S10_SNG1: _bindgen_ty_26 = 142;
pub const BGM_S10_SNG2: _bindgen_ty_26 = 143;
pub const BGM_S10_SNG3: _bindgen_ty_26 = 144;
pub const BGM_S10_SNG4: _bindgen_ty_26 = 145;
pub const BGM_S10_SNG5: _bindgen_ty_26 = 146;
pub type _bindgen_ty_26 = ::core::ffi::c_uint;
pub type BgmTrack = undefined2;
pub const STYLE_ORIGINAL: _bindgen_ty_27 = 0;
pub const STYLE_REGULAR: _bindgen_ty_27 = 1;
pub const STYLE_BOLD: _bindgen_ty_27 = 2;
pub const STYLE_ITALIC: _bindgen_ty_27 = 3;
pub const STYLE_BOLD_ITALIC: _bindgen_ty_27 = 4;
pub const STYLE_TEGAKI: _bindgen_ty_27 = 5;
pub type _bindgen_ty_27 = ::core::ffi::c_uint;
pub type FontStyle = undefined1;
pub type PCourseCommand = *mut CourseCommand;
pub const COURSE_CMD_IF: _bindgen_ty_28 = 0;
pub const COURSE_CMD_THEN: _bindgen_ty_28 = 1;
pub const COURSE_CMD_INFO: _bindgen_ty_28 = 2;
pub const COURSE_CMD_END: _bindgen_ty_28 = 3;
pub type _bindgen_ty_28 = ::core::ffi::c_uint;
pub type CourseCommandOpcode = undefined1;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CourseCommand {
    pub opcode: CourseCommandOpcode,
    pub type_: u8_,
    pub field2_0x2: [undefined; 2usize],
    pub value: s32,
    pub field4_0x8: [undefined; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CourseCommand"][::core::mem::size_of::<CourseCommand>() - 28usize];
    ["Alignment of CourseCommand"][::core::mem::align_of::<CourseCommand>() - 1usize];
    ["Offset of field: CourseCommand::opcode"]
        [::core::mem::offset_of!(CourseCommand, opcode) - 0usize];
    ["Offset of field: CourseCommand::type_"]
        [::core::mem::offset_of!(CourseCommand, type_) - 1usize];
    ["Offset of field: CourseCommand::field2_0x2"]
        [::core::mem::offset_of!(CourseCommand, field2_0x2) - 2usize];
    ["Offset of field: CourseCommand::value"]
        [::core::mem::offset_of!(CourseCommand, value) - 4usize];
    ["Offset of field: CourseCommand::field4_0x8"]
        [::core::mem::offset_of!(CourseCommand, field4_0x8) - 8usize];
};
pub type PRelBufferInfo = *mut RelBufferInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct RelBufferInfo {
    pub rel_buffer: *mut ::core::ffi::c_void,
    pub bss_buffer: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RelBufferInfo"][::core::mem::size_of::<RelBufferInfo>() - 8usize];
    ["Alignment of RelBufferInfo"][::core::mem::align_of::<RelBufferInfo>() - 1usize];
    ["Offset of field: RelBufferInfo::rel_buffer"]
        [::core::mem::offset_of!(RelBufferInfo, rel_buffer) - 0usize];
    ["Offset of field: RelBufferInfo::bss_buffer"]
        [::core::mem::offset_of!(RelBufferInfo, bss_buffer) - 4usize];
};
pub type PUnlockInfo = *mut UnlockInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct UnlockInfo {
    pub master_unlocked: byte,
    pub monkeys: byte,
    pub field_0x2: [undefined; 1usize],
    pub staff_credits_game_unlocked: byte,
    pub play_points: dword,
    pub newest_play_point_record: dword,
    pub field_0xc: [undefined; 2usize],
    pub movies: word,
    pub party_games: dword,
    pub g_movies_watched: word,
    pub field_0x16: [undefined; 110usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UnlockInfo"][::core::mem::size_of::<UnlockInfo>() - 132usize];
    ["Alignment of UnlockInfo"][::core::mem::align_of::<UnlockInfo>() - 1usize];
    ["Offset of field: UnlockInfo::master_unlocked"]
        [::core::mem::offset_of!(UnlockInfo, master_unlocked) - 0usize];
    ["Offset of field: UnlockInfo::monkeys"][::core::mem::offset_of!(UnlockInfo, monkeys) - 1usize];
    ["Offset of field: UnlockInfo::field_0x2"]
        [::core::mem::offset_of!(UnlockInfo, field_0x2) - 2usize];
    ["Offset of field: UnlockInfo::staff_credits_game_unlocked"]
        [::core::mem::offset_of!(UnlockInfo, staff_credits_game_unlocked) - 3usize];
    ["Offset of field: UnlockInfo::play_points"]
        [::core::mem::offset_of!(UnlockInfo, play_points) - 4usize];
    ["Offset of field: UnlockInfo::newest_play_point_record"]
        [::core::mem::offset_of!(UnlockInfo, newest_play_point_record) - 8usize];
    ["Offset of field: UnlockInfo::field_0xc"]
        [::core::mem::offset_of!(UnlockInfo, field_0xc) - 12usize];
    ["Offset of field: UnlockInfo::movies"][::core::mem::offset_of!(UnlockInfo, movies) - 14usize];
    ["Offset of field: UnlockInfo::party_games"]
        [::core::mem::offset_of!(UnlockInfo, party_games) - 16usize];
    ["Offset of field: UnlockInfo::g_movies_watched"]
        [::core::mem::offset_of!(UnlockInfo, g_movies_watched) - 20usize];
    ["Offset of field: UnlockInfo::field_0x16"]
        [::core::mem::offset_of!(UnlockInfo, field_0x16) - 22usize];
};
pub type PBall = *mut Ball;
pub const PHYS_MODE_G_GOALED: _bindgen_ty_29 = 5;
pub const PHYS_MODE_SLOWDOWN_BLASTOFF: _bindgen_ty_29 = 6;
pub const PHYS_MODE_NORMAL: _bindgen_ty_29 = 32;
pub type _bindgen_ty_29 = ::core::ffi::c_uint;
pub type BallMode = undefined1;
pub const PHYS_NONE: _bindgen_ty_30 = 0;
pub const PHYS_ON_GROUND: _bindgen_ty_30 = 1;
pub const PHYS_UNK_0x2: _bindgen_ty_30 = 2;
pub const PHYS_UNK_0x4: _bindgen_ty_30 = 4;
pub const PHYS_UNK_0x8: _bindgen_ty_30 = 8;
pub const PHYS_UNK_0x10: _bindgen_ty_30 = 16;
pub const PHYS_UNK_0x20: _bindgen_ty_30 = 32;
pub const PHYS_UNK_0x40: _bindgen_ty_30 = 64;
pub const PHYS_UNK_0x80: _bindgen_ty_30 = 128;
pub const PHYS_DISABLE_GRAVITY: _bindgen_ty_30 = 256;
pub const PHYS_BLAST_UP: _bindgen_ty_30 = 512;
pub const PHYS_SLOW_DOWN: _bindgen_ty_30 = 1024;
pub const PHYS_G_DISABLE_GOAL_DETECTION: _bindgen_ty_30 = 2048;
pub const PHYS_DISABLE_CONTROLS: _bindgen_ty_30 = 4096;
pub const PHYS_G_SECRET_POSTGOAL_DANCE: _bindgen_ty_30 = 8192;
pub const PHYS_UNK_0x4000: _bindgen_ty_30 = 16384;
pub type _bindgen_ty_30 = ::core::ffi::c_uint;
pub type BallPhysFlags = undefined4;
pub type PRaycastHit = *mut RaycastHit;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct RaycastHit {
    pub flags: u32_,
    pub pos: Vec,
    pub normal: Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RaycastHit"][::core::mem::size_of::<RaycastHit>() - 28usize];
    ["Alignment of RaycastHit"][::core::mem::align_of::<RaycastHit>() - 1usize];
    ["Offset of field: RaycastHit::flags"][::core::mem::offset_of!(RaycastHit, flags) - 0usize];
    ["Offset of field: RaycastHit::pos"][::core::mem::offset_of!(RaycastHit, pos) - 4usize];
    ["Offset of field: RaycastHit::normal"][::core::mem::offset_of!(RaycastHit, normal) - 16usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Ball {
    pub status: Status,
    pub field_0x1: [undefined; 1usize],
    pub monkey_count: u8_,
    pub mode: BallMode,
    pub pos: Vec,
    pub prev_pos: Vec,
    pub vel: Vec,
    pub visual_rot: S16Vec,
    pub idx: u8_,
    pub field_0x2f: [undefined; 1usize],
    pub model_transform: Mtx,
    pub visual_rot_vel: S16Vec,
    pub padding2: ::core::ffi::c_short,
    pub ball_size: f32,
    pub gravity: f32,
    pub restitution: f32,
    pub visual_scale: f32,
    pub banana_count: s32,
    pub score: s32,
    pub frames_since_spawn: s32,
    pub field_0x84: [undefined; 14usize],
    pub g_monkey_angle: s16,
    pub field_0x94: [undefined; 4usize],
    pub g_effect_flags: u32_,
    pub phys_flags: BallPhysFlags,
    pub g_monkey_rotation: Quat,
    pub g_ball_rotation: Quat,
    pub some_vec3: Vec,
    pub some_length: f32,
    pub ball_transform_copy: Mtx,
    pub speed: f32,
    pub ape: *mut Ape,
    pub field48_0x108: ::core::ffi::c_int,
    pub ape_facedir_point: Vec,
    pub something_with_ape_facedir: f32,
    pub g_last_collision_normal: Vec,
    pub field_0x128: [undefined; 4usize],
    pub g_race_flags: dword,
    pub g_other_counter: ::core::ffi::c_short,
    pub field58_0x132: undefined2,
    pub field59_0x134: s16,
    pub g_something_timer: s16,
    pub field_0x138: [undefined; 4usize],
    pub hardest_coli_speed: f32,
    pub g_banana_count_copy: ::core::ffi::c_int,
    pub field_0x144: [undefined; 8usize],
    pub physical_ball_radius: f32,
    pub field_0x150: [undefined; 4usize],
    pub field80_0x154: undefined1,
    pub field81_0x155: undefined1,
    pub g_ball_color_index: u8_,
    pub field83_0x157: undefined1,
    pub field_0x158: [undefined; 2usize],
    pub g_some_counter: ::core::ffi::c_short,
    pub g_some_pos1: Vec,
    pub field_0x168: [undefined; 16usize],
    pub g_some_game_flag: u8_,
    pub g_some_model_flag: u8_,
    pub field_0x17a: [undefined; 2usize],
    pub raycast_down_hit: RaycastHit,
    pub field_0x198: [undefined; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Ball"][::core::mem::size_of::<Ball>() - 432usize];
    ["Alignment of Ball"][::core::mem::align_of::<Ball>() - 1usize];
    ["Offset of field: Ball::status"][::core::mem::offset_of!(Ball, status) - 0usize];
    ["Offset of field: Ball::field_0x1"][::core::mem::offset_of!(Ball, field_0x1) - 1usize];
    ["Offset of field: Ball::monkey_count"][::core::mem::offset_of!(Ball, monkey_count) - 2usize];
    ["Offset of field: Ball::mode"][::core::mem::offset_of!(Ball, mode) - 3usize];
    ["Offset of field: Ball::pos"][::core::mem::offset_of!(Ball, pos) - 4usize];
    ["Offset of field: Ball::prev_pos"][::core::mem::offset_of!(Ball, prev_pos) - 16usize];
    ["Offset of field: Ball::vel"][::core::mem::offset_of!(Ball, vel) - 28usize];
    ["Offset of field: Ball::visual_rot"][::core::mem::offset_of!(Ball, visual_rot) - 40usize];
    ["Offset of field: Ball::idx"][::core::mem::offset_of!(Ball, idx) - 46usize];
    ["Offset of field: Ball::field_0x2f"][::core::mem::offset_of!(Ball, field_0x2f) - 47usize];
    ["Offset of field: Ball::model_transform"]
        [::core::mem::offset_of!(Ball, model_transform) - 48usize];
    ["Offset of field: Ball::visual_rot_vel"]
        [::core::mem::offset_of!(Ball, visual_rot_vel) - 96usize];
    ["Offset of field: Ball::padding2"][::core::mem::offset_of!(Ball, padding2) - 102usize];
    ["Offset of field: Ball::ball_size"][::core::mem::offset_of!(Ball, ball_size) - 104usize];
    ["Offset of field: Ball::gravity"][::core::mem::offset_of!(Ball, gravity) - 108usize];
    ["Offset of field: Ball::restitution"][::core::mem::offset_of!(Ball, restitution) - 112usize];
    ["Offset of field: Ball::visual_scale"][::core::mem::offset_of!(Ball, visual_scale) - 116usize];
    ["Offset of field: Ball::banana_count"][::core::mem::offset_of!(Ball, banana_count) - 120usize];
    ["Offset of field: Ball::score"][::core::mem::offset_of!(Ball, score) - 124usize];
    ["Offset of field: Ball::frames_since_spawn"]
        [::core::mem::offset_of!(Ball, frames_since_spawn) - 128usize];
    ["Offset of field: Ball::field_0x84"][::core::mem::offset_of!(Ball, field_0x84) - 132usize];
    ["Offset of field: Ball::g_monkey_angle"]
        [::core::mem::offset_of!(Ball, g_monkey_angle) - 146usize];
    ["Offset of field: Ball::field_0x94"][::core::mem::offset_of!(Ball, field_0x94) - 148usize];
    ["Offset of field: Ball::g_effect_flags"]
        [::core::mem::offset_of!(Ball, g_effect_flags) - 152usize];
    ["Offset of field: Ball::phys_flags"][::core::mem::offset_of!(Ball, phys_flags) - 156usize];
    ["Offset of field: Ball::g_monkey_rotation"]
        [::core::mem::offset_of!(Ball, g_monkey_rotation) - 160usize];
    ["Offset of field: Ball::g_ball_rotation"]
        [::core::mem::offset_of!(Ball, g_ball_rotation) - 176usize];
    ["Offset of field: Ball::some_vec3"][::core::mem::offset_of!(Ball, some_vec3) - 192usize];
    ["Offset of field: Ball::some_length"][::core::mem::offset_of!(Ball, some_length) - 204usize];
    ["Offset of field: Ball::ball_transform_copy"]
        [::core::mem::offset_of!(Ball, ball_transform_copy) - 208usize];
    ["Offset of field: Ball::speed"][::core::mem::offset_of!(Ball, speed) - 256usize];
    ["Offset of field: Ball::ape"][::core::mem::offset_of!(Ball, ape) - 260usize];
    ["Offset of field: Ball::field48_0x108"]
        [::core::mem::offset_of!(Ball, field48_0x108) - 264usize];
    ["Offset of field: Ball::ape_facedir_point"]
        [::core::mem::offset_of!(Ball, ape_facedir_point) - 268usize];
    ["Offset of field: Ball::something_with_ape_facedir"]
        [::core::mem::offset_of!(Ball, something_with_ape_facedir) - 280usize];
    ["Offset of field: Ball::g_last_collision_normal"]
        [::core::mem::offset_of!(Ball, g_last_collision_normal) - 284usize];
    ["Offset of field: Ball::field_0x128"][::core::mem::offset_of!(Ball, field_0x128) - 296usize];
    ["Offset of field: Ball::g_race_flags"][::core::mem::offset_of!(Ball, g_race_flags) - 300usize];
    ["Offset of field: Ball::g_other_counter"]
        [::core::mem::offset_of!(Ball, g_other_counter) - 304usize];
    ["Offset of field: Ball::field58_0x132"]
        [::core::mem::offset_of!(Ball, field58_0x132) - 306usize];
    ["Offset of field: Ball::field59_0x134"]
        [::core::mem::offset_of!(Ball, field59_0x134) - 308usize];
    ["Offset of field: Ball::g_something_timer"]
        [::core::mem::offset_of!(Ball, g_something_timer) - 310usize];
    ["Offset of field: Ball::field_0x138"][::core::mem::offset_of!(Ball, field_0x138) - 312usize];
    ["Offset of field: Ball::hardest_coli_speed"]
        [::core::mem::offset_of!(Ball, hardest_coli_speed) - 316usize];
    ["Offset of field: Ball::g_banana_count_copy"]
        [::core::mem::offset_of!(Ball, g_banana_count_copy) - 320usize];
    ["Offset of field: Ball::field_0x144"][::core::mem::offset_of!(Ball, field_0x144) - 324usize];
    ["Offset of field: Ball::physical_ball_radius"]
        [::core::mem::offset_of!(Ball, physical_ball_radius) - 332usize];
    ["Offset of field: Ball::field_0x150"][::core::mem::offset_of!(Ball, field_0x150) - 336usize];
    ["Offset of field: Ball::field80_0x154"]
        [::core::mem::offset_of!(Ball, field80_0x154) - 340usize];
    ["Offset of field: Ball::field81_0x155"]
        [::core::mem::offset_of!(Ball, field81_0x155) - 341usize];
    ["Offset of field: Ball::g_ball_color_index"]
        [::core::mem::offset_of!(Ball, g_ball_color_index) - 342usize];
    ["Offset of field: Ball::field83_0x157"]
        [::core::mem::offset_of!(Ball, field83_0x157) - 343usize];
    ["Offset of field: Ball::field_0x158"][::core::mem::offset_of!(Ball, field_0x158) - 344usize];
    ["Offset of field: Ball::g_some_counter"]
        [::core::mem::offset_of!(Ball, g_some_counter) - 346usize];
    ["Offset of field: Ball::g_some_pos1"][::core::mem::offset_of!(Ball, g_some_pos1) - 348usize];
    ["Offset of field: Ball::field_0x168"][::core::mem::offset_of!(Ball, field_0x168) - 360usize];
    ["Offset of field: Ball::g_some_game_flag"]
        [::core::mem::offset_of!(Ball, g_some_game_flag) - 376usize];
    ["Offset of field: Ball::g_some_model_flag"]
        [::core::mem::offset_of!(Ball, g_some_model_flag) - 377usize];
    ["Offset of field: Ball::field_0x17a"][::core::mem::offset_of!(Ball, field_0x17a) - 378usize];
    ["Offset of field: Ball::raycast_down_hit"]
        [::core::mem::offset_of!(Ball, raycast_down_hit) - 380usize];
    ["Offset of field: Ball::field_0x198"][::core::mem::offset_of!(Ball, field_0x198) - 408usize];
};
pub type PSmWorldInfo = *mut SmWorldInfo;
pub type PSmStageInfo = *mut SmStageInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SmWorldInfo {
    pub stage_count: s16,
    pub field_0x2: [undefined; 2usize],
    pub stages: *mut SmStageInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SmWorldInfo"][::core::mem::size_of::<SmWorldInfo>() - 8usize];
    ["Alignment of SmWorldInfo"][::core::mem::align_of::<SmWorldInfo>() - 1usize];
    ["Offset of field: SmWorldInfo::stage_count"]
        [::core::mem::offset_of!(SmWorldInfo, stage_count) - 0usize];
    ["Offset of field: SmWorldInfo::field_0x2"]
        [::core::mem::offset_of!(SmWorldInfo, field_0x2) - 2usize];
    ["Offset of field: SmWorldInfo::stages"][::core::mem::offset_of!(SmWorldInfo, stages) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SmStageInfo {
    pub stage_id: s16,
    pub difficulty: s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SmStageInfo"][::core::mem::size_of::<SmStageInfo>() - 4usize];
    ["Alignment of SmStageInfo"][::core::mem::align_of::<SmStageInfo>() - 1usize];
    ["Offset of field: SmStageInfo::stage_id"]
        [::core::mem::offset_of!(SmStageInfo, stage_id) - 0usize];
    ["Offset of field: SmStageInfo::difficulty"]
        [::core::mem::offset_of!(SmStageInfo, difficulty) - 2usize];
};
pub const DMD_SCEN_1ST_INIT: _bindgen_ty_31 = 0;
pub const DMD_SCEN_RETURN_INIT: _bindgen_ty_31 = 1;
pub const DMD_SCEN_NEWGAME_INIT: _bindgen_ty_31 = 2;
pub const DMD_SCEN_NEWGAME_MAIN: _bindgen_ty_31 = 3;
pub const DMD_SCEN_LOADGAME_INIT: _bindgen_ty_31 = 4;
pub const DMD_SCEN_LOADGAME_MAIN: _bindgen_ty_31 = 5;
pub const DMD_SCEN_SCENEPLAY_INIT: _bindgen_ty_31 = 6;
pub const DMD_SCEN_SCENEPLAY_MAIN: _bindgen_ty_31 = 7;
pub const DMD_SCEN_SEL_WORLD_INIT: _bindgen_ty_31 = 8;
pub const DMD_SCEN_SEL_WORLD_NEXT: _bindgen_ty_31 = 9;
pub const DMD_SCEN_SEL_FLOOR_INIT: _bindgen_ty_31 = 10;
pub const DMD_SCEN_SEL_FLOOR_MAIN: _bindgen_ty_31 = 11;
pub const DMD_SCEN_GAME_INIT: _bindgen_ty_31 = 12;
pub const DMD_SCEN_GAME_MAIN: _bindgen_ty_31 = 13;
pub const DMD_SCEN_GAME_CLEAR_INIT: _bindgen_ty_31 = 14;
pub const DMD_SCEN_GAME_CLEAR_MAIN: _bindgen_ty_31 = 15;
pub const DMD_SCEN_GAME_OVER_INIT: _bindgen_ty_31 = 16;
pub const DMD_SCEN_GAME_OVER_MAIN: _bindgen_ty_31 = 17;
pub const DMD_SCEN_SELECT_INIT: _bindgen_ty_31 = 18;
pub const DMD_SCEN_SELECT_MAIN: _bindgen_ty_31 = 19;
pub const DMD_SCEN_ENTRY_INIT: _bindgen_ty_31 = 20;
pub const DMD_SCEN_ENTRY_MAIN: _bindgen_ty_31 = 21;
pub const DMD_SCEN_SCNPLAY_RETURN: _bindgen_ty_31 = 22;
pub const DMD_SCEN_SCNPLAY_RETURN_LOADING: _bindgen_ty_31 = 23;
pub const DMD_SCEN_LOADGAME_RESTORE: _bindgen_ty_31 = 24;
pub const DMD_SCEN_NAMEENTRY_INIT: _bindgen_ty_31 = 25;
pub const DMD_SCEN_NAMEENTRY_MAIN: _bindgen_ty_31 = 26;
pub type _bindgen_ty_31 = ::core::ffi::c_uint;
pub type ScenMode = undefined2;
pub type PFontDefinition = *mut FontDefinition;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct FontDefinition {
    pub g_aram_flag: ::core::ffi::c_short,
    pub width: byte,
    pub height: byte,
    pub g_start_index: ::core::ffi::c_int,
    pub g_end_index: ::core::ffi::c_int,
    pub field5_0xc: ::core::ffi::c_char,
    pub field_0xd: [undefined; 3usize],
    pub field9_0x10: f32,
    pub field10_0x14: f32,
    pub field11_0x18: f32,
    pub field12_0x1c: f32,
    pub field13_0x20: ::core::ffi::c_char,
    pub field14_0x21: ::core::ffi::c_char,
    pub field15_0x22: ::core::ffi::c_char,
    pub field16_0x23: ::core::ffi::c_char,
    pub name: *mut ::core::ffi::c_char,
    pub g_some_size: ushort,
    pub field_0x2a: [undefined; 2usize],
    pub g_some_avtext_lookup: *mut ushort,
    pub g_aram_char_lookup: *mut ::core::ffi::c_short,
    pub field23_0x34: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FontDefinition"][::core::mem::size_of::<FontDefinition>() - 56usize];
    ["Alignment of FontDefinition"][::core::mem::align_of::<FontDefinition>() - 1usize];
    ["Offset of field: FontDefinition::g_aram_flag"]
        [::core::mem::offset_of!(FontDefinition, g_aram_flag) - 0usize];
    ["Offset of field: FontDefinition::width"]
        [::core::mem::offset_of!(FontDefinition, width) - 2usize];
    ["Offset of field: FontDefinition::height"]
        [::core::mem::offset_of!(FontDefinition, height) - 3usize];
    ["Offset of field: FontDefinition::g_start_index"]
        [::core::mem::offset_of!(FontDefinition, g_start_index) - 4usize];
    ["Offset of field: FontDefinition::g_end_index"]
        [::core::mem::offset_of!(FontDefinition, g_end_index) - 8usize];
    ["Offset of field: FontDefinition::field5_0xc"]
        [::core::mem::offset_of!(FontDefinition, field5_0xc) - 12usize];
    ["Offset of field: FontDefinition::field_0xd"]
        [::core::mem::offset_of!(FontDefinition, field_0xd) - 13usize];
    ["Offset of field: FontDefinition::field9_0x10"]
        [::core::mem::offset_of!(FontDefinition, field9_0x10) - 16usize];
    ["Offset of field: FontDefinition::field10_0x14"]
        [::core::mem::offset_of!(FontDefinition, field10_0x14) - 20usize];
    ["Offset of field: FontDefinition::field11_0x18"]
        [::core::mem::offset_of!(FontDefinition, field11_0x18) - 24usize];
    ["Offset of field: FontDefinition::field12_0x1c"]
        [::core::mem::offset_of!(FontDefinition, field12_0x1c) - 28usize];
    ["Offset of field: FontDefinition::field13_0x20"]
        [::core::mem::offset_of!(FontDefinition, field13_0x20) - 32usize];
    ["Offset of field: FontDefinition::field14_0x21"]
        [::core::mem::offset_of!(FontDefinition, field14_0x21) - 33usize];
    ["Offset of field: FontDefinition::field15_0x22"]
        [::core::mem::offset_of!(FontDefinition, field15_0x22) - 34usize];
    ["Offset of field: FontDefinition::field16_0x23"]
        [::core::mem::offset_of!(FontDefinition, field16_0x23) - 35usize];
    ["Offset of field: FontDefinition::name"]
        [::core::mem::offset_of!(FontDefinition, name) - 36usize];
    ["Offset of field: FontDefinition::g_some_size"]
        [::core::mem::offset_of!(FontDefinition, g_some_size) - 40usize];
    ["Offset of field: FontDefinition::field_0x2a"]
        [::core::mem::offset_of!(FontDefinition, field_0x2a) - 42usize];
    ["Offset of field: FontDefinition::g_some_avtext_lookup"]
        [::core::mem::offset_of!(FontDefinition, g_some_avtext_lookup) - 44usize];
    ["Offset of field: FontDefinition::g_aram_char_lookup"]
        [::core::mem::offset_of!(FontDefinition, g_aram_char_lookup) - 48usize];
    ["Offset of field: FontDefinition::field23_0x34"]
        [::core::mem::offset_of!(FontDefinition, field23_0x34) - 52usize];
};
pub type PItemgroup = *mut Itemgroup;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Itemgroup {
    pub playback_state: dword,
    pub anim_frame: dword,
    pub position: Vec,
    pub prev_position: Vec,
    pub rotation: S16Vec,
    pub prev_rotation: S16Vec,
    pub transform: Mtx,
    pub prev_transform: Mtx,
    pub field_0x8c: [undefined; 16usize],
    pub seesaw_info: *mut SeesawInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Itemgroup"][::core::mem::size_of::<Itemgroup>() - 160usize];
    ["Alignment of Itemgroup"][::core::mem::align_of::<Itemgroup>() - 1usize];
    ["Offset of field: Itemgroup::playback_state"]
        [::core::mem::offset_of!(Itemgroup, playback_state) - 0usize];
    ["Offset of field: Itemgroup::anim_frame"]
        [::core::mem::offset_of!(Itemgroup, anim_frame) - 4usize];
    ["Offset of field: Itemgroup::position"][::core::mem::offset_of!(Itemgroup, position) - 8usize];
    ["Offset of field: Itemgroup::prev_position"]
        [::core::mem::offset_of!(Itemgroup, prev_position) - 20usize];
    ["Offset of field: Itemgroup::rotation"]
        [::core::mem::offset_of!(Itemgroup, rotation) - 32usize];
    ["Offset of field: Itemgroup::prev_rotation"]
        [::core::mem::offset_of!(Itemgroup, prev_rotation) - 38usize];
    ["Offset of field: Itemgroup::transform"]
        [::core::mem::offset_of!(Itemgroup, transform) - 44usize];
    ["Offset of field: Itemgroup::prev_transform"]
        [::core::mem::offset_of!(Itemgroup, prev_transform) - 92usize];
    ["Offset of field: Itemgroup::field_0x8c"]
        [::core::mem::offset_of!(Itemgroup, field_0x8c) - 140usize];
    ["Offset of field: Itemgroup::seesaw_info"]
        [::core::mem::offset_of!(Itemgroup, seesaw_info) - 156usize];
};
pub type PGSoundGroupEntry = *mut GSoundGroupEntry;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GSoundGroupEntry {
    pub g_flags: undefined2,
    pub field_0x2: [undefined; 2usize],
    pub field3_0x4: undefined2,
    pub field_0x6: [undefined; 2usize],
    pub field6_0x8: undefined2,
    pub field_0xa: [undefined; 2usize],
    pub g_name: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSoundGroupEntry"][::core::mem::size_of::<GSoundGroupEntry>() - 16usize];
    ["Alignment of GSoundGroupEntry"][::core::mem::align_of::<GSoundGroupEntry>() - 1usize];
    ["Offset of field: GSoundGroupEntry::g_flags"]
        [::core::mem::offset_of!(GSoundGroupEntry, g_flags) - 0usize];
    ["Offset of field: GSoundGroupEntry::field_0x2"]
        [::core::mem::offset_of!(GSoundGroupEntry, field_0x2) - 2usize];
    ["Offset of field: GSoundGroupEntry::field3_0x4"]
        [::core::mem::offset_of!(GSoundGroupEntry, field3_0x4) - 4usize];
    ["Offset of field: GSoundGroupEntry::field_0x6"]
        [::core::mem::offset_of!(GSoundGroupEntry, field_0x6) - 6usize];
    ["Offset of field: GSoundGroupEntry::field6_0x8"]
        [::core::mem::offset_of!(GSoundGroupEntry, field6_0x8) - 8usize];
    ["Offset of field: GSoundGroupEntry::field_0xa"]
        [::core::mem::offset_of!(GSoundGroupEntry, field_0xa) - 10usize];
    ["Offset of field: GSoundGroupEntry::g_name"]
        [::core::mem::offset_of!(GSoundGroupEntry, g_name) - 12usize];
};
pub type CharPair = [::core::ffi::c_char; 2usize];
pub type PStoryModeSaveFile = *mut StoryModeSaveFile;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StoryModeSaveFile {
    pub field0_0x0: [undefined; 4usize],
    pub is_valid: BOOL32,
    pub file_name: [::core::ffi::c_char; 13usize],
    pub current_world: u8_,
    pub field4_0x16: u8_,
    pub field_0x17: [undefined; 1usize],
    pub playtime_in_frames: u32_,
    pub score: u32_,
    pub bananas: u32_,
    pub num_beaten_stages_in_current_world: u8_,
    pub beaten_stage_indices: [u8_; 10usize],
    pub field11_0x2f: [undefined; 85usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StoryModeSaveFile"][::core::mem::size_of::<StoryModeSaveFile>() - 132usize];
    ["Alignment of StoryModeSaveFile"][::core::mem::align_of::<StoryModeSaveFile>() - 1usize];
    ["Offset of field: StoryModeSaveFile::field0_0x0"]
        [::core::mem::offset_of!(StoryModeSaveFile, field0_0x0) - 0usize];
    ["Offset of field: StoryModeSaveFile::is_valid"]
        [::core::mem::offset_of!(StoryModeSaveFile, is_valid) - 4usize];
    ["Offset of field: StoryModeSaveFile::file_name"]
        [::core::mem::offset_of!(StoryModeSaveFile, file_name) - 8usize];
    ["Offset of field: StoryModeSaveFile::current_world"]
        [::core::mem::offset_of!(StoryModeSaveFile, current_world) - 21usize];
    ["Offset of field: StoryModeSaveFile::field4_0x16"]
        [::core::mem::offset_of!(StoryModeSaveFile, field4_0x16) - 22usize];
    ["Offset of field: StoryModeSaveFile::field_0x17"]
        [::core::mem::offset_of!(StoryModeSaveFile, field_0x17) - 23usize];
    ["Offset of field: StoryModeSaveFile::playtime_in_frames"]
        [::core::mem::offset_of!(StoryModeSaveFile, playtime_in_frames) - 24usize];
    ["Offset of field: StoryModeSaveFile::score"]
        [::core::mem::offset_of!(StoryModeSaveFile, score) - 28usize];
    ["Offset of field: StoryModeSaveFile::bananas"]
        [::core::mem::offset_of!(StoryModeSaveFile, bananas) - 32usize];
    ["Offset of field: StoryModeSaveFile::num_beaten_stages_in_current_world"]
        [::core::mem::offset_of!(StoryModeSaveFile, num_beaten_stages_in_current_world) - 36usize];
    ["Offset of field: StoryModeSaveFile::beaten_stage_indices"]
        [::core::mem::offset_of!(StoryModeSaveFile, beaten_stage_indices) - 37usize];
    ["Offset of field: StoryModeSaveFile::field11_0x2f"]
        [::core::mem::offset_of!(StoryModeSaveFile, field11_0x2f) - 47usize];
};
pub type PGBone = *mut GBone;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GBone {
    pub SKLData: *mut SKLFile,
    pub MTAData: *mut ::core::ffi::c_void,
    pub UnknownPtr: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GBone"][::core::mem::size_of::<GBone>() - 12usize];
    ["Alignment of GBone"][::core::mem::align_of::<GBone>() - 1usize];
    ["Offset of field: GBone::SKLData"][::core::mem::offset_of!(GBone, SKLData) - 0usize];
    ["Offset of field: GBone::MTAData"][::core::mem::offset_of!(GBone, MTAData) - 4usize];
    ["Offset of field: GBone::UnknownPtr"][::core::mem::offset_of!(GBone, UnknownPtr) - 8usize];
};
pub type PRankingEntry = *mut RankingEntry;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct RankingEntry {
    pub name: *mut ::core::ffi::c_char,
    pub field_0x4: [undefined; 4usize],
    pub score: u32_,
    pub g_ape_id: u32_,
    pub field_0x10: [undefined; 4usize],
    pub field11_0x14: undefined4,
    pub field_0x18: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RankingEntry"][::core::mem::size_of::<RankingEntry>() - 28usize];
    ["Alignment of RankingEntry"][::core::mem::align_of::<RankingEntry>() - 1usize];
    ["Offset of field: RankingEntry::name"][::core::mem::offset_of!(RankingEntry, name) - 0usize];
    ["Offset of field: RankingEntry::field_0x4"]
        [::core::mem::offset_of!(RankingEntry, field_0x4) - 4usize];
    ["Offset of field: RankingEntry::score"][::core::mem::offset_of!(RankingEntry, score) - 8usize];
    ["Offset of field: RankingEntry::g_ape_id"]
        [::core::mem::offset_of!(RankingEntry, g_ape_id) - 12usize];
    ["Offset of field: RankingEntry::field_0x10"]
        [::core::mem::offset_of!(RankingEntry, field_0x10) - 16usize];
    ["Offset of field: RankingEntry::field11_0x14"]
        [::core::mem::offset_of!(RankingEntry, field11_0x14) - 20usize];
    ["Offset of field: RankingEntry::field_0x18"]
        [::core::mem::offset_of!(RankingEntry, field_0x18) - 24usize];
};
pub type PGTableEntry = *mut GTableEntry;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GTableEntry {
    pub field_0x0: [undefined; 3usize],
    pub field3_0x3: byte,
    pub field_0x4: [undefined; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GTableEntry"][::core::mem::size_of::<GTableEntry>() - 12usize];
    ["Alignment of GTableEntry"][::core::mem::align_of::<GTableEntry>() - 1usize];
    ["Offset of field: GTableEntry::field_0x0"]
        [::core::mem::offset_of!(GTableEntry, field_0x0) - 0usize];
    ["Offset of field: GTableEntry::field3_0x3"]
        [::core::mem::offset_of!(GTableEntry, field3_0x3) - 3usize];
    ["Offset of field: GTableEntry::field_0x4"]
        [::core::mem::offset_of!(GTableEntry, field_0x4) - 4usize];
};
pub type Ptheme_light = *mut theme_light;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct theme_light {
    pub unk_float: f32,
    pub light_group_r: f32,
    pub light_group_g: f32,
    pub light_group_b: f32,
    pub light_group_null: f32,
    pub unk_one_1: f32,
    pub unk_one_2: f32,
    pub unk_one_3: f32,
    pub unk_one_null: f32,
    pub unk_half_1: f32,
    pub unk_half_2: f32,
    pub unk_half_3: f32,
    pub unk_half_null: f32,
    pub light_param_r: f32,
    pub light_param_g: f32,
    pub light_param_b: f32,
    pub xa: i16,
    pub ya: i16,
    pub null: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of theme_light"][::core::mem::size_of::<theme_light>() - 72usize];
    ["Alignment of theme_light"][::core::mem::align_of::<theme_light>() - 1usize];
    ["Offset of field: theme_light::unk_float"]
        [::core::mem::offset_of!(theme_light, unk_float) - 0usize];
    ["Offset of field: theme_light::light_group_r"]
        [::core::mem::offset_of!(theme_light, light_group_r) - 4usize];
    ["Offset of field: theme_light::light_group_g"]
        [::core::mem::offset_of!(theme_light, light_group_g) - 8usize];
    ["Offset of field: theme_light::light_group_b"]
        [::core::mem::offset_of!(theme_light, light_group_b) - 12usize];
    ["Offset of field: theme_light::light_group_null"]
        [::core::mem::offset_of!(theme_light, light_group_null) - 16usize];
    ["Offset of field: theme_light::unk_one_1"]
        [::core::mem::offset_of!(theme_light, unk_one_1) - 20usize];
    ["Offset of field: theme_light::unk_one_2"]
        [::core::mem::offset_of!(theme_light, unk_one_2) - 24usize];
    ["Offset of field: theme_light::unk_one_3"]
        [::core::mem::offset_of!(theme_light, unk_one_3) - 28usize];
    ["Offset of field: theme_light::unk_one_null"]
        [::core::mem::offset_of!(theme_light, unk_one_null) - 32usize];
    ["Offset of field: theme_light::unk_half_1"]
        [::core::mem::offset_of!(theme_light, unk_half_1) - 36usize];
    ["Offset of field: theme_light::unk_half_2"]
        [::core::mem::offset_of!(theme_light, unk_half_2) - 40usize];
    ["Offset of field: theme_light::unk_half_3"]
        [::core::mem::offset_of!(theme_light, unk_half_3) - 44usize];
    ["Offset of field: theme_light::unk_half_null"]
        [::core::mem::offset_of!(theme_light, unk_half_null) - 48usize];
    ["Offset of field: theme_light::light_param_r"]
        [::core::mem::offset_of!(theme_light, light_param_r) - 52usize];
    ["Offset of field: theme_light::light_param_g"]
        [::core::mem::offset_of!(theme_light, light_param_g) - 56usize];
    ["Offset of field: theme_light::light_param_b"]
        [::core::mem::offset_of!(theme_light, light_param_b) - 60usize];
    ["Offset of field: theme_light::xa"][::core::mem::offset_of!(theme_light, xa) - 64usize];
    ["Offset of field: theme_light::ya"][::core::mem::offset_of!(theme_light, ya) - 66usize];
    ["Offset of field: theme_light::null"][::core::mem::offset_of!(theme_light, null) - 68usize];
};
pub type POptiGXChanSettings = *mut OptiGXChanSettings;
pub type GXBool = u8_;
pub const GX_SRC_REG: _bindgen_ty_32 = 0;
pub const GX_SRC_VTX: _bindgen_ty_32 = 1;
pub type _bindgen_ty_32 = ::core::ffi::c_uint;
pub type GXColorSrc = undefined4;
pub const GX_DF_NONE: _bindgen_ty_33 = 0;
pub const GX_DF_SIGN: _bindgen_ty_33 = 1;
pub const GX_DF_CLAMP: _bindgen_ty_33 = 2;
pub type _bindgen_ty_33 = ::core::ffi::c_uint;
pub type GXDiffuseFn = undefined4;
pub const GX_AF_SPEC: _bindgen_ty_34 = 0;
pub const GX_AF_SPOT: _bindgen_ty_34 = 1;
pub const GX_AF_NONE: _bindgen_ty_34 = 2;
pub type _bindgen_ty_34 = ::core::ffi::c_uint;
pub type GXAttnFn = undefined4;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OptiGXChanSettings {
    pub enable: GXBool,
    pub padding_0x1: [undefined; 3usize],
    pub amb_src: GXColorSrc,
    pub mat_src: GXColorSrc,
    pub light_mask: u32_,
    pub diff_fn: GXDiffuseFn,
    pub attn_fn: GXAttnFn,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OptiGXChanSettings"][::core::mem::size_of::<OptiGXChanSettings>() - 24usize];
    ["Alignment of OptiGXChanSettings"][::core::mem::align_of::<OptiGXChanSettings>() - 1usize];
    ["Offset of field: OptiGXChanSettings::enable"]
        [::core::mem::offset_of!(OptiGXChanSettings, enable) - 0usize];
    ["Offset of field: OptiGXChanSettings::padding_0x1"]
        [::core::mem::offset_of!(OptiGXChanSettings, padding_0x1) - 1usize];
    ["Offset of field: OptiGXChanSettings::amb_src"]
        [::core::mem::offset_of!(OptiGXChanSettings, amb_src) - 4usize];
    ["Offset of field: OptiGXChanSettings::mat_src"]
        [::core::mem::offset_of!(OptiGXChanSettings, mat_src) - 8usize];
    ["Offset of field: OptiGXChanSettings::light_mask"]
        [::core::mem::offset_of!(OptiGXChanSettings, light_mask) - 12usize];
    ["Offset of field: OptiGXChanSettings::diff_fn"]
        [::core::mem::offset_of!(OptiGXChanSettings, diff_fn) - 16usize];
    ["Offset of field: OptiGXChanSettings::attn_fn"]
        [::core::mem::offset_of!(OptiGXChanSettings, attn_fn) - 20usize];
};
pub type PGSomeLightStruct = *mut GSomeLightStruct;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GSomeLightStruct {
    pub field_0x0: [undefined; 299usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSomeLightStruct"][::core::mem::size_of::<GSomeLightStruct>() - 299usize];
    ["Alignment of GSomeLightStruct"][::core::mem::align_of::<GSomeLightStruct>() - 1usize];
    ["Offset of field: GSomeLightStruct::field_0x0"]
        [::core::mem::offset_of!(GSomeLightStruct, field_0x0) - 0usize];
};
pub type PCmListEntry = *mut CmListEntry;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CmListEntry {
    pub field0_0x0: undefined4,
    pub g_stage_id: undefined4,
    pub field_0x8: [undefined; 100usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmListEntry"][::core::mem::size_of::<CmListEntry>() - 108usize];
    ["Alignment of CmListEntry"][::core::mem::align_of::<CmListEntry>() - 1usize];
    ["Offset of field: CmListEntry::field0_0x0"]
        [::core::mem::offset_of!(CmListEntry, field0_0x0) - 0usize];
    ["Offset of field: CmListEntry::g_stage_id"]
        [::core::mem::offset_of!(CmListEntry, g_stage_id) - 4usize];
    ["Offset of field: CmListEntry::field_0x8"]
        [::core::mem::offset_of!(CmListEntry, field_0x8) - 8usize];
};
pub type PNlBuffer = *mut NlBuffer;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct NlBuffer {
    pub field0_0x0: ::core::ffi::c_int,
    pub field_0x4: [undefined; 20usize],
    pub field21_0x18: *mut *mut ::core::ffi::c_int,
    pub field_0x1c: [undefined; 4usize],
    pub field26_0x20: *mut *mut ::core::ffi::c_int,
    pub field27_0x24: *mut GXTexObj,
    pub field_0x28: [undefined; 16usize],
    pub field44_0x38: *mut *mut ::core::ffi::c_int,
    pub field_0x3c: [undefined; 40usize],
    pub field85_0x64: *mut *mut ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NlBuffer"][::core::mem::size_of::<NlBuffer>() - 104usize];
    ["Alignment of NlBuffer"][::core::mem::align_of::<NlBuffer>() - 1usize];
    ["Offset of field: NlBuffer::field0_0x0"]
        [::core::mem::offset_of!(NlBuffer, field0_0x0) - 0usize];
    ["Offset of field: NlBuffer::field_0x4"][::core::mem::offset_of!(NlBuffer, field_0x4) - 4usize];
    ["Offset of field: NlBuffer::field21_0x18"]
        [::core::mem::offset_of!(NlBuffer, field21_0x18) - 24usize];
    ["Offset of field: NlBuffer::field_0x1c"]
        [::core::mem::offset_of!(NlBuffer, field_0x1c) - 28usize];
    ["Offset of field: NlBuffer::field26_0x20"]
        [::core::mem::offset_of!(NlBuffer, field26_0x20) - 32usize];
    ["Offset of field: NlBuffer::field27_0x24"]
        [::core::mem::offset_of!(NlBuffer, field27_0x24) - 36usize];
    ["Offset of field: NlBuffer::field_0x28"]
        [::core::mem::offset_of!(NlBuffer, field_0x28) - 40usize];
    ["Offset of field: NlBuffer::field44_0x38"]
        [::core::mem::offset_of!(NlBuffer, field44_0x38) - 56usize];
    ["Offset of field: NlBuffer::field_0x3c"]
        [::core::mem::offset_of!(NlBuffer, field_0x3c) - 60usize];
    ["Offset of field: NlBuffer::field85_0x64"]
        [::core::mem::offset_of!(NlBuffer, field85_0x64) - 100usize];
};
pub type PGraphicsInfo = *mut GraphicsInfo;
pub type PGXFifoObj = *mut GXFifoObj;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GraphicsInfo {
    pub active_framebuffer: *mut ::core::ffi::c_void,
    pub framebuffer1: *mut ::core::ffi::c_void,
    pub framebuffer2: *mut ::core::ffi::c_void,
    pub frame_count: u32_,
    pub active_framebuffer_index: u32_,
    pub fifos: [*mut GXFifoObj; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GraphicsInfo"][::core::mem::size_of::<GraphicsInfo>() - 28usize];
    ["Alignment of GraphicsInfo"][::core::mem::align_of::<GraphicsInfo>() - 1usize];
    ["Offset of field: GraphicsInfo::active_framebuffer"]
        [::core::mem::offset_of!(GraphicsInfo, active_framebuffer) - 0usize];
    ["Offset of field: GraphicsInfo::framebuffer1"]
        [::core::mem::offset_of!(GraphicsInfo, framebuffer1) - 4usize];
    ["Offset of field: GraphicsInfo::framebuffer2"]
        [::core::mem::offset_of!(GraphicsInfo, framebuffer2) - 8usize];
    ["Offset of field: GraphicsInfo::frame_count"]
        [::core::mem::offset_of!(GraphicsInfo, frame_count) - 12usize];
    ["Offset of field: GraphicsInfo::active_framebuffer_index"]
        [::core::mem::offset_of!(GraphicsInfo, active_framebuffer_index) - 16usize];
    ["Offset of field: GraphicsInfo::fifos"]
        [::core::mem::offset_of!(GraphicsInfo, fifos) - 20usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GXFifoObj {
    pub field_0x0: [undefined; 20usize],
    pub read_ptr: *mut ::core::ffi::c_void,
    pub write_ptr: *mut ::core::ffi::c_void,
    pub field_0x1c: [undefined; 100usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GXFifoObj"][::core::mem::size_of::<GXFifoObj>() - 128usize];
    ["Alignment of GXFifoObj"][::core::mem::align_of::<GXFifoObj>() - 1usize];
    ["Offset of field: GXFifoObj::field_0x0"]
        [::core::mem::offset_of!(GXFifoObj, field_0x0) - 0usize];
    ["Offset of field: GXFifoObj::read_ptr"]
        [::core::mem::offset_of!(GXFifoObj, read_ptr) - 20usize];
    ["Offset of field: GXFifoObj::write_ptr"]
        [::core::mem::offset_of!(GXFifoObj, write_ptr) - 24usize];
    ["Offset of field: GXFifoObj::field_0x1c"]
        [::core::mem::offset_of!(GXFifoObj, field_0x1c) - 28usize];
};
pub const FONT32_ASCII: _bindgen_ty_35 = 0;
pub const FONT32_ASC_8x16: _bindgen_ty_35 = 1;
pub const FONT32_ASC_12x12: _bindgen_ty_35 = 2;
pub const FONT32_ASC_24x24: _bindgen_ty_35 = 3;
pub const FONT32_ASC_16x16P: _bindgen_ty_35 = 4;
pub const FONT32_ASC_16x16: _bindgen_ty_35 = 5;
pub const FONT32_DMY03: _bindgen_ty_35 = 6;
pub const FONT32_DMY04: _bindgen_ty_35 = 7;
pub const FONT32_DMY05: _bindgen_ty_35 = 8;
pub const FONT32_ASC_72x64: _bindgen_ty_35 = 9;
pub const FONT32_DMY06: _bindgen_ty_35 = 10;
pub const FONT32_DMY07: _bindgen_ty_35 = 11;
pub const FONT32_DMY08: _bindgen_ty_35 = 12;
pub const FONT32_DMY09: _bindgen_ty_35 = 13;
pub const FONT32_DMY10: _bindgen_ty_35 = 14;
pub const FONT32_DMY11: _bindgen_ty_35 = 15;
pub const FONT32_DMY12: _bindgen_ty_35 = 16;
pub const FONT32_DMY13: _bindgen_ty_35 = 17;
pub const FONT32_DMY14: _bindgen_ty_35 = 18;
pub const FONT32_DMY15: _bindgen_ty_35 = 19;
pub const FONT32_DMY16: _bindgen_ty_35 = 20;
pub const FONT32_ICON_SD: _bindgen_ty_35 = 21;
pub const FONT32_ICON_SD2: _bindgen_ty_35 = 22;
pub const FONT32_DMY20: _bindgen_ty_35 = 23;
pub const FONT32_DMY21: _bindgen_ty_35 = 24;
pub const FONT32_DMY22: _bindgen_ty_35 = 25;
pub const FONT32_DMY23: _bindgen_ty_35 = 26;
pub const FONT32_DMY_RNK00: _bindgen_ty_35 = 27;
pub const FONT32_DMY_RNK01: _bindgen_ty_35 = 28;
pub const FONT32_DMY_RNK02: _bindgen_ty_35 = 29;
pub const FONT32_DMY_RNK03: _bindgen_ty_35 = 30;
pub const FONT32_DMY_RNK04: _bindgen_ty_35 = 31;
pub const FONT32_RNK_32x32: _bindgen_ty_35 = 32;
pub const FONT32_RNK_NUM: _bindgen_ty_35 = 33;
pub const FONT32_MINI_RNK: _bindgen_ty_35 = 34;
pub const FONT32_SCORE_NUM: _bindgen_ty_35 = 35;
pub const FONT32_DMY_RNK0: _bindgen_ty_35 = 36;
pub const FONT32_DMY_RNK1: _bindgen_ty_35 = 37;
pub const FONT32_DMY_RNK2: _bindgen_ty_35 = 38;
pub const FONT32_DMY_RNK3: _bindgen_ty_35 = 39;
pub const FONT32_DMY_RNK4: _bindgen_ty_35 = 40;
pub const FONT32_DMY_RNK5: _bindgen_ty_35 = 41;
pub const FONT32_DMY_RNK6: _bindgen_ty_35 = 42;
pub const FONT32_DMY_RNK7: _bindgen_ty_35 = 43;
pub const FONT32_DMY_RNK8: _bindgen_ty_35 = 44;
pub const FONT32_DMY_RNK9: _bindgen_ty_35 = 45;
pub const FONT32_DMY_RNKa: _bindgen_ty_35 = 46;
pub const FONT32_DMY_RNKb: _bindgen_ty_35 = 47;
pub const FONT32_DMY_RNKc: _bindgen_ty_35 = 48;
pub const FONT32_DMY_RNKd: _bindgen_ty_35 = 49;
pub const FONT32_DMY_RNKe: _bindgen_ty_35 = 50;
pub const FONT32_DMY_RNKf: _bindgen_ty_35 = 51;
pub const FONT32_SEL_CTRL_PORT: _bindgen_ty_35 = 52;
pub const FONT32_SEL_CTRL_R: _bindgen_ty_35 = 53;
pub const FONT32_SEL_CTRL_B: _bindgen_ty_35 = 54;
pub const FONT32_SEL_CTRL_Y: _bindgen_ty_35 = 55;
pub const FONT32_SEL_CTRL_G: _bindgen_ty_35 = 56;
pub const FONT32_SEL_CTRL_SDW: _bindgen_ty_35 = 57;
pub const FONT32_DMY42: _bindgen_ty_35 = 58;
pub const FONT32_DMY43: _bindgen_ty_35 = 59;
pub const FONT32_BWL_SCORE: _bindgen_ty_35 = 60;
pub const FONT32_DMY50: _bindgen_ty_35 = 61;
pub const FONT32_DMY51: _bindgen_ty_35 = 62;
pub const FONT32_DMY52: _bindgen_ty_35 = 63;
pub const FONT32_DMY53: _bindgen_ty_35 = 64;
pub const FONT32_DMY54: _bindgen_ty_35 = 65;
pub const FONT32_DMY55: _bindgen_ty_35 = 66;
pub const FONT32_DMY56: _bindgen_ty_35 = 67;
pub const FONT32_DMY57: _bindgen_ty_35 = 68;
pub const FONT32_RAC_DMY01: _bindgen_ty_35 = 69;
pub const FONT32_RAC_PLAYER: _bindgen_ty_35 = 70;
pub const FONT32_RAC_RANK: _bindgen_ty_35 = 71;
pub const FONT32_RAC_LAP_MARK_NUM: _bindgen_ty_35 = 72;
pub const FONT32_RAC_LAP_NUM: _bindgen_ty_35 = 73;
pub const FONT32_RAC_TIME_NUM: _bindgen_ty_35 = 74;
pub const FONT32_RAC_LAP_MARK_NUM_S: _bindgen_ty_35 = 75;
pub const FONT32_RAC_DMY08: _bindgen_ty_35 = 76;
pub const FONT32_RAC_DMY09: _bindgen_ty_35 = 77;
pub const FONT32_RAC_DMY10: _bindgen_ty_35 = 78;
pub const FONT32_RAC_SPD_NUM: _bindgen_ty_35 = 79;
pub const FONT32_RAC_DMY12: _bindgen_ty_35 = 80;
pub const FONT32_RAC_DMY13: _bindgen_ty_35 = 81;
pub const FONT32_TGT_PLAYER: _bindgen_ty_35 = 82;
pub const FONT32_TGT_MSCORE: _bindgen_ty_35 = 83;
pub const FONT32_TGT_SCORE: _bindgen_ty_35 = 84;
pub const FONT32_TGT_SCORE_S: _bindgen_ty_35 = 85;
pub const FONT32_TGT_SPEED: _bindgen_ty_35 = 86;
pub const FONT32_TGT_ROUND: _bindgen_ty_35 = 87;
pub const FONT32_TGT_ALT: _bindgen_ty_35 = 88;
pub const FONT32_TGT_WIND: _bindgen_ty_35 = 89;
pub const FONT32_DMY71: _bindgen_ty_35 = 90;
pub const FONT32_DMY72: _bindgen_ty_35 = 91;
pub const FONT32_DMY73: _bindgen_ty_35 = 92;
pub const FONT32_NUM_NML_SCORE: _bindgen_ty_35 = 93;
pub const FONT32_NUM_NML_TIME: _bindgen_ty_35 = 94;
pub const FONT32_NUM_NML_TIME_S: _bindgen_ty_35 = 95;
pub const FONT32_NUM_NML_SPEED: _bindgen_ty_35 = 96;
pub const FONT32_NUM_NML_SARU: _bindgen_ty_35 = 97;
pub const FONT32_ASC_NML_D5: _bindgen_ty_35 = 98;
pub const FONT32_ASC_NML_D6: _bindgen_ty_35 = 99;
pub const FONT32_ASC_NML_D7: _bindgen_ty_35 = 100;
pub const FONT32_ASC_NML_D8: _bindgen_ty_35 = 101;
pub const FONT32_ASC_NML_D9: _bindgen_ty_35 = 102;
pub const FONT32_DMY79: _bindgen_ty_35 = 103;
pub const FONT32_DMY7a: _bindgen_ty_35 = 104;
pub const FONT32_DMY7b: _bindgen_ty_35 = 105;
pub const FONT32_DMY7c: _bindgen_ty_35 = 106;
pub const FONT32_DMY7d: _bindgen_ty_35 = 107;
pub const FONT32_DMY7e: _bindgen_ty_35 = 108;
pub const FONT32_DMY7f: _bindgen_ty_35 = 109;
pub const FONT32_BOA_TIME_NUM: _bindgen_ty_35 = 110;
pub const FONT32_BOA_DMY02: _bindgen_ty_35 = 111;
pub const FONT32_BOA_RANK: _bindgen_ty_35 = 112;
pub const FONT32_BOA_PLAYER: _bindgen_ty_35 = 113;
pub const FONT32_BOA_SPD_NUM: _bindgen_ty_35 = 114;
pub const FONT32_BOA_LAP_MARK_NUM: _bindgen_ty_35 = 115;
pub const FONT32_BOA_LAP_MARK_NUM_S: _bindgen_ty_35 = 116;
pub const FONT32_BOA_DMY08: _bindgen_ty_35 = 117;
pub const FONT32_BOA_DMY09: _bindgen_ty_35 = 118;
pub const FONT32_BOA_DMY10: _bindgen_ty_35 = 119;
pub const FONT32_BOA_LAP_NUM: _bindgen_ty_35 = 120;
pub const FONT32_BOA_DMY12: _bindgen_ty_35 = 121;
pub const FONT32_BOA_DMY13: _bindgen_ty_35 = 122;
pub const FONT32_BOA_DMY14: _bindgen_ty_35 = 123;
pub const FONT32_BOA_DMY15: _bindgen_ty_35 = 124;
pub const FONT32_BOA_DMY16: _bindgen_ty_35 = 125;
pub const FONT32_DOG_SPEED: _bindgen_ty_35 = 126;
pub const FONT32_DOG_SPEED_S: _bindgen_ty_35 = 127;
pub const FONT32_DOG_MSCORE: _bindgen_ty_35 = 128;
pub const FONT32_DOG_SCORE: _bindgen_ty_35 = 129;
pub const FONT32_DOG_SCORE_M: _bindgen_ty_35 = 130;
pub const FONT32_DOG_SCORE_S: _bindgen_ty_35 = 131;
pub const FONT32_DOG_ROUND: _bindgen_ty_35 = 132;
pub const FONT32_DOG_ALT: _bindgen_ty_35 = 133;
pub const FONT32_DOG_RESULT: _bindgen_ty_35 = 134;
pub const FONT32_DOG_TIME: _bindgen_ty_35 = 135;
pub const FONT32_DOG_DMY02: _bindgen_ty_35 = 136;
pub const FONT32_DOG_DMY03: _bindgen_ty_35 = 137;
pub const FONT32_DOG_DMY04: _bindgen_ty_35 = 138;
pub const FONT32_DOG_DMY05: _bindgen_ty_35 = 139;
pub const FONT32_JAP_TAG: _bindgen_ty_35 = 140;
pub const FONT32_JAP_DMY: _bindgen_ty_35 = 141;
pub const FONT32_JAP_24x24_2: _bindgen_ty_35 = 142;
pub const FONT32_JAP_24x24_2P: _bindgen_ty_35 = 143;
pub const FONT32_JAP_24x24_I: _bindgen_ty_35 = 144;
pub type _bindgen_ty_35 = ::core::ffi::c_uint;
pub type Font32 = undefined4;
pub type Pg_someGameInfo = *mut g_someGameInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct g_someGameInfo {
    pub field_0x0: [undefined; 80usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of g_someGameInfo"][::core::mem::size_of::<g_someGameInfo>() - 80usize];
    ["Alignment of g_someGameInfo"][::core::mem::align_of::<g_someGameInfo>() - 1usize];
    ["Offset of field: g_someGameInfo::field_0x0"]
        [::core::mem::offset_of!(g_someGameInfo, field_0x0) - 0usize];
};
pub type PGSoundGroup = *mut GSoundGroup;
#[repr(C, packed)]
pub struct GSoundGroup {
    pub field_0x0: [undefined; 4usize],
    pub field4_0x4: *mut ::core::ffi::c_char,
    pub field5_0x8: undefined2,
    pub field_0xa: [undefined; 2usize],
    pub g_name: *mut ::core::ffi::c_char,
    pub field9_0x10: __IncompleteArrayField<GSoundGroupEntry>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSoundGroup"][::core::mem::size_of::<GSoundGroup>() - 16usize];
    ["Alignment of GSoundGroup"][::core::mem::align_of::<GSoundGroup>() - 1usize];
    ["Offset of field: GSoundGroup::field_0x0"]
        [::core::mem::offset_of!(GSoundGroup, field_0x0) - 0usize];
    ["Offset of field: GSoundGroup::field4_0x4"]
        [::core::mem::offset_of!(GSoundGroup, field4_0x4) - 4usize];
    ["Offset of field: GSoundGroup::field5_0x8"]
        [::core::mem::offset_of!(GSoundGroup, field5_0x8) - 8usize];
    ["Offset of field: GSoundGroup::field_0xa"]
        [::core::mem::offset_of!(GSoundGroup, field_0xa) - 10usize];
    ["Offset of field: GSoundGroup::g_name"]
        [::core::mem::offset_of!(GSoundGroup, g_name) - 12usize];
    ["Offset of field: GSoundGroup::field9_0x10"]
        [::core::mem::offset_of!(GSoundGroup, field9_0x10) - 16usize];
};
pub type PScenInfo = *mut ScenInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ScenInfo {
    pub mode: ScenMode,
    pub mode_request: ScenMode,
    pub world: undefined2,
    pub world_stage: s16,
    pub flags: undefined4,
    pub next_world: undefined2,
    pub field_0xe: [undefined; 2usize],
    pub score: undefined4,
    pub bananas: undefined4,
    pub g_some_storymode_func_ptr: undefined4,
    pub field_0x1c: [undefined; 6usize],
    pub save_file_idx: undefined1,
    pub field_0x23: [undefined; 1usize],
    pub field19_0x24: undefined4,
    pub field20_0x28: undefined4,
    pub field21_0x2c: undefined4,
    pub field22_0x30: undefined4,
    pub field23_0x34: undefined4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScenInfo"][::core::mem::size_of::<ScenInfo>() - 56usize];
    ["Alignment of ScenInfo"][::core::mem::align_of::<ScenInfo>() - 1usize];
    ["Offset of field: ScenInfo::mode"][::core::mem::offset_of!(ScenInfo, mode) - 0usize];
    ["Offset of field: ScenInfo::mode_request"]
        [::core::mem::offset_of!(ScenInfo, mode_request) - 2usize];
    ["Offset of field: ScenInfo::world"][::core::mem::offset_of!(ScenInfo, world) - 4usize];
    ["Offset of field: ScenInfo::world_stage"]
        [::core::mem::offset_of!(ScenInfo, world_stage) - 6usize];
    ["Offset of field: ScenInfo::flags"][::core::mem::offset_of!(ScenInfo, flags) - 8usize];
    ["Offset of field: ScenInfo::next_world"]
        [::core::mem::offset_of!(ScenInfo, next_world) - 12usize];
    ["Offset of field: ScenInfo::field_0xe"]
        [::core::mem::offset_of!(ScenInfo, field_0xe) - 14usize];
    ["Offset of field: ScenInfo::score"][::core::mem::offset_of!(ScenInfo, score) - 16usize];
    ["Offset of field: ScenInfo::bananas"][::core::mem::offset_of!(ScenInfo, bananas) - 20usize];
    ["Offset of field: ScenInfo::g_some_storymode_func_ptr"]
        [::core::mem::offset_of!(ScenInfo, g_some_storymode_func_ptr) - 24usize];
    ["Offset of field: ScenInfo::field_0x1c"]
        [::core::mem::offset_of!(ScenInfo, field_0x1c) - 28usize];
    ["Offset of field: ScenInfo::save_file_idx"]
        [::core::mem::offset_of!(ScenInfo, save_file_idx) - 34usize];
    ["Offset of field: ScenInfo::field_0x23"]
        [::core::mem::offset_of!(ScenInfo, field_0x23) - 35usize];
    ["Offset of field: ScenInfo::field19_0x24"]
        [::core::mem::offset_of!(ScenInfo, field19_0x24) - 36usize];
    ["Offset of field: ScenInfo::field20_0x28"]
        [::core::mem::offset_of!(ScenInfo, field20_0x28) - 40usize];
    ["Offset of field: ScenInfo::field21_0x2c"]
        [::core::mem::offset_of!(ScenInfo, field21_0x2c) - 44usize];
    ["Offset of field: ScenInfo::field22_0x30"]
        [::core::mem::offset_of!(ScenInfo, field22_0x30) - 48usize];
    ["Offset of field: ScenInfo::field23_0x34"]
        [::core::mem::offset_of!(ScenInfo, field23_0x34) - 52usize];
};
pub const FONT16_ASCII: _bindgen_ty_36 = 0;
pub const FONT16_ASC_8x16: _bindgen_ty_36 = 1;
pub const FONT16_ASC_12x12: _bindgen_ty_36 = 2;
pub const FONT16_ASC_24x24: _bindgen_ty_36 = 3;
pub const FONT16_ASC_16x16P: _bindgen_ty_36 = 4;
pub const FONT16_ASC_16x16: _bindgen_ty_36 = 5;
pub const FONT16_DMY03: _bindgen_ty_36 = 6;
pub const FONT16_DMY04: _bindgen_ty_36 = 7;
pub const FONT16_DMY05: _bindgen_ty_36 = 8;
pub const FONT16_ASC_72x64: _bindgen_ty_36 = 9;
pub const FONT16_DMY06: _bindgen_ty_36 = 10;
pub const FONT16_DMY07: _bindgen_ty_36 = 11;
pub const FONT16_DMY08: _bindgen_ty_36 = 12;
pub const FONT16_DMY09: _bindgen_ty_36 = 13;
pub const FONT16_DMY10: _bindgen_ty_36 = 14;
pub const FONT16_DMY11: _bindgen_ty_36 = 15;
pub const FONT16_DMY12: _bindgen_ty_36 = 16;
pub const FONT16_DMY13: _bindgen_ty_36 = 17;
pub const FONT16_DMY14: _bindgen_ty_36 = 18;
pub const FONT16_DMY15: _bindgen_ty_36 = 19;
pub const FONT16_DMY16: _bindgen_ty_36 = 20;
pub const FONT16_ICON_SD: _bindgen_ty_36 = 21;
pub const FONT16_ICON_SD2: _bindgen_ty_36 = 22;
pub const FONT16_DMY20: _bindgen_ty_36 = 23;
pub const FONT16_DMY21: _bindgen_ty_36 = 24;
pub const FONT16_DMY22: _bindgen_ty_36 = 25;
pub const FONT16_DMY23: _bindgen_ty_36 = 26;
pub const FONT16_DMY_RNK00: _bindgen_ty_36 = 27;
pub const FONT16_DMY_RNK01: _bindgen_ty_36 = 28;
pub const FONT16_DMY_RNK02: _bindgen_ty_36 = 29;
pub const FONT16_DMY_RNK03: _bindgen_ty_36 = 30;
pub const FONT16_DMY_RNK04: _bindgen_ty_36 = 31;
pub const FONT16_RNK_32x32: _bindgen_ty_36 = 32;
pub const FONT16_RNK_NUM: _bindgen_ty_36 = 33;
pub const FONT16_MINI_RNK: _bindgen_ty_36 = 34;
pub const FONT16_SCORE_NUM: _bindgen_ty_36 = 35;
pub const FONT16_DMY_RNK0: _bindgen_ty_36 = 36;
pub const FONT16_DMY_RNK1: _bindgen_ty_36 = 37;
pub const FONT16_DMY_RNK2: _bindgen_ty_36 = 38;
pub const FONT16_DMY_RNK3: _bindgen_ty_36 = 39;
pub const FONT16_DMY_RNK4: _bindgen_ty_36 = 40;
pub const FONT16_DMY_RNK5: _bindgen_ty_36 = 41;
pub const FONT16_DMY_RNK6: _bindgen_ty_36 = 42;
pub const FONT16_DMY_RNK7: _bindgen_ty_36 = 43;
pub const FONT16_DMY_RNK8: _bindgen_ty_36 = 44;
pub const FONT16_DMY_RNK9: _bindgen_ty_36 = 45;
pub const FONT16_DMY_RNKa: _bindgen_ty_36 = 46;
pub const FONT16_DMY_RNKb: _bindgen_ty_36 = 47;
pub const FONT16_DMY_RNKc: _bindgen_ty_36 = 48;
pub const FONT16_DMY_RNKd: _bindgen_ty_36 = 49;
pub const FONT16_DMY_RNKe: _bindgen_ty_36 = 50;
pub const FONT16_DMY_RNKf: _bindgen_ty_36 = 51;
pub const FONT16_SEL_CTRL_PORT: _bindgen_ty_36 = 52;
pub const FONT16_SEL_CTRL_R: _bindgen_ty_36 = 53;
pub const FONT16_SEL_CTRL_B: _bindgen_ty_36 = 54;
pub const FONT16_SEL_CTRL_Y: _bindgen_ty_36 = 55;
pub const FONT16_SEL_CTRL_G: _bindgen_ty_36 = 56;
pub const FONT16_SEL_CTRL_SDW: _bindgen_ty_36 = 57;
pub const FONT16_DMY42: _bindgen_ty_36 = 58;
pub const FONT16_DMY43: _bindgen_ty_36 = 59;
pub const FONT16_BWL_SCORE: _bindgen_ty_36 = 60;
pub const FONT16_DMY50: _bindgen_ty_36 = 61;
pub const FONT16_DMY51: _bindgen_ty_36 = 62;
pub const FONT16_DMY52: _bindgen_ty_36 = 63;
pub const FONT16_DMY53: _bindgen_ty_36 = 64;
pub const FONT16_DMY54: _bindgen_ty_36 = 65;
pub const FONT16_DMY55: _bindgen_ty_36 = 66;
pub const FONT16_DMY56: _bindgen_ty_36 = 67;
pub const FONT16_DMY57: _bindgen_ty_36 = 68;
pub const FONT16_RAC_DMY01: _bindgen_ty_36 = 69;
pub const FONT16_RAC_PLAYER: _bindgen_ty_36 = 70;
pub const FONT16_RAC_RANK: _bindgen_ty_36 = 71;
pub const FONT16_RAC_LAP_MARK_NUM: _bindgen_ty_36 = 72;
pub const FONT16_RAC_LAP_NUM: _bindgen_ty_36 = 73;
pub const FONT16_RAC_TIME_NUM: _bindgen_ty_36 = 74;
pub const FONT16_RAC_LAP_MARK_NUM_S: _bindgen_ty_36 = 75;
pub const FONT16_RAC_DMY08: _bindgen_ty_36 = 76;
pub const FONT16_RAC_DMY09: _bindgen_ty_36 = 77;
pub const FONT16_RAC_DMY10: _bindgen_ty_36 = 78;
pub const FONT16_RAC_SPD_NUM: _bindgen_ty_36 = 79;
pub const FONT16_RAC_DMY12: _bindgen_ty_36 = 80;
pub const FONT16_RAC_DMY13: _bindgen_ty_36 = 81;
pub const FONT16_TGT_PLAYER: _bindgen_ty_36 = 82;
pub const FONT16_TGT_MSCORE: _bindgen_ty_36 = 83;
pub const FONT16_TGT_SCORE: _bindgen_ty_36 = 84;
pub const FONT16_TGT_SCORE_S: _bindgen_ty_36 = 85;
pub const FONT16_TGT_SPEED: _bindgen_ty_36 = 86;
pub const FONT16_TGT_ROUND: _bindgen_ty_36 = 87;
pub const FONT16_TGT_ALT: _bindgen_ty_36 = 88;
pub const FONT16_TGT_WIND: _bindgen_ty_36 = 89;
pub const FONT16_DMY71: _bindgen_ty_36 = 90;
pub const FONT16_DMY72: _bindgen_ty_36 = 91;
pub const FONT16_DMY73: _bindgen_ty_36 = 92;
pub const FONT16_NUM_NML_SCORE: _bindgen_ty_36 = 93;
pub const FONT16_NUM_NML_TIME: _bindgen_ty_36 = 94;
pub const FONT16_NUM_NML_TIME_S: _bindgen_ty_36 = 95;
pub const FONT16_NUM_NML_SPEED: _bindgen_ty_36 = 96;
pub const FONT16_NUM_NML_SARU: _bindgen_ty_36 = 97;
pub const FONT16_ASC_NML_D5: _bindgen_ty_36 = 98;
pub const FONT16_ASC_NML_D6: _bindgen_ty_36 = 99;
pub const FONT16_ASC_NML_D7: _bindgen_ty_36 = 100;
pub const FONT16_ASC_NML_D8: _bindgen_ty_36 = 101;
pub const FONT16_ASC_NML_D9: _bindgen_ty_36 = 102;
pub const FONT16_DMY79: _bindgen_ty_36 = 103;
pub const FONT16_DMY7a: _bindgen_ty_36 = 104;
pub const FONT16_DMY7b: _bindgen_ty_36 = 105;
pub const FONT16_DMY7c: _bindgen_ty_36 = 106;
pub const FONT16_DMY7d: _bindgen_ty_36 = 107;
pub const FONT16_DMY7e: _bindgen_ty_36 = 108;
pub const FONT16_DMY7f: _bindgen_ty_36 = 109;
pub const FONT16_BOA_TIME_NUM: _bindgen_ty_36 = 110;
pub const FONT16_BOA_DMY02: _bindgen_ty_36 = 111;
pub const FONT16_BOA_RANK: _bindgen_ty_36 = 112;
pub const FONT16_BOA_PLAYER: _bindgen_ty_36 = 113;
pub const FONT16_BOA_SPD_NUM: _bindgen_ty_36 = 114;
pub const FONT16_BOA_LAP_MARK_NUM: _bindgen_ty_36 = 115;
pub const FONT16_BOA_LAP_MARK_NUM_S: _bindgen_ty_36 = 116;
pub const FONT16_BOA_DMY08: _bindgen_ty_36 = 117;
pub const FONT16_BOA_DMY09: _bindgen_ty_36 = 118;
pub const FONT16_BOA_DMY10: _bindgen_ty_36 = 119;
pub const FONT16_BOA_LAP_NUM: _bindgen_ty_36 = 120;
pub const FONT16_BOA_DMY12: _bindgen_ty_36 = 121;
pub const FONT16_BOA_DMY13: _bindgen_ty_36 = 122;
pub const FONT16_BOA_DMY14: _bindgen_ty_36 = 123;
pub const FONT16_BOA_DMY15: _bindgen_ty_36 = 124;
pub const FONT16_BOA_DMY16: _bindgen_ty_36 = 125;
pub const FONT16_DOG_SPEED: _bindgen_ty_36 = 126;
pub const FONT16_DOG_SPEED_S: _bindgen_ty_36 = 127;
pub const FONT16_DOG_MSCORE: _bindgen_ty_36 = 128;
pub const FONT16_DOG_SCORE: _bindgen_ty_36 = 129;
pub const FONT16_DOG_SCORE_M: _bindgen_ty_36 = 130;
pub const FONT16_DOG_SCORE_S: _bindgen_ty_36 = 131;
pub const FONT16_DOG_ROUND: _bindgen_ty_36 = 132;
pub const FONT16_DOG_ALT: _bindgen_ty_36 = 133;
pub const FONT16_DOG_RESULT: _bindgen_ty_36 = 134;
pub const FONT16_DOG_TIME: _bindgen_ty_36 = 135;
pub const FONT16_DOG_DMY02: _bindgen_ty_36 = 136;
pub const FONT16_DOG_DMY03: _bindgen_ty_36 = 137;
pub const FONT16_DOG_DMY04: _bindgen_ty_36 = 138;
pub const FONT16_DOG_DMY05: _bindgen_ty_36 = 139;
pub const FONT16_JAP_TAG: _bindgen_ty_36 = 140;
pub const FONT16_JAP_DMY: _bindgen_ty_36 = 141;
pub const FONT16_JAP_24x24_2: _bindgen_ty_36 = 142;
pub const FONT16_JAP_24x24_2P: _bindgen_ty_36 = 143;
pub const FONT16_JAP_24x24_I: _bindgen_ty_36 = 144;
pub type _bindgen_ty_36 = ::core::ffi::c_uint;
pub type Font16 = undefined2;
pub type PMemCardInfo = *mut MemCardInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MemCardInfo {
    pub chan: byte,
    pub field1_0x1: byte,
    pub field2_0x2: byte,
    pub field_0x3: [undefined; 5usize],
    pub field8_0x8: word,
    pub field9_0xa: word,
    pub field10_0xc: dword,
    pub field_0x10: [undefined; 20usize],
    pub field31_0x24: dword,
    pub field_0x28: [undefined; 8usize],
    pub field40_0x30: dword,
    pub field41_0x34: dword,
    pub field42_0x38: dword,
    pub field43_0x3c: dword,
    pub field44_0x40: dword,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemCardInfo"][::core::mem::size_of::<MemCardInfo>() - 68usize];
    ["Alignment of MemCardInfo"][::core::mem::align_of::<MemCardInfo>() - 1usize];
    ["Offset of field: MemCardInfo::chan"][::core::mem::offset_of!(MemCardInfo, chan) - 0usize];
    ["Offset of field: MemCardInfo::field1_0x1"]
        [::core::mem::offset_of!(MemCardInfo, field1_0x1) - 1usize];
    ["Offset of field: MemCardInfo::field2_0x2"]
        [::core::mem::offset_of!(MemCardInfo, field2_0x2) - 2usize];
    ["Offset of field: MemCardInfo::field_0x3"]
        [::core::mem::offset_of!(MemCardInfo, field_0x3) - 3usize];
    ["Offset of field: MemCardInfo::field8_0x8"]
        [::core::mem::offset_of!(MemCardInfo, field8_0x8) - 8usize];
    ["Offset of field: MemCardInfo::field9_0xa"]
        [::core::mem::offset_of!(MemCardInfo, field9_0xa) - 10usize];
    ["Offset of field: MemCardInfo::field10_0xc"]
        [::core::mem::offset_of!(MemCardInfo, field10_0xc) - 12usize];
    ["Offset of field: MemCardInfo::field_0x10"]
        [::core::mem::offset_of!(MemCardInfo, field_0x10) - 16usize];
    ["Offset of field: MemCardInfo::field31_0x24"]
        [::core::mem::offset_of!(MemCardInfo, field31_0x24) - 36usize];
    ["Offset of field: MemCardInfo::field_0x28"]
        [::core::mem::offset_of!(MemCardInfo, field_0x28) - 40usize];
    ["Offset of field: MemCardInfo::field40_0x30"]
        [::core::mem::offset_of!(MemCardInfo, field40_0x30) - 48usize];
    ["Offset of field: MemCardInfo::field41_0x34"]
        [::core::mem::offset_of!(MemCardInfo, field41_0x34) - 52usize];
    ["Offset of field: MemCardInfo::field42_0x38"]
        [::core::mem::offset_of!(MemCardInfo, field42_0x38) - 56usize];
    ["Offset of field: MemCardInfo::field43_0x3c"]
        [::core::mem::offset_of!(MemCardInfo, field43_0x3c) - 60usize];
    ["Offset of field: MemCardInfo::field44_0x40"]
        [::core::mem::offset_of!(MemCardInfo, field44_0x40) - 64usize];
};
pub type PGSomeFileStruct = *mut GSomeFileStruct;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GSomeFileStruct {
    pub dvd_entrynum: BOOL32,
    pub dvdFileInfo: DVDFileInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSomeFileStruct"][::core::mem::size_of::<GSomeFileStruct>() - 68usize];
    ["Alignment of GSomeFileStruct"][::core::mem::align_of::<GSomeFileStruct>() - 1usize];
    ["Offset of field: GSomeFileStruct::dvd_entrynum"]
        [::core::mem::offset_of!(GSomeFileStruct, dvd_entrynum) - 0usize];
    ["Offset of field: GSomeFileStruct::dvdFileInfo"]
        [::core::mem::offset_of!(GSomeFileStruct, dvdFileInfo) - 4usize];
};
pub type PPadStatusGroup = *mut PadStatusGroup;
pub type PPADStatus = *mut PADStatus;
pub const PAD_BUTTON_LEFT: _bindgen_ty_37 = 1;
pub const PAD_BUTTON_RIGHT: _bindgen_ty_37 = 2;
pub const PAD_BUTTON_DOWN: _bindgen_ty_37 = 4;
pub const PAD_BUTTON_UP: _bindgen_ty_37 = 8;
pub const PAD_TRIGGER_Z: _bindgen_ty_37 = 16;
pub const PAD_TRIGGER_R: _bindgen_ty_37 = 32;
pub const PAD_TRIGGER_L: _bindgen_ty_37 = 64;
pub const PAD_BUTTON_A: _bindgen_ty_37 = 256;
pub const PAD_BUTTON_B: _bindgen_ty_37 = 512;
pub const PAD_BUTTON_X: _bindgen_ty_37 = 1024;
pub const PAD_BUTTON_Y: _bindgen_ty_37 = 2048;
pub const PAD_BUTTON_START: _bindgen_ty_37 = 4096;
pub type _bindgen_ty_37 = ::core::ffi::c_uint;
pub type PadDigitalInput = undefined2;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PADStatus {
    pub button: PadDigitalInput,
    pub stickX: s8,
    pub stickY: s8,
    pub substickX: s8,
    pub substickY: s8,
    pub triggerLeft: u8_,
    pub triggerRight: u8_,
    pub analogA: u8_,
    pub analogB: u8_,
    pub err: PadError,
    pub field_0xb: [undefined; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PADStatus"][::core::mem::size_of::<PADStatus>() - 12usize];
    ["Alignment of PADStatus"][::core::mem::align_of::<PADStatus>() - 1usize];
    ["Offset of field: PADStatus::button"][::core::mem::offset_of!(PADStatus, button) - 0usize];
    ["Offset of field: PADStatus::stickX"][::core::mem::offset_of!(PADStatus, stickX) - 2usize];
    ["Offset of field: PADStatus::stickY"][::core::mem::offset_of!(PADStatus, stickY) - 3usize];
    ["Offset of field: PADStatus::substickX"]
        [::core::mem::offset_of!(PADStatus, substickX) - 4usize];
    ["Offset of field: PADStatus::substickY"]
        [::core::mem::offset_of!(PADStatus, substickY) - 5usize];
    ["Offset of field: PADStatus::triggerLeft"]
        [::core::mem::offset_of!(PADStatus, triggerLeft) - 6usize];
    ["Offset of field: PADStatus::triggerRight"]
        [::core::mem::offset_of!(PADStatus, triggerRight) - 7usize];
    ["Offset of field: PADStatus::analogA"][::core::mem::offset_of!(PADStatus, analogA) - 8usize];
    ["Offset of field: PADStatus::analogB"][::core::mem::offset_of!(PADStatus, analogB) - 9usize];
    ["Offset of field: PADStatus::err"][::core::mem::offset_of!(PADStatus, err) - 10usize];
    ["Offset of field: PADStatus::field_0xb"]
        [::core::mem::offset_of!(PADStatus, field_0xb) - 11usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PadStatusGroup {
    pub raw: PADStatus,
    pub prev_tick: PADStatus,
    pub pressed: PADStatus,
    pub released: PADStatus,
    pub repeated: PADStatus,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PadStatusGroup"][::core::mem::size_of::<PadStatusGroup>() - 60usize];
    ["Alignment of PadStatusGroup"][::core::mem::align_of::<PadStatusGroup>() - 1usize];
    ["Offset of field: PadStatusGroup::raw"][::core::mem::offset_of!(PadStatusGroup, raw) - 0usize];
    ["Offset of field: PadStatusGroup::prev_tick"]
        [::core::mem::offset_of!(PadStatusGroup, prev_tick) - 12usize];
    ["Offset of field: PadStatusGroup::pressed"]
        [::core::mem::offset_of!(PadStatusGroup, pressed) - 24usize];
    ["Offset of field: PadStatusGroup::released"]
        [::core::mem::offset_of!(PadStatusGroup, released) - 36usize];
    ["Offset of field: PadStatusGroup::repeated"]
        [::core::mem::offset_of!(PadStatusGroup, repeated) - 48usize];
};
pub type PDigitalInputGroup = *mut DigitalInputGroup;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DigitalInputGroup {
    pub raw: PadDigitalInput,
    pub prev_tick: PadDigitalInput,
    pub pressed: PadDigitalInput,
    pub released: PadDigitalInput,
    pub repeated: PadDigitalInput,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DigitalInputGroup"][::core::mem::size_of::<DigitalInputGroup>() - 10usize];
    ["Alignment of DigitalInputGroup"][::core::mem::align_of::<DigitalInputGroup>() - 1usize];
    ["Offset of field: DigitalInputGroup::raw"]
        [::core::mem::offset_of!(DigitalInputGroup, raw) - 0usize];
    ["Offset of field: DigitalInputGroup::prev_tick"]
        [::core::mem::offset_of!(DigitalInputGroup, prev_tick) - 2usize];
    ["Offset of field: DigitalInputGroup::pressed"]
        [::core::mem::offset_of!(DigitalInputGroup, pressed) - 4usize];
    ["Offset of field: DigitalInputGroup::released"]
        [::core::mem::offset_of!(DigitalInputGroup, released) - 6usize];
    ["Offset of field: DigitalInputGroup::repeated"]
        [::core::mem::offset_of!(DigitalInputGroup, repeated) - 8usize];
};
pub const RENDERFLAG_NONE: _bindgen_ty_38 = 0;
pub const RENDERFLAG_DISP: _bindgen_ty_38 = 8;
pub const RENDERFLAG_MINIMAP: _bindgen_ty_38 = 1024;
pub type _bindgen_ty_38 = ::core::ffi::c_uint;
pub type GRenderringFlags = undefined4;
pub type PAnalogInputGroup = *mut AnalogInputGroup;
pub const PAI_LSTICK_LEFT: _bindgen_ty_39 = 1;
pub const PAI_LSTICK_RIGHT: _bindgen_ty_39 = 2;
pub const PAI_LSTICK_DOWN: _bindgen_ty_39 = 4;
pub const PAI_LSTICK_UP: _bindgen_ty_39 = 8;
pub const PAI_CSTICK_LEFT: _bindgen_ty_39 = 16;
pub const PAI_CSTICK_RIGHT: _bindgen_ty_39 = 32;
pub const PAI_CSTICK_DOWN: _bindgen_ty_39 = 64;
pub const PAI_CSTICK_UP: _bindgen_ty_39 = 128;
pub const PAI_LTRIG: _bindgen_ty_39 = 256;
pub const PAI_RTRIG: _bindgen_ty_39 = 512;
pub type _bindgen_ty_39 = ::core::ffi::c_uint;
pub type PadAnalogInput = undefined2;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AnalogInputGroup {
    pub raw: PadAnalogInput,
    pub prev_tick: PadAnalogInput,
    pub pressed: PadAnalogInput,
    pub released: PadAnalogInput,
    pub repeated: PadAnalogInput,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AnalogInputGroup"][::core::mem::size_of::<AnalogInputGroup>() - 10usize];
    ["Alignment of AnalogInputGroup"][::core::mem::align_of::<AnalogInputGroup>() - 1usize];
    ["Offset of field: AnalogInputGroup::raw"]
        [::core::mem::offset_of!(AnalogInputGroup, raw) - 0usize];
    ["Offset of field: AnalogInputGroup::prev_tick"]
        [::core::mem::offset_of!(AnalogInputGroup, prev_tick) - 2usize];
    ["Offset of field: AnalogInputGroup::pressed"]
        [::core::mem::offset_of!(AnalogInputGroup, pressed) - 4usize];
    ["Offset of field: AnalogInputGroup::released"]
        [::core::mem::offset_of!(AnalogInputGroup, released) - 6usize];
    ["Offset of field: AnalogInputGroup::repeated"]
        [::core::mem::offset_of!(AnalogInputGroup, repeated) - 8usize];
};
pub type PCARDStat = *mut CARDStat;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CARDStat {
    pub fileName: [::core::ffi::c_char; 32usize],
    pub length: u32_,
    pub time: u32_,
    pub gameName: [u8_; 4usize],
    pub company: [u8_; 2usize],
    pub bannerFormat: u8_,
    pub field6_0x2f: u8_,
    pub iconAddr: u32_,
    pub iconFormat: u16_,
    pub iconSpeed: u16_,
    pub commentAddr: u32_,
    pub offsetBanner: u32_,
    pub offsetBannerTlut: u32_,
    pub offsetIcon: [u32_; 8usize],
    pub offsetIconTlut: u32_,
    pub offsetData: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CARDStat"][::core::mem::size_of::<CARDStat>() - 108usize];
    ["Alignment of CARDStat"][::core::mem::align_of::<CARDStat>() - 1usize];
    ["Offset of field: CARDStat::fileName"][::core::mem::offset_of!(CARDStat, fileName) - 0usize];
    ["Offset of field: CARDStat::length"][::core::mem::offset_of!(CARDStat, length) - 32usize];
    ["Offset of field: CARDStat::time"][::core::mem::offset_of!(CARDStat, time) - 36usize];
    ["Offset of field: CARDStat::gameName"][::core::mem::offset_of!(CARDStat, gameName) - 40usize];
    ["Offset of field: CARDStat::company"][::core::mem::offset_of!(CARDStat, company) - 44usize];
    ["Offset of field: CARDStat::bannerFormat"]
        [::core::mem::offset_of!(CARDStat, bannerFormat) - 46usize];
    ["Offset of field: CARDStat::field6_0x2f"]
        [::core::mem::offset_of!(CARDStat, field6_0x2f) - 47usize];
    ["Offset of field: CARDStat::iconAddr"][::core::mem::offset_of!(CARDStat, iconAddr) - 48usize];
    ["Offset of field: CARDStat::iconFormat"]
        [::core::mem::offset_of!(CARDStat, iconFormat) - 52usize];
    ["Offset of field: CARDStat::iconSpeed"]
        [::core::mem::offset_of!(CARDStat, iconSpeed) - 54usize];
    ["Offset of field: CARDStat::commentAddr"]
        [::core::mem::offset_of!(CARDStat, commentAddr) - 56usize];
    ["Offset of field: CARDStat::offsetBanner"]
        [::core::mem::offset_of!(CARDStat, offsetBanner) - 60usize];
    ["Offset of field: CARDStat::offsetBannerTlut"]
        [::core::mem::offset_of!(CARDStat, offsetBannerTlut) - 64usize];
    ["Offset of field: CARDStat::offsetIcon"]
        [::core::mem::offset_of!(CARDStat, offsetIcon) - 68usize];
    ["Offset of field: CARDStat::offsetIconTlut"]
        [::core::mem::offset_of!(CARDStat, offsetIconTlut) - 100usize];
    ["Offset of field: CARDStat::offsetData"]
        [::core::mem::offset_of!(CARDStat, offsetData) - 104usize];
};
pub const NORMAL: _bindgen_ty_40 = 0;
pub const WIDESCREEN: _bindgen_ty_40 = 1;
pub const LETTERBOX: _bindgen_ty_40 = 2;
pub type _bindgen_ty_40 = ::core::ffi::c_uint;
pub type WidescreenMode = undefined1;
pub type PMemCardFile = *mut MemCardFile;
pub type PCARDFileInfo = *mut CARDFileInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CARDFileInfo {
    pub chan: s32,
    pub fileNo: s32,
    pub offset: s32,
    pub length: s32,
    pub iBlock: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CARDFileInfo"][::core::mem::size_of::<CARDFileInfo>() - 18usize];
    ["Alignment of CARDFileInfo"][::core::mem::align_of::<CARDFileInfo>() - 1usize];
    ["Offset of field: CARDFileInfo::chan"][::core::mem::offset_of!(CARDFileInfo, chan) - 0usize];
    ["Offset of field: CARDFileInfo::fileNo"]
        [::core::mem::offset_of!(CARDFileInfo, fileNo) - 4usize];
    ["Offset of field: CARDFileInfo::offset"]
        [::core::mem::offset_of!(CARDFileInfo, offset) - 8usize];
    ["Offset of field: CARDFileInfo::length"]
        [::core::mem::offset_of!(CARDFileInfo, length) - 12usize];
    ["Offset of field: CARDFileInfo::iBlock"]
        [::core::mem::offset_of!(CARDFileInfo, iBlock) - 16usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MemCardFile {
    pub exi_channel_number: s32,
    pub field_0x4: [undefined; 12usize],
    pub gc_file_info: CARDFileInfo,
    pub field_0x22: [undefined; 2usize],
    pub file_name: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemCardFile"][::core::mem::size_of::<MemCardFile>() - 40usize];
    ["Alignment of MemCardFile"][::core::mem::align_of::<MemCardFile>() - 1usize];
    ["Offset of field: MemCardFile::exi_channel_number"]
        [::core::mem::offset_of!(MemCardFile, exi_channel_number) - 0usize];
    ["Offset of field: MemCardFile::field_0x4"]
        [::core::mem::offset_of!(MemCardFile, field_0x4) - 4usize];
    ["Offset of field: MemCardFile::gc_file_info"]
        [::core::mem::offset_of!(MemCardFile, gc_file_info) - 16usize];
    ["Offset of field: MemCardFile::field_0x22"]
        [::core::mem::offset_of!(MemCardFile, field_0x22) - 34usize];
    ["Offset of field: MemCardFile::file_name"]
        [::core::mem::offset_of!(MemCardFile, file_name) - 36usize];
};
pub type PModeInfo = *mut ModeInfo;
pub const BALLMODE_NONE: _bindgen_ty_41 = 0;
pub const BALLMODE_GOALED: _bindgen_ty_41 = 1;
pub const BALLMODE_OUT_OF_TIME_RINGOUT: _bindgen_ty_41 = 2;
pub const BALLMODE_FALLEN_OUT: _bindgen_ty_41 = 4;
pub const BALLMODE_FREEZE_TIMER: _bindgen_ty_41 = 8;
pub const BALLMODE_IN_REPLAY: _bindgen_ty_41 = 16;
pub const BALLMODE_IN_GOAL_ANIMATION: _bindgen_ty_41 = 32;
pub const BALLMODE_ON_BONUS_STAGE: _bindgen_ty_41 = 64;
pub const BALLMODE_IN_STAGE_LOADIN: _bindgen_ty_41 = 256;
pub const BALLMODE_CLEARED_BONUS_PERFECT: _bindgen_ty_41 = 512;
pub const BALLMODE_CLEARED_BONUS_BONUSFINISH_UNUSED: _bindgen_ty_41 = 1024;
pub const BALLMODE_IN_TUTORIAL_SEQUENCE: _bindgen_ty_41 = 2048;
pub const BALLMODE_ON_FINAL_STAGE: _bindgen_ty_41 = 4096;
pub const BALLMODE_OUT_OF_TIME_CONTINUE: _bindgen_ty_41 = 8192;
pub type _bindgen_ty_41 = ::core::ffi::c_uint;
pub type G_BallMode = undefined4;
pub const Blue: _bindgen_ty_42 = 0;
pub const Green: _bindgen_ty_42 = 1;
pub const Red: _bindgen_ty_42 = 2;
pub type _bindgen_ty_42 = ::core::ffi::c_uint;
pub type GoalType = undefined1;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ModeInfo {
    pub ball_mode: G_BallMode,
    pub stage_time_frames_remaining: s16,
    pub stage_time_limit: undefined2,
    pub field3_0x8: undefined4,
    pub entered_goal_idx: s16,
    pub entered_goal_itemgroup_idx: undefined2,
    pub g_ballVelAtGoal: Vec,
    pub g_some_timer_frame_remaining_count: undefined2,
    pub attempt_count: s16,
    pub cm_course_stage_num: undefined2,
    pub g_some_stage_jump_distance: undefined2,
    pub bananas_remaining: undefined4,
    pub field12_0x28: undefined2,
    pub field13_0x2a: undefined2,
    pub g_next_stage_id2: undefined2,
    pub cm_stage_id: s16,
    pub field16_0x30: undefined2,
    pub cm_next_stage_id: undefined2,
    pub g_selected_world_idx: s16,
    pub g_selected_world_stage_idx: undefined2,
    pub entered_goal_type: GoalType,
    pub field_0x39: [undefined; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ModeInfo"][::core::mem::size_of::<ModeInfo>() - 60usize];
    ["Alignment of ModeInfo"][::core::mem::align_of::<ModeInfo>() - 1usize];
    ["Offset of field: ModeInfo::ball_mode"][::core::mem::offset_of!(ModeInfo, ball_mode) - 0usize];
    ["Offset of field: ModeInfo::stage_time_frames_remaining"]
        [::core::mem::offset_of!(ModeInfo, stage_time_frames_remaining) - 4usize];
    ["Offset of field: ModeInfo::stage_time_limit"]
        [::core::mem::offset_of!(ModeInfo, stage_time_limit) - 6usize];
    ["Offset of field: ModeInfo::field3_0x8"]
        [::core::mem::offset_of!(ModeInfo, field3_0x8) - 8usize];
    ["Offset of field: ModeInfo::entered_goal_idx"]
        [::core::mem::offset_of!(ModeInfo, entered_goal_idx) - 12usize];
    ["Offset of field: ModeInfo::entered_goal_itemgroup_idx"]
        [::core::mem::offset_of!(ModeInfo, entered_goal_itemgroup_idx) - 14usize];
    ["Offset of field: ModeInfo::g_ballVelAtGoal"]
        [::core::mem::offset_of!(ModeInfo, g_ballVelAtGoal) - 16usize];
    ["Offset of field: ModeInfo::g_some_timer_frame_remaining_count"]
        [::core::mem::offset_of!(ModeInfo, g_some_timer_frame_remaining_count) - 28usize];
    ["Offset of field: ModeInfo::attempt_count"]
        [::core::mem::offset_of!(ModeInfo, attempt_count) - 30usize];
    ["Offset of field: ModeInfo::cm_course_stage_num"]
        [::core::mem::offset_of!(ModeInfo, cm_course_stage_num) - 32usize];
    ["Offset of field: ModeInfo::g_some_stage_jump_distance"]
        [::core::mem::offset_of!(ModeInfo, g_some_stage_jump_distance) - 34usize];
    ["Offset of field: ModeInfo::bananas_remaining"]
        [::core::mem::offset_of!(ModeInfo, bananas_remaining) - 36usize];
    ["Offset of field: ModeInfo::field12_0x28"]
        [::core::mem::offset_of!(ModeInfo, field12_0x28) - 40usize];
    ["Offset of field: ModeInfo::field13_0x2a"]
        [::core::mem::offset_of!(ModeInfo, field13_0x2a) - 42usize];
    ["Offset of field: ModeInfo::g_next_stage_id2"]
        [::core::mem::offset_of!(ModeInfo, g_next_stage_id2) - 44usize];
    ["Offset of field: ModeInfo::cm_stage_id"]
        [::core::mem::offset_of!(ModeInfo, cm_stage_id) - 46usize];
    ["Offset of field: ModeInfo::field16_0x30"]
        [::core::mem::offset_of!(ModeInfo, field16_0x30) - 48usize];
    ["Offset of field: ModeInfo::cm_next_stage_id"]
        [::core::mem::offset_of!(ModeInfo, cm_next_stage_id) - 50usize];
    ["Offset of field: ModeInfo::g_selected_world_idx"]
        [::core::mem::offset_of!(ModeInfo, g_selected_world_idx) - 52usize];
    ["Offset of field: ModeInfo::g_selected_world_stage_idx"]
        [::core::mem::offset_of!(ModeInfo, g_selected_world_stage_idx) - 54usize];
    ["Offset of field: ModeInfo::entered_goal_type"]
        [::core::mem::offset_of!(ModeInfo, entered_goal_type) - 56usize];
    ["Offset of field: ModeInfo::field_0x39"]
        [::core::mem::offset_of!(ModeInfo, field_0x39) - 57usize];
};
pub type PEvent = *mut Event;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Event {
    pub status: Status,
    pub padding_0x1: [undefined; 3usize],
    pub name: *mut ::core::ffi::c_char,
    pub init_func: ::core::option::Option<unsafe extern "C" fn()>,
    pub tick_func: ::core::option::Option<unsafe extern "C" fn()>,
    pub dest_func: ::core::option::Option<unsafe extern "C" fn()>,
    pub tick_time: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Event"][::core::mem::size_of::<Event>() - 24usize];
    ["Alignment of Event"][::core::mem::align_of::<Event>() - 1usize];
    ["Offset of field: Event::status"][::core::mem::offset_of!(Event, status) - 0usize];
    ["Offset of field: Event::padding_0x1"][::core::mem::offset_of!(Event, padding_0x1) - 1usize];
    ["Offset of field: Event::name"][::core::mem::offset_of!(Event, name) - 4usize];
    ["Offset of field: Event::init_func"][::core::mem::offset_of!(Event, init_func) - 8usize];
    ["Offset of field: Event::tick_func"][::core::mem::offset_of!(Event, tick_func) - 12usize];
    ["Offset of field: Event::dest_func"][::core::mem::offset_of!(Event, dest_func) - 16usize];
    ["Offset of field: Event::tick_time"][::core::mem::offset_of!(Event, tick_time) - 20usize];
};
pub type wchar16 = ::core::ffi::c_ushort;
pub const EVENT_STAGE: _bindgen_ty_43 = 0;
pub const EVENT_WORLD: _bindgen_ty_43 = 1;
pub const EVENT_BALL: _bindgen_ty_43 = 2;
pub const EVENT_APE: _bindgen_ty_43 = 3;
pub const EVENT_STOBJ: _bindgen_ty_43 = 4;
pub const EVENT_ITEM: _bindgen_ty_43 = 5;
pub const EVENT_RECPLAY: _bindgen_ty_43 = 6;
pub const EVENT_OBJ_COLLISION: _bindgen_ty_43 = 7;
pub const EVENT_NAME_ENTRY: _bindgen_ty_43 = 8;
pub const EVENT_INFO: _bindgen_ty_43 = 9;
pub const EVENT_COURSE: _bindgen_ty_43 = 10;
pub const EVENT_VIBRATION: _bindgen_ty_43 = 11;
pub const EVENT_COMMEND: _bindgen_ty_43 = 12;
pub const EVENT_VIEW: _bindgen_ty_43 = 13;
pub const EVENT_EFFECT: _bindgen_ty_43 = 14;
pub const EVENT_MINIMAP: _bindgen_ty_43 = 15;
pub const EVENT_CAMERA: _bindgen_ty_43 = 16;
pub const EVENT_SPRITE: _bindgen_ty_43 = 17;
pub const EVENT_MOUSE: _bindgen_ty_43 = 18;
pub const EVENT_SOUND: _bindgen_ty_43 = 19;
pub const EVENT_BACKGROUND: _bindgen_ty_43 = 20;
pub const EVENT_REND_EFC: _bindgen_ty_43 = 21;
pub const EVENT_ADX: _bindgen_ty_43 = 22;
pub const EVENT_NONE: _bindgen_ty_43 = 4294967295;
pub type _bindgen_ty_43 = ::core::ffi::c_uint;
pub type EventID = undefined4;
pub const BANANA_SINGLE: _bindgen_ty_44 = 0;
pub const BANANA_BUNCH: _bindgen_ty_44 = 1;
pub type _bindgen_ty_44 = ::core::ffi::c_uint;
pub type BananaType = undefined4;
pub const DATA_SELECT_MENU: _bindgen_ty_45 = 0;
pub const NAME_ENTRY_MENU: _bindgen_ty_45 = 1;
pub const STAGE_SELECT_MENU: _bindgen_ty_45 = 2;
pub const RETURN_TO_MAIN_MENU: _bindgen_ty_45 = 3;
pub type _bindgen_ty_45 = ::core::ffi::c_uint;
pub type StoryModeMenuState = undefined1;
pub type P__OutStrCtrl = *mut __OutStrCtrl;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct __OutStrCtrl {
    pub CharStr: *mut ::core::ffi::c_char,
    pub MaxCharCount: usize,
    pub CharsWritten: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __OutStrCtrl"][::core::mem::size_of::<__OutStrCtrl>() - 12usize];
    ["Alignment of __OutStrCtrl"][::core::mem::align_of::<__OutStrCtrl>() - 1usize];
    ["Offset of field: __OutStrCtrl::CharStr"]
        [::core::mem::offset_of!(__OutStrCtrl, CharStr) - 0usize];
    ["Offset of field: __OutStrCtrl::MaxCharCount"]
        [::core::mem::offset_of!(__OutStrCtrl, MaxCharCount) - 4usize];
    ["Offset of field: __OutStrCtrl::CharsWritten"]
        [::core::mem::offset_of!(__OutStrCtrl, CharsWritten) - 8usize];
};
pub type POptiGXSettings = *mut OptiGXSettings;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OptiGXSettings {
    pub field_0x0: [undefined; 3120usize],
    pub chan_color0: OptiGXChanSettings,
    pub chan_color1: OptiGXChanSettings,
    pub chan_alpha0: OptiGXChanSettings,
    pub chan_alpha1: OptiGXChanSettings,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OptiGXSettings"][::core::mem::size_of::<OptiGXSettings>() - 3216usize];
    ["Alignment of OptiGXSettings"][::core::mem::align_of::<OptiGXSettings>() - 1usize];
    ["Offset of field: OptiGXSettings::field_0x0"]
        [::core::mem::offset_of!(OptiGXSettings, field_0x0) - 0usize];
    ["Offset of field: OptiGXSettings::chan_color0"]
        [::core::mem::offset_of!(OptiGXSettings, chan_color0) - 3120usize];
    ["Offset of field: OptiGXSettings::chan_color1"]
        [::core::mem::offset_of!(OptiGXSettings, chan_color1) - 3144usize];
    ["Offset of field: OptiGXSettings::chan_alpha0"]
        [::core::mem::offset_of!(OptiGXSettings, chan_alpha0) - 3168usize];
    ["Offset of field: OptiGXSettings::chan_alpha1"]
        [::core::mem::offset_of!(OptiGXSettings, chan_alpha1) - 3192usize];
};
pub type PS32Vec = *mut S32Vec;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct S32Vec {
    pub x: s32,
    pub y: s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S32Vec"][::core::mem::size_of::<S32Vec>() - 8usize];
    ["Alignment of S32Vec"][::core::mem::align_of::<S32Vec>() - 1usize];
    ["Offset of field: S32Vec::x"][::core::mem::offset_of!(S32Vec, x) - 0usize];
    ["Offset of field: S32Vec::y"][::core::mem::offset_of!(S32Vec, y) - 4usize];
};
pub const OF_G_SMTH_WITH_CAMERA: _bindgen_ty_46 = 2;
pub const OF_GAME_PAUSED: _bindgen_ty_46 = 8;
pub type _bindgen_ty_46 = ::core::ffi::c_uint;
pub type GOtherFlags = undefined4;
pub type PMap = *mut Map;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Map {
    pub size: ::core::ffi::c_int,
    pub field1_0x4: undefined4,
    pub field_0x8: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Map"][::core::mem::size_of::<Map>() - 12usize];
    ["Alignment of Map"][::core::mem::align_of::<Map>() - 1usize];
    ["Offset of field: Map::size"][::core::mem::offset_of!(Map, size) - 0usize];
    ["Offset of field: Map::field1_0x4"][::core::mem::offset_of!(Map, field1_0x4) - 4usize];
    ["Offset of field: Map::field_0x8"][::core::mem::offset_of!(Map, field_0x8) - 8usize];
};
pub type PgDiscQueueItem = *mut gDiscQueueItem;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct gDiscQueueItem {
    pub status: ::core::ffi::c_int,
    pub entrynum: ::core::ffi::c_int,
    pub group: undefined4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gDiscQueueItem"][::core::mem::size_of::<gDiscQueueItem>() - 12usize];
    ["Alignment of gDiscQueueItem"][::core::mem::align_of::<gDiscQueueItem>() - 1usize];
    ["Offset of field: gDiscQueueItem::status"]
        [::core::mem::offset_of!(gDiscQueueItem, status) - 0usize];
    ["Offset of field: gDiscQueueItem::entrynum"]
        [::core::mem::offset_of!(gDiscQueueItem, entrynum) - 4usize];
    ["Offset of field: gDiscQueueItem::group"]
        [::core::mem::offset_of!(gDiscQueueItem, group) - 8usize];
};
pub const MINIMAP_HIDDEN: _bindgen_ty_47 = 0;
pub const MINIMAP_SHRINK: _bindgen_ty_47 = 1;
pub const MINIMAP_SHOWN: _bindgen_ty_47 = 2;
pub const MINIMAP_EXPAND: _bindgen_ty_47 = 3;
pub const MINIMAP_INIT: _bindgen_ty_47 = 4;
pub type _bindgen_ty_47 = ::core::ffi::c_uint;
pub type MinimapMode = undefined4;
pub const LOCALE_ENGLISH: _bindgen_ty_48 = 0;
pub const LOCALE_GERMAN: _bindgen_ty_48 = 1;
pub const LOCALE_FRENCH: _bindgen_ty_48 = 2;
pub const LOCALE_SPANISH: _bindgen_ty_48 = 3;
pub const LOCALE_ITALIAN: _bindgen_ty_48 = 4;
pub const LOCALE_JAPANESE: _bindgen_ty_48 = 5;
pub type _bindgen_ty_48 = ::core::ffi::c_uint;
pub type Locale = undefined4;
pub const EFFECT_PAPERFRAG: _bindgen_ty_49 = 0;
pub const EFFECT_GET_BANANA: _bindgen_ty_49 = 1;
pub const EFFECT_COLI_PARTICLE: _bindgen_ty_49 = 2;
pub const EFFECT_HOLDING_BANANA: _bindgen_ty_49 = 3;
pub const EFFECT_LEVITATE: _bindgen_ty_49 = 4;
pub const EFFECT_COLISTAR_PARTICLE: _bindgen_ty_49 = 5;
pub const EFFECT_BGWAT_BUBBLE_BASE: _bindgen_ty_49 = 6;
pub const EFFECT_BGWAT_BUBBLE: _bindgen_ty_49 = 7;
pub const EFFECT_METEO: _bindgen_ty_49 = 8;
pub const EFFECT_METEO_FIX: _bindgen_ty_49 = 9;
pub const EFFECT_COLIFLASH: _bindgen_ty_49 = 10;
pub const EFFECT_BNS_STG_STAR: _bindgen_ty_49 = 11;
pub const EFFECT_BNS_STG_STAR_TAIL: _bindgen_ty_49 = 12;
pub const EFFECT_BGMST_GEN_CLOUD: _bindgen_ty_49 = 13;
pub const EFFECT_BGSTM_RAINRIPPLE: _bindgen_ty_49 = 14;
pub const EFFECT_NAMEENT_CODE: _bindgen_ty_49 = 15;
pub const EFFECT_GET_NAMEENT_CODE: _bindgen_ty_49 = 16;
pub const EFFECT_BGMST_WATER: _bindgen_ty_49 = 17;
pub const EFFECT_COMMENDFRAG: _bindgen_ty_49 = 18;
pub const EFFECT_ENDING_BALLFRAG: _bindgen_ty_49 = 19;
pub const EFFECT_BANANA_DROP: _bindgen_ty_49 = 20;
pub const EFFECT_BGEND_WATER: _bindgen_ty_49 = 21;
pub const EFFECT_BGBTMFIRE_PTCL: _bindgen_ty_49 = 22;
pub const EFFECT_PIYO: _bindgen_ty_49 = 23;
pub const EFFECT_DUMMY1: _bindgen_ty_49 = 24;
pub const EFFECT_DUMMY2: _bindgen_ty_49 = 25;
pub const EFFECT_DUMMY3: _bindgen_ty_49 = 26;
pub const EFFECT_DUMMY4: _bindgen_ty_49 = 27;
pub const EFFECT_DUMMY5: _bindgen_ty_49 = 28;
pub const EFFECT_DUMMY6: _bindgen_ty_49 = 29;
pub const EFFECT_DUMMY7: _bindgen_ty_49 = 30;
pub const EFFECT_DUMMY8: _bindgen_ty_49 = 31;
pub const EFFECT_DUMMY9: _bindgen_ty_49 = 32;
pub const EFFECT_DUMMYA: _bindgen_ty_49 = 33;
pub const EFFECT_DUMMYB: _bindgen_ty_49 = 34;
pub const EFFECT_DUMMYC: _bindgen_ty_49 = 35;
pub const EFFECT_DUMMYD: _bindgen_ty_49 = 36;
pub const EFFECT_DUMMYE: _bindgen_ty_49 = 37;
pub const EFFECT_DUMMYF: _bindgen_ty_49 = 38;
pub const EFFECT_TMP001: _bindgen_ty_49 = 39;
pub const EFFECT_TMP002: _bindgen_ty_49 = 40;
pub const EFFECT_TMP003: _bindgen_ty_49 = 41;
pub const EFFECT_TMP004: _bindgen_ty_49 = 42;
pub const EFFECT_TMP005: _bindgen_ty_49 = 43;
pub const EFFECT_TMP006: _bindgen_ty_49 = 44;
pub const EFFECT_TMP007: _bindgen_ty_49 = 45;
pub const EFFECT_TMP008: _bindgen_ty_49 = 46;
pub const EFFECT_TMP009: _bindgen_ty_49 = 47;
pub const EFFECT_TMP010: _bindgen_ty_49 = 48;
pub const EFFECT_TMP011: _bindgen_ty_49 = 49;
pub const EFFECT_TMP012: _bindgen_ty_49 = 50;
pub const EFFECT_TMP013: _bindgen_ty_49 = 51;
pub const EFFECT_TMP014: _bindgen_ty_49 = 52;
pub const EFFECT_TMP015: _bindgen_ty_49 = 53;
pub const EFFECT_TMP016: _bindgen_ty_49 = 54;
pub const EFFECT_TMP017: _bindgen_ty_49 = 55;
pub const EFFECT_TMP018: _bindgen_ty_49 = 56;
pub const EFFECT_TMP019: _bindgen_ty_49 = 57;
pub const EFFECT_TMP020: _bindgen_ty_49 = 58;
pub const EFFECT_TMP021: _bindgen_ty_49 = 59;
pub const EFFECT_TMP022: _bindgen_ty_49 = 60;
pub const EFFECT_TMP023: _bindgen_ty_49 = 61;
pub const EFFECT_TMP024: _bindgen_ty_49 = 62;
pub const EFFECT_TMP025: _bindgen_ty_49 = 63;
pub const EFFECT_TMP026: _bindgen_ty_49 = 64;
pub const EFFECT_TMP027: _bindgen_ty_49 = 65;
pub const EFFECT_TMP028: _bindgen_ty_49 = 66;
pub const EFFECT_TMP029: _bindgen_ty_49 = 67;
pub const EFFECT_TMP030: _bindgen_ty_49 = 68;
pub const EFFECT_TMP031: _bindgen_ty_49 = 69;
pub const EFFECT_TMP032: _bindgen_ty_49 = 70;
pub type _bindgen_ty_49 = ::core::ffi::c_uint;
pub type EffectType = undefined2;
pub const GX_USAGE_NONE: _bindgen_ty_50 = 0;
pub const GX_USAGE_LOCKED_CACHE_ENABLED: _bindgen_ty_50 = 2;
pub const GX_USAGE_HAS_SECOND_FIFO: _bindgen_ty_50 = 4;
pub type _bindgen_ty_50 = ::core::ffi::c_uint;
pub type GxUsageState = undefined4;
pub const DSMS_DEFAULT: _bindgen_ty_51 = 0;
pub const DSMS_CHOOSE_DATA_TO_COPY: _bindgen_ty_51 = 1;
pub const DSMS_CHOOSE_WHERE_TO_COPY_TO: _bindgen_ty_51 = 2;
pub const DSMS_CONFIRM_COPY: _bindgen_ty_51 = 3;
pub const DSMS_CANCELLED_COPY: _bindgen_ty_51 = 4;
pub const DSMS_COPY_DATA: _bindgen_ty_51 = 5;
pub const DSMS_CHOOSE_DATA_TO_DELETE: _bindgen_ty_51 = 6;
pub const DSMS_CONFIRM_DELETE: _bindgen_ty_51 = 7;
pub const DSMS_CANCELLED_DELETE: _bindgen_ty_51 = 8;
pub const DSMS_DELETE_DATA: _bindgen_ty_51 = 9;
pub const DSMS_OPEN_DATA: _bindgen_ty_51 = 10;
pub const DSMS_RETURN_SELECTED: _bindgen_ty_51 = 11;
pub const DSMS_RETURN_TO_MAIN_GAME_SELECT: _bindgen_ty_51 = 12;
pub type _bindgen_ty_51 = ::core::ffi::c_uint;
pub type DataSelectMenuState = undefined1;
pub const EFFECT_NULL: _bindgen_ty_52 = 0;
pub const EFFECT_CAST_SHADOW: _bindgen_ty_52 = 1;
pub const EFFECT_RECEIVE_SHADOW: _bindgen_ty_52 = 2;
pub const EFFECT_UNKNOWN_3: _bindgen_ty_52 = 4;
pub const EFFECT_TRANSPARENCY_A: _bindgen_ty_52 = 8;
pub const EFFECT_TRANSPARENCY_B: _bindgen_ty_52 = 16;
pub const EFFECT_UNKNOWN_6: _bindgen_ty_52 = 32;
pub const EFFECT_UNKNOWN_7: _bindgen_ty_52 = 64;
pub const EFFECT_UNKNOWN_8: _bindgen_ty_52 = 128;
pub type _bindgen_ty_52 = ::core::ffi::c_uint;
pub type StageModelEffectBitfield = undefined4;
pub type PEffect = *mut Effect;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Effect {
    pub g_idx: word,
    pub id: ::core::ffi::c_short,
    pub field_0x4: [undefined; 4usize],
    pub type_: EffectType,
    pub field_0xa: [undefined; 2usize],
    pub field9_0xc: s32,
    pub field_0x10: [undefined; 4usize],
    pub g_ball_idx: undefined2,
    pub field15_0x16: s16,
    pub field_0x18: [undefined; 12usize],
    pub g_scale: Vec,
    pub g_pointer_to_some_struct: s32,
    pub g_pos: Vec,
    pub g_some_vec: Vec,
    pub g_some_rot: S16Vec,
    pub field_0x52: [undefined; 6usize],
    pub g_prev_pos: Vec,
    pub field_0x64: [undefined; 40usize],
    pub g_some_vec2: Vec,
    pub g_some_vec3: Vec,
    pub field_0xa4: [undefined; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Effect"][::core::mem::size_of::<Effect>() - 176usize];
    ["Alignment of Effect"][::core::mem::align_of::<Effect>() - 1usize];
    ["Offset of field: Effect::g_idx"][::core::mem::offset_of!(Effect, g_idx) - 0usize];
    ["Offset of field: Effect::id"][::core::mem::offset_of!(Effect, id) - 2usize];
    ["Offset of field: Effect::field_0x4"][::core::mem::offset_of!(Effect, field_0x4) - 4usize];
    ["Offset of field: Effect::type_"][::core::mem::offset_of!(Effect, type_) - 8usize];
    ["Offset of field: Effect::field_0xa"][::core::mem::offset_of!(Effect, field_0xa) - 10usize];
    ["Offset of field: Effect::field9_0xc"][::core::mem::offset_of!(Effect, field9_0xc) - 12usize];
    ["Offset of field: Effect::field_0x10"][::core::mem::offset_of!(Effect, field_0x10) - 16usize];
    ["Offset of field: Effect::g_ball_idx"][::core::mem::offset_of!(Effect, g_ball_idx) - 20usize];
    ["Offset of field: Effect::field15_0x16"]
        [::core::mem::offset_of!(Effect, field15_0x16) - 22usize];
    ["Offset of field: Effect::field_0x18"][::core::mem::offset_of!(Effect, field_0x18) - 24usize];
    ["Offset of field: Effect::g_scale"][::core::mem::offset_of!(Effect, g_scale) - 36usize];
    ["Offset of field: Effect::g_pointer_to_some_struct"]
        [::core::mem::offset_of!(Effect, g_pointer_to_some_struct) - 48usize];
    ["Offset of field: Effect::g_pos"][::core::mem::offset_of!(Effect, g_pos) - 52usize];
    ["Offset of field: Effect::g_some_vec"][::core::mem::offset_of!(Effect, g_some_vec) - 64usize];
    ["Offset of field: Effect::g_some_rot"][::core::mem::offset_of!(Effect, g_some_rot) - 76usize];
    ["Offset of field: Effect::field_0x52"][::core::mem::offset_of!(Effect, field_0x52) - 82usize];
    ["Offset of field: Effect::g_prev_pos"][::core::mem::offset_of!(Effect, g_prev_pos) - 88usize];
    ["Offset of field: Effect::field_0x64"][::core::mem::offset_of!(Effect, field_0x64) - 100usize];
    ["Offset of field: Effect::g_some_vec2"]
        [::core::mem::offset_of!(Effect, g_some_vec2) - 140usize];
    ["Offset of field: Effect::g_some_vec3"]
        [::core::mem::offset_of!(Effect, g_some_vec3) - 152usize];
    ["Offset of field: Effect::field_0xa4"][::core::mem::offset_of!(Effect, field_0xa4) - 164usize];
};
pub const PMT_UNKNOWN0: _bindgen_ty_53 = 0;
pub const PMT_CHALLENGE: _bindgen_ty_53 = 1;
pub const PMT_PRACTICE: _bindgen_ty_53 = 2;
pub const PMT_UNKNOWN3: _bindgen_ty_53 = 3;
pub const PMT_UNKNOWN4: _bindgen_ty_53 = 4;
pub const PMT_STORY_STAGE_SELECT: _bindgen_ty_53 = 5;
pub const PMT_STORY_PLAY: _bindgen_ty_53 = 6;
pub const PMT_UNKNOWN7: _bindgen_ty_53 = 7;
pub type _bindgen_ty_53 = ::core::ffi::c_uint;
pub type PauseMenuType = undefined4;
pub type Pytgut = *mut ytgut;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ytgut {
    pub field_0x0: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ytgut"][::core::mem::size_of::<ytgut>() - 4usize];
    ["Alignment of ytgut"][::core::mem::align_of::<ytgut>() - 1usize];
    ["Offset of field: ytgut::field_0x0"][::core::mem::offset_of!(ytgut, field_0x0) - 0usize];
};
pub type PGDialogStruct = *mut GDialogStruct;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct GDialogStruct {
    pub g_test_dialog_ptr: undefined4,
    pub field_0x4: [undefined; 312usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GDialogStruct"][::core::mem::size_of::<GDialogStruct>() - 316usize];
    ["Alignment of GDialogStruct"][::core::mem::align_of::<GDialogStruct>() - 1usize];
    ["Offset of field: GDialogStruct::g_test_dialog_ptr"]
        [::core::mem::offset_of!(GDialogStruct, g_test_dialog_ptr) - 0usize];
    ["Offset of field: GDialogStruct::field_0x4"]
        [::core::mem::offset_of!(GDialogStruct, field_0x4) - 4usize];
};
pub type PPoolInfo = *mut PoolInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PoolInfo {
    pub len: dword,
    pub low_free_idx: dword,
    pub upper_bound: dword,
    pub status_list: *mut u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PoolInfo"][::core::mem::size_of::<PoolInfo>() - 16usize];
    ["Alignment of PoolInfo"][::core::mem::align_of::<PoolInfo>() - 1usize];
    ["Offset of field: PoolInfo::len"][::core::mem::offset_of!(PoolInfo, len) - 0usize];
    ["Offset of field: PoolInfo::low_free_idx"]
        [::core::mem::offset_of!(PoolInfo, low_free_idx) - 4usize];
    ["Offset of field: PoolInfo::upper_bound"]
        [::core::mem::offset_of!(PoolInfo, upper_bound) - 8usize];
    ["Offset of field: PoolInfo::status_list"]
        [::core::mem::offset_of!(PoolInfo, status_list) - 12usize];
};
pub type PSelMenuInfo = *mut SelMenuInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SelMenuInfo {
    pub menu_stack_ptr: u8_,
    pub menu_stack: [u8_; 10usize],
    pub field_0xb: [undefined; 3usize],
    pub field5_0xe: undefined2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SelMenuInfo"][::core::mem::size_of::<SelMenuInfo>() - 16usize];
    ["Alignment of SelMenuInfo"][::core::mem::align_of::<SelMenuInfo>() - 1usize];
    ["Offset of field: SelMenuInfo::menu_stack_ptr"]
        [::core::mem::offset_of!(SelMenuInfo, menu_stack_ptr) - 0usize];
    ["Offset of field: SelMenuInfo::menu_stack"]
        [::core::mem::offset_of!(SelMenuInfo, menu_stack) - 1usize];
    ["Offset of field: SelMenuInfo::field_0xb"]
        [::core::mem::offset_of!(SelMenuInfo, field_0xb) - 11usize];
    ["Offset of field: SelMenuInfo::field5_0xe"]
        [::core::mem::offset_of!(SelMenuInfo, field5_0xe) - 14usize];
};
pub const PIID_LEFT: _bindgen_ty_54 = 0;
pub const PIID_RIGHT: _bindgen_ty_54 = 1;
pub const PIID_UP: _bindgen_ty_54 = 2;
pub const PIID_DOWN: _bindgen_ty_54 = 3;
pub const PIID_L: _bindgen_ty_54 = 4;
pub const PIID_R: _bindgen_ty_54 = 5;
pub const PIID_A: _bindgen_ty_54 = 6;
pub const PIID_B: _bindgen_ty_54 = 7;
pub const PIID_X: _bindgen_ty_54 = 8;
pub type _bindgen_ty_54 = ::core::ffi::c_uint;
pub type PadInputID = undefined4;
pub const PLAYBACK_FORWARD: _bindgen_ty_55 = 0;
pub const PLAYBACK_PAUSE: _bindgen_ty_55 = 1;
pub const PLAYBACK_BACKWARD: _bindgen_ty_55 = 2;
pub const PLAYBACK_FAST_FORWARD: _bindgen_ty_55 = 3;
pub const PLAYBACK_FAST_BACKWARD: _bindgen_ty_55 = 4;
pub type _bindgen_ty_55 = ::core::ffi::c_uint;
pub type PlaybackState = undefined2;
pub const TEXTDRAW_FLAG_BORDER: _bindgen_ty_56 = 536870912;
pub const TEXTDRAW_FLAG_DROP_SHADOW: _bindgen_ty_56 = 1073741824;
pub const TEXTDRAW_FLAG_PROPORTIONAL: _bindgen_ty_56 = 2147483648;
pub type _bindgen_ty_56 = ::core::ffi::c_uint;
pub type TextDrawFlags = undefined4;
pub type _IO_lock_t = ::core::ffi::c_void;
pub type P_IO_marker = *mut _IO_marker;
pub type P_IO_FILE = *mut _IO_FILE;
pub type __off_t = ::core::ffi::c_long;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_marker"][::core::mem::size_of::<_IO_marker>() - 12usize];
    ["Alignment of _IO_marker"][::core::mem::align_of::<_IO_marker>() - 1usize];
    ["Offset of field: _IO_marker::_next"][::core::mem::offset_of!(_IO_marker, _next) - 0usize];
    ["Offset of field: _IO_marker::_sbuf"][::core::mem::offset_of!(_IO_marker, _sbuf) - 4usize];
    ["Offset of field: _IO_marker::_pos"][::core::mem::offset_of!(_IO_marker, _pos) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::core::ffi::c_int,
    pub _IO_read_ptr: *mut ::core::ffi::c_char,
    pub _IO_read_end: *mut ::core::ffi::c_char,
    pub _IO_read_base: *mut ::core::ffi::c_char,
    pub _IO_write_base: *mut ::core::ffi::c_char,
    pub _IO_write_ptr: *mut ::core::ffi::c_char,
    pub _IO_write_end: *mut ::core::ffi::c_char,
    pub _IO_buf_base: *mut ::core::ffi::c_char,
    pub _IO_buf_end: *mut ::core::ffi::c_char,
    pub _IO_save_base: *mut ::core::ffi::c_char,
    pub _IO_backup_base: *mut ::core::ffi::c_char,
    pub _IO_save_end: *mut ::core::ffi::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::core::ffi::c_int,
    pub _flags2: ::core::ffi::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ushort,
    pub _vtable_offset: ::core::ffi::c_char,
    pub _shortbuf: [::core::ffi::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub __pad1: *mut ::core::ffi::c_void,
    pub __pad2: *mut ::core::ffi::c_void,
    pub __pad3: *mut ::core::ffi::c_void,
    pub __pad4: *mut ::core::ffi::c_void,
    pub __pad5: usize,
    pub _mode: ::core::ffi::c_int,
    pub _unused2: [::core::ffi::c_char; 15usize],
    pub padding_0x73: [undefined; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::core::mem::size_of::<_IO_FILE>() - 116usize];
    ["Alignment of _IO_FILE"][::core::mem::align_of::<_IO_FILE>() - 1usize];
    ["Offset of field: _IO_FILE::_flags"][::core::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 4usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_end) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_base) - 12usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_base) - 16usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 20usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_end) - 24usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_buf_base) - 28usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_buf_end) - 32usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_save_base) - 36usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_backup_base) - 40usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_save_end) - 44usize];
    ["Offset of field: _IO_FILE::_markers"][::core::mem::offset_of!(_IO_FILE, _markers) - 48usize];
    ["Offset of field: _IO_FILE::_chain"][::core::mem::offset_of!(_IO_FILE, _chain) - 52usize];
    ["Offset of field: _IO_FILE::_fileno"][::core::mem::offset_of!(_IO_FILE, _fileno) - 56usize];
    ["Offset of field: _IO_FILE::_flags2"][::core::mem::offset_of!(_IO_FILE, _flags2) - 60usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::core::mem::offset_of!(_IO_FILE, _old_offset) - 64usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::core::mem::offset_of!(_IO_FILE, _cur_column) - 68usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::core::mem::offset_of!(_IO_FILE, _vtable_offset) - 70usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::core::mem::offset_of!(_IO_FILE, _shortbuf) - 71usize];
    ["Offset of field: _IO_FILE::_lock"][::core::mem::offset_of!(_IO_FILE, _lock) - 72usize];
    ["Offset of field: _IO_FILE::__pad1"][::core::mem::offset_of!(_IO_FILE, __pad1) - 76usize];
    ["Offset of field: _IO_FILE::__pad2"][::core::mem::offset_of!(_IO_FILE, __pad2) - 80usize];
    ["Offset of field: _IO_FILE::__pad3"][::core::mem::offset_of!(_IO_FILE, __pad3) - 84usize];
    ["Offset of field: _IO_FILE::__pad4"][::core::mem::offset_of!(_IO_FILE, __pad4) - 88usize];
    ["Offset of field: _IO_FILE::__pad5"][::core::mem::offset_of!(_IO_FILE, __pad5) - 92usize];
    ["Offset of field: _IO_FILE::_mode"][::core::mem::offset_of!(_IO_FILE, _mode) - 96usize];
    ["Offset of field: _IO_FILE::_unused2"][::core::mem::offset_of!(_IO_FILE, _unused2) - 100usize];
    ["Offset of field: _IO_FILE::padding_0x73"]
        [::core::mem::offset_of!(_IO_FILE, padding_0x73) - 115usize];
};
pub type f64_ = f64;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
pub type bool_t = ::core::ffi::c_int;
pub type PgSceneData = *mut gSceneData;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct gSceneData {
    pub world_theme: ::core::ffi::c_char,
    pub g_anim_flag: ::core::ffi::c_char,
    pub ape_count: ::core::ffi::c_char,
    pub field_0x3: [undefined; 5usize],
    pub LOD: ::core::ffi::c_char,
    pub unknown: ::core::ffi::c_char,
    pub scene_item_count: ::core::ffi::c_char,
    pub field_0xb: [undefined; 1usize],
    pub field12_0xc: *mut *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gSceneData"][::core::mem::size_of::<gSceneData>() - 16usize];
    ["Alignment of gSceneData"][::core::mem::align_of::<gSceneData>() - 1usize];
    ["Offset of field: gSceneData::world_theme"]
        [::core::mem::offset_of!(gSceneData, world_theme) - 0usize];
    ["Offset of field: gSceneData::g_anim_flag"]
        [::core::mem::offset_of!(gSceneData, g_anim_flag) - 1usize];
    ["Offset of field: gSceneData::ape_count"]
        [::core::mem::offset_of!(gSceneData, ape_count) - 2usize];
    ["Offset of field: gSceneData::field_0x3"]
        [::core::mem::offset_of!(gSceneData, field_0x3) - 3usize];
    ["Offset of field: gSceneData::LOD"][::core::mem::offset_of!(gSceneData, LOD) - 8usize];
    ["Offset of field: gSceneData::unknown"][::core::mem::offset_of!(gSceneData, unknown) - 9usize];
    ["Offset of field: gSceneData::scene_item_count"]
        [::core::mem::offset_of!(gSceneData, scene_item_count) - 10usize];
    ["Offset of field: gSceneData::field_0xb"]
        [::core::mem::offset_of!(gSceneData, field_0xb) - 11usize];
    ["Offset of field: gSceneData::field12_0xc"]
        [::core::mem::offset_of!(gSceneData, field12_0xc) - 12usize];
};
pub type PStagedefBackgroundAnimHeader = *mut StagedefBackgroundAnimHeader;
pub type PStagedefAnimKeyframe = *mut StagedefAnimKeyframe;
pub const EASING_CONSTANT: _bindgen_ty_57 = 0;
pub const EASING_LINEAR: _bindgen_ty_57 = 1;
pub const EASING_SMOOTH: _bindgen_ty_57 = 2;
pub type _bindgen_ty_57 = ::core::ffi::c_uint;
pub type Easing = undefined4;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefBackgroundAnimHeader {
    pub field_0x0: [undefined; 4usize],
    pub loop_point_seconds: f32,
    pub field_0x8: [undefined; 8usize],
    pub rot_x_keyframe_count: u32_,
    pub rot_x_keyframe_list: *mut StagedefAnimKeyframe,
    pub rot_y_keyframe_count: u32_,
    pub rot_y_keyframe_list: *mut StagedefAnimKeyframe,
    pub rot_z_keyframe_count: u32_,
    pub rot_z_keyframe_list: *mut StagedefAnimKeyframe,
    pub pos_x_keyframe_count: u32_,
    pub pos_x_keyframe_list: *mut StagedefAnimKeyframe,
    pub pos_y_keyframe_count: u32_,
    pub pos_y_keyframe_list: *mut StagedefAnimKeyframe,
    pub pos_z_keyframe_count: u32_,
    pub pos_z_keyframe_list: *mut StagedefAnimKeyframe,
    pub field_0x40: [undefined; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefBackgroundAnimHeader"]
        [::core::mem::size_of::<StagedefBackgroundAnimHeader>() - 80usize];
    ["Alignment of StagedefBackgroundAnimHeader"]
        [::core::mem::align_of::<StagedefBackgroundAnimHeader>() - 1usize];
    ["Offset of field: StagedefBackgroundAnimHeader::field_0x0"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, field_0x0) - 0usize];
    ["Offset of field: StagedefBackgroundAnimHeader::loop_point_seconds"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, loop_point_seconds) - 4usize];
    ["Offset of field: StagedefBackgroundAnimHeader::field_0x8"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, field_0x8) - 8usize];
    ["Offset of field: StagedefBackgroundAnimHeader::rot_x_keyframe_count"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, rot_x_keyframe_count) - 16usize];
    ["Offset of field: StagedefBackgroundAnimHeader::rot_x_keyframe_list"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, rot_x_keyframe_list) - 20usize];
    ["Offset of field: StagedefBackgroundAnimHeader::rot_y_keyframe_count"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, rot_y_keyframe_count) - 24usize];
    ["Offset of field: StagedefBackgroundAnimHeader::rot_y_keyframe_list"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, rot_y_keyframe_list) - 28usize];
    ["Offset of field: StagedefBackgroundAnimHeader::rot_z_keyframe_count"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, rot_z_keyframe_count) - 32usize];
    ["Offset of field: StagedefBackgroundAnimHeader::rot_z_keyframe_list"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, rot_z_keyframe_list) - 36usize];
    ["Offset of field: StagedefBackgroundAnimHeader::pos_x_keyframe_count"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, pos_x_keyframe_count) - 40usize];
    ["Offset of field: StagedefBackgroundAnimHeader::pos_x_keyframe_list"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, pos_x_keyframe_list) - 44usize];
    ["Offset of field: StagedefBackgroundAnimHeader::pos_y_keyframe_count"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, pos_y_keyframe_count) - 48usize];
    ["Offset of field: StagedefBackgroundAnimHeader::pos_y_keyframe_list"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, pos_y_keyframe_list) - 52usize];
    ["Offset of field: StagedefBackgroundAnimHeader::pos_z_keyframe_count"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, pos_z_keyframe_count) - 56usize];
    ["Offset of field: StagedefBackgroundAnimHeader::pos_z_keyframe_list"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, pos_z_keyframe_list) - 60usize];
    ["Offset of field: StagedefBackgroundAnimHeader::field_0x40"]
        [::core::mem::offset_of!(StagedefBackgroundAnimHeader, field_0x40) - 64usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefAnimKeyframe {
    pub easing: Easing,
    pub time: f32,
    pub value: f32,
    pub tangent_in: f32,
    pub tangent_out: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefAnimKeyframe"][::core::mem::size_of::<StagedefAnimKeyframe>() - 20usize];
    ["Alignment of StagedefAnimKeyframe"][::core::mem::align_of::<StagedefAnimKeyframe>() - 1usize];
    ["Offset of field: StagedefAnimKeyframe::easing"]
        [::core::mem::offset_of!(StagedefAnimKeyframe, easing) - 0usize];
    ["Offset of field: StagedefAnimKeyframe::time"]
        [::core::mem::offset_of!(StagedefAnimKeyframe, time) - 4usize];
    ["Offset of field: StagedefAnimKeyframe::value"]
        [::core::mem::offset_of!(StagedefAnimKeyframe, value) - 8usize];
    ["Offset of field: StagedefAnimKeyframe::tangent_in"]
        [::core::mem::offset_of!(StagedefAnimKeyframe, tangent_in) - 12usize];
    ["Offset of field: StagedefAnimKeyframe::tangent_out"]
        [::core::mem::offset_of!(StagedefAnimKeyframe, tangent_out) - 16usize];
};
pub type PStagedefEffectHeader = *mut StagedefEffectHeader;
pub type PStagedefEffect1 = *mut StagedefEffect1;
pub type PStagedefEffect2 = *mut StagedefEffect2;
pub type PStagedefTextureScroll = *mut StagedefTextureScroll;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefEffectHeader {
    pub fx1_keyframe_count: u32_,
    pub fx1_keyframe_list: *mut StagedefEffect1,
    pub fx2_keyframe_count: u32_,
    pub fx2_keyframe_list: *mut StagedefEffect2,
    pub texture_scroll: *mut StagedefTextureScroll,
    pub field_0x14: [undefined; 28usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefEffectHeader"][::core::mem::size_of::<StagedefEffectHeader>() - 48usize];
    ["Alignment of StagedefEffectHeader"][::core::mem::align_of::<StagedefEffectHeader>() - 1usize];
    ["Offset of field: StagedefEffectHeader::fx1_keyframe_count"]
        [::core::mem::offset_of!(StagedefEffectHeader, fx1_keyframe_count) - 0usize];
    ["Offset of field: StagedefEffectHeader::fx1_keyframe_list"]
        [::core::mem::offset_of!(StagedefEffectHeader, fx1_keyframe_list) - 4usize];
    ["Offset of field: StagedefEffectHeader::fx2_keyframe_count"]
        [::core::mem::offset_of!(StagedefEffectHeader, fx2_keyframe_count) - 8usize];
    ["Offset of field: StagedefEffectHeader::fx2_keyframe_list"]
        [::core::mem::offset_of!(StagedefEffectHeader, fx2_keyframe_list) - 12usize];
    ["Offset of field: StagedefEffectHeader::texture_scroll"]
        [::core::mem::offset_of!(StagedefEffectHeader, texture_scroll) - 16usize];
    ["Offset of field: StagedefEffectHeader::field_0x14"]
        [::core::mem::offset_of!(StagedefEffectHeader, field_0x14) - 20usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefEffect1 {
    pub field0_0x0: dword,
    pub field1_0x4: dword,
    pub field2_0x8: dword,
    pub field3_0xc: word,
    pub field4_0xe: word,
    pub field5_0x10: word,
    pub field_0x12: [undefined; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefEffect1"][::core::mem::size_of::<StagedefEffect1>() - 20usize];
    ["Alignment of StagedefEffect1"][::core::mem::align_of::<StagedefEffect1>() - 1usize];
    ["Offset of field: StagedefEffect1::field0_0x0"]
        [::core::mem::offset_of!(StagedefEffect1, field0_0x0) - 0usize];
    ["Offset of field: StagedefEffect1::field1_0x4"]
        [::core::mem::offset_of!(StagedefEffect1, field1_0x4) - 4usize];
    ["Offset of field: StagedefEffect1::field2_0x8"]
        [::core::mem::offset_of!(StagedefEffect1, field2_0x8) - 8usize];
    ["Offset of field: StagedefEffect1::field3_0xc"]
        [::core::mem::offset_of!(StagedefEffect1, field3_0xc) - 12usize];
    ["Offset of field: StagedefEffect1::field4_0xe"]
        [::core::mem::offset_of!(StagedefEffect1, field4_0xe) - 14usize];
    ["Offset of field: StagedefEffect1::field5_0x10"]
        [::core::mem::offset_of!(StagedefEffect1, field5_0x10) - 16usize];
    ["Offset of field: StagedefEffect1::field_0x12"]
        [::core::mem::offset_of!(StagedefEffect1, field_0x12) - 18usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefEffect2 {
    pub field0_0x0: f32,
    pub field1_0x4: f32,
    pub field2_0x8: f32,
    pub field_0xc: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefEffect2"][::core::mem::size_of::<StagedefEffect2>() - 16usize];
    ["Alignment of StagedefEffect2"][::core::mem::align_of::<StagedefEffect2>() - 1usize];
    ["Offset of field: StagedefEffect2::field0_0x0"]
        [::core::mem::offset_of!(StagedefEffect2, field0_0x0) - 0usize];
    ["Offset of field: StagedefEffect2::field1_0x4"]
        [::core::mem::offset_of!(StagedefEffect2, field1_0x4) - 4usize];
    ["Offset of field: StagedefEffect2::field2_0x8"]
        [::core::mem::offset_of!(StagedefEffect2, field2_0x8) - 8usize];
    ["Offset of field: StagedefEffect2::field_0xc"]
        [::core::mem::offset_of!(StagedefEffect2, field_0xc) - 12usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefTextureScroll {
    pub speed: Vec2d,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefTextureScroll"][::core::mem::size_of::<StagedefTextureScroll>() - 8usize];
    ["Alignment of StagedefTextureScroll"]
        [::core::mem::align_of::<StagedefTextureScroll>() - 1usize];
    ["Offset of field: StagedefTextureScroll::speed"]
        [::core::mem::offset_of!(StagedefTextureScroll, speed) - 0usize];
};
pub type PStagedefFogAnimHeader = *mut StagedefFogAnimHeader;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefFogAnimHeader {
    pub start_distance_keyframe_count: u32_,
    pub start_distance_keyframe_list: *mut StagedefAnimKeyframe,
    pub end_distance_keyframe_count: u32_,
    pub end_distance_keyframe_list: *mut StagedefAnimKeyframe,
    pub red_keyframe_count: u32_,
    pub red_keyframe_list: *mut StagedefAnimKeyframe,
    pub green_keyframe_count: u32_,
    pub green_keyframe_list: *mut StagedefAnimKeyframe,
    pub blue_keyframe_count: u32_,
    pub blue_keyframe_list: *mut StagedefAnimKeyframe,
    pub unk_keyframe_count: u32_,
    pub unk_keyframe_list: *mut StagedefAnimKeyframe,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefFogAnimHeader"][::core::mem::size_of::<StagedefFogAnimHeader>() - 48usize];
    ["Alignment of StagedefFogAnimHeader"]
        [::core::mem::align_of::<StagedefFogAnimHeader>() - 1usize];
    ["Offset of field: StagedefFogAnimHeader::start_distance_keyframe_count"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, start_distance_keyframe_count) - 0usize];
    ["Offset of field: StagedefFogAnimHeader::start_distance_keyframe_list"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, start_distance_keyframe_list) - 4usize];
    ["Offset of field: StagedefFogAnimHeader::end_distance_keyframe_count"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, end_distance_keyframe_count) - 8usize];
    ["Offset of field: StagedefFogAnimHeader::end_distance_keyframe_list"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, end_distance_keyframe_list) - 12usize];
    ["Offset of field: StagedefFogAnimHeader::red_keyframe_count"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, red_keyframe_count) - 16usize];
    ["Offset of field: StagedefFogAnimHeader::red_keyframe_list"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, red_keyframe_list) - 20usize];
    ["Offset of field: StagedefFogAnimHeader::green_keyframe_count"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, green_keyframe_count) - 24usize];
    ["Offset of field: StagedefFogAnimHeader::green_keyframe_list"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, green_keyframe_list) - 28usize];
    ["Offset of field: StagedefFogAnimHeader::blue_keyframe_count"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, blue_keyframe_count) - 32usize];
    ["Offset of field: StagedefFogAnimHeader::blue_keyframe_list"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, blue_keyframe_list) - 36usize];
    ["Offset of field: StagedefFogAnimHeader::unk_keyframe_count"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, unk_keyframe_count) - 40usize];
    ["Offset of field: StagedefFogAnimHeader::unk_keyframe_list"]
        [::core::mem::offset_of!(StagedefFogAnimHeader, unk_keyframe_list) - 44usize];
};
pub type PStagedefAnimHeader = *mut StagedefAnimHeader;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefAnimHeader {
    pub rot_x_keyframe_count: u32_,
    pub rot_x_keyframe_list: *mut StagedefAnimKeyframe,
    pub rot_y_keyframe_count: u32_,
    pub rot_y_keyframe_list: *mut StagedefAnimKeyframe,
    pub rot_z_keyframe_count: u32_,
    pub rot_z_keyframe_list: *mut StagedefAnimKeyframe,
    pub pos_x_keyframe_count: u32_,
    pub pos_x_keyframe_list: *mut StagedefAnimKeyframe,
    pub pos_y_keyframe_count: u32_,
    pub pos_y_keyframe_list: *mut StagedefAnimKeyframe,
    pub pos_z_keyframe_count: u32_,
    pub pos_z_keyframe_list: *mut StagedefAnimKeyframe,
    pub field_0x30: [undefined; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefAnimHeader"][::core::mem::size_of::<StagedefAnimHeader>() - 64usize];
    ["Alignment of StagedefAnimHeader"][::core::mem::align_of::<StagedefAnimHeader>() - 1usize];
    ["Offset of field: StagedefAnimHeader::rot_x_keyframe_count"]
        [::core::mem::offset_of!(StagedefAnimHeader, rot_x_keyframe_count) - 0usize];
    ["Offset of field: StagedefAnimHeader::rot_x_keyframe_list"]
        [::core::mem::offset_of!(StagedefAnimHeader, rot_x_keyframe_list) - 4usize];
    ["Offset of field: StagedefAnimHeader::rot_y_keyframe_count"]
        [::core::mem::offset_of!(StagedefAnimHeader, rot_y_keyframe_count) - 8usize];
    ["Offset of field: StagedefAnimHeader::rot_y_keyframe_list"]
        [::core::mem::offset_of!(StagedefAnimHeader, rot_y_keyframe_list) - 12usize];
    ["Offset of field: StagedefAnimHeader::rot_z_keyframe_count"]
        [::core::mem::offset_of!(StagedefAnimHeader, rot_z_keyframe_count) - 16usize];
    ["Offset of field: StagedefAnimHeader::rot_z_keyframe_list"]
        [::core::mem::offset_of!(StagedefAnimHeader, rot_z_keyframe_list) - 20usize];
    ["Offset of field: StagedefAnimHeader::pos_x_keyframe_count"]
        [::core::mem::offset_of!(StagedefAnimHeader, pos_x_keyframe_count) - 24usize];
    ["Offset of field: StagedefAnimHeader::pos_x_keyframe_list"]
        [::core::mem::offset_of!(StagedefAnimHeader, pos_x_keyframe_list) - 28usize];
    ["Offset of field: StagedefAnimHeader::pos_y_keyframe_count"]
        [::core::mem::offset_of!(StagedefAnimHeader, pos_y_keyframe_count) - 32usize];
    ["Offset of field: StagedefAnimHeader::pos_y_keyframe_list"]
        [::core::mem::offset_of!(StagedefAnimHeader, pos_y_keyframe_list) - 36usize];
    ["Offset of field: StagedefAnimHeader::pos_z_keyframe_count"]
        [::core::mem::offset_of!(StagedefAnimHeader, pos_z_keyframe_count) - 40usize];
    ["Offset of field: StagedefAnimHeader::pos_z_keyframe_list"]
        [::core::mem::offset_of!(StagedefAnimHeader, pos_z_keyframe_list) - 44usize];
    ["Offset of field: StagedefAnimHeader::field_0x30"]
        [::core::mem::offset_of!(StagedefAnimHeader, field_0x30) - 48usize];
};
pub type PStagedefFileHeader = *mut StagedefFileHeader;
pub type PStagedefColiHeader = *mut StagedefColiHeader;
pub type PStagedefStart = *mut StagedefStart;
pub type PStagedefFallout = *mut StagedefFallout;
pub type PStagedefGoal = *mut StagedefGoal;
pub type PStagedefBumper = *mut StagedefBumper;
pub type PStagedefJamabar = *mut StagedefJamabar;
pub type PStagedefBanana = *mut StagedefBanana;
pub type PStagedefColiCone = *mut StagedefColiCone;
pub type PStagedefColiSphere = *mut StagedefColiSphere;
pub type PStagedefColiCylinder = *mut StagedefColiCylinder;
pub type PStagedefFalloutVolume = *mut StagedefFalloutVolume;
pub type PStagedefBackgroundModel = *mut StagedefBackgroundModel;
pub type PStagedefForegroundModel = *mut StagedefForegroundModel;
pub type PStagedefReflectiveStageModel = *mut StagedefReflectiveStageModel;
pub type PStagedefStageModelInstance = *mut StagedefStageModelInstance;
pub type PStagedefStageModelPtrA = *mut StagedefStageModelPtrA;
pub type PStagedefStageModelPtrB = *mut StagedefStageModelPtrB;
pub type PStagedefButton = *mut StagedefButton;
pub type PStagedefWormhole = *mut StagedefWormhole;
pub type PStagedefFog = *mut StagedefFog;
pub type PStagedefDynamicReflectionPlane = *mut StagedefDynamicReflectionPlane;
pub type PStagedefMystery3 = *mut StagedefMystery3;
pub const ANIM_LOOP: _bindgen_ty_58 = 0;
pub const ANIM_PLAY_ONCE: _bindgen_ty_58 = 1;
pub const ANIM_SEESAW: _bindgen_ty_58 = 2;
pub type _bindgen_ty_58 = ::core::ffi::c_uint;
pub type StagedefAnimType = undefined2;
pub type PStagedefColiTri = *mut StagedefColiTri;
pub type PStagedefMystery5 = *mut StagedefMystery5;
pub type PStagedefBackgroundAnim2Header = *mut StagedefBackgroundAnim2Header;
pub type PStagedefStageModel = *mut StagedefStageModel;
pub const GX_FOG_NONE: _bindgen_ty_59 = 0;
pub const GX_FOG_LIN: _bindgen_ty_59 = 2;
pub const GX_FOX_EXP: _bindgen_ty_59 = 4;
pub const GX_FOG_EXP2: _bindgen_ty_59 = 5;
pub const GX_FOG_REVEXP: _bindgen_ty_59 = 6;
pub const GX_FOG_REVEXP2: _bindgen_ty_59 = 7;
pub type _bindgen_ty_59 = ::core::ffi::c_uint;
pub type GXFogType = undefined1;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefStageModelInstance {
    pub stage_model_a: *mut StagedefStageModelPtrA,
    pub position: Vec,
    pub rotation: S16Vec,
    pub g_not_padding: undefined2,
    pub scale: Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefStageModelInstance"]
        [::core::mem::size_of::<StagedefStageModelInstance>() - 36usize];
    ["Alignment of StagedefStageModelInstance"]
        [::core::mem::align_of::<StagedefStageModelInstance>() - 1usize];
    ["Offset of field: StagedefStageModelInstance::stage_model_a"]
        [::core::mem::offset_of!(StagedefStageModelInstance, stage_model_a) - 0usize];
    ["Offset of field: StagedefStageModelInstance::position"]
        [::core::mem::offset_of!(StagedefStageModelInstance, position) - 4usize];
    ["Offset of field: StagedefStageModelInstance::rotation"]
        [::core::mem::offset_of!(StagedefStageModelInstance, rotation) - 16usize];
    ["Offset of field: StagedefStageModelInstance::g_not_padding"]
        [::core::mem::offset_of!(StagedefStageModelInstance, g_not_padding) - 22usize];
    ["Offset of field: StagedefStageModelInstance::scale"]
        [::core::mem::offset_of!(StagedefStageModelInstance, scale) - 24usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefBumper {
    pub position: Vec,
    pub rotation: S16Vec,
    pub padding: undefined2,
    pub scale: Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefBumper"][::core::mem::size_of::<StagedefBumper>() - 32usize];
    ["Alignment of StagedefBumper"][::core::mem::align_of::<StagedefBumper>() - 1usize];
    ["Offset of field: StagedefBumper::position"]
        [::core::mem::offset_of!(StagedefBumper, position) - 0usize];
    ["Offset of field: StagedefBumper::rotation"]
        [::core::mem::offset_of!(StagedefBumper, rotation) - 12usize];
    ["Offset of field: StagedefBumper::padding"]
        [::core::mem::offset_of!(StagedefBumper, padding) - 18usize];
    ["Offset of field: StagedefBumper::scale"]
        [::core::mem::offset_of!(StagedefBumper, scale) - 20usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefReflectiveStageModel {
    pub model_name: *mut ::core::ffi::c_char,
    pub g_model_header_ptr: *mut GmaModel,
    pub field_0x8: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefReflectiveStageModel"]
        [::core::mem::size_of::<StagedefReflectiveStageModel>() - 12usize];
    ["Alignment of StagedefReflectiveStageModel"]
        [::core::mem::align_of::<StagedefReflectiveStageModel>() - 1usize];
    ["Offset of field: StagedefReflectiveStageModel::model_name"]
        [::core::mem::offset_of!(StagedefReflectiveStageModel, model_name) - 0usize];
    ["Offset of field: StagedefReflectiveStageModel::g_model_header_ptr"]
        [::core::mem::offset_of!(StagedefReflectiveStageModel, g_model_header_ptr) - 4usize];
    ["Offset of field: StagedefReflectiveStageModel::field_0x8"]
        [::core::mem::offset_of!(StagedefReflectiveStageModel, field_0x8) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefFallout {
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefFallout"][::core::mem::size_of::<StagedefFallout>() - 4usize];
    ["Alignment of StagedefFallout"][::core::mem::align_of::<StagedefFallout>() - 1usize];
    ["Offset of field: StagedefFallout::y"][::core::mem::offset_of!(StagedefFallout, y) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefButton {
    pub position: Vec,
    pub rotation: S16Vec,
    pub playback_state: PlaybackState,
    pub anim_group_id: u16_,
    pub padding: undefined2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefButton"][::core::mem::size_of::<StagedefButton>() - 24usize];
    ["Alignment of StagedefButton"][::core::mem::align_of::<StagedefButton>() - 1usize];
    ["Offset of field: StagedefButton::position"]
        [::core::mem::offset_of!(StagedefButton, position) - 0usize];
    ["Offset of field: StagedefButton::rotation"]
        [::core::mem::offset_of!(StagedefButton, rotation) - 12usize];
    ["Offset of field: StagedefButton::playback_state"]
        [::core::mem::offset_of!(StagedefButton, playback_state) - 18usize];
    ["Offset of field: StagedefButton::anim_group_id"]
        [::core::mem::offset_of!(StagedefButton, anim_group_id) - 20usize];
    ["Offset of field: StagedefButton::padding"]
        [::core::mem::offset_of!(StagedefButton, padding) - 22usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefDynamicReflectionPlane {
    pub model_name_ptr: *mut ::core::ffi::c_char,
    pub pos: Vec,
    pub rot: S16Vec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefDynamicReflectionPlane"]
        [::core::mem::size_of::<StagedefDynamicReflectionPlane>() - 22usize];
    ["Alignment of StagedefDynamicReflectionPlane"]
        [::core::mem::align_of::<StagedefDynamicReflectionPlane>() - 1usize];
    ["Offset of field: StagedefDynamicReflectionPlane::model_name_ptr"]
        [::core::mem::offset_of!(StagedefDynamicReflectionPlane, model_name_ptr) - 0usize];
    ["Offset of field: StagedefDynamicReflectionPlane::pos"]
        [::core::mem::offset_of!(StagedefDynamicReflectionPlane, pos) - 4usize];
    ["Offset of field: StagedefDynamicReflectionPlane::rot"]
        [::core::mem::offset_of!(StagedefDynamicReflectionPlane, rot) - 16usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefStageModel {
    pub field_0x0: [undefined; 4usize],
    pub model_name: *mut ::core::ffi::c_char,
    pub some_flag: uint,
    pub field_0xc: [undefined; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefStageModel"][::core::mem::size_of::<StagedefStageModel>() - 16usize];
    ["Alignment of StagedefStageModel"][::core::mem::align_of::<StagedefStageModel>() - 1usize];
    ["Offset of field: StagedefStageModel::field_0x0"]
        [::core::mem::offset_of!(StagedefStageModel, field_0x0) - 0usize];
    ["Offset of field: StagedefStageModel::model_name"]
        [::core::mem::offset_of!(StagedefStageModel, model_name) - 4usize];
    ["Offset of field: StagedefStageModel::some_flag"]
        [::core::mem::offset_of!(StagedefStageModel, some_flag) - 8usize];
    ["Offset of field: StagedefStageModel::field_0xc"]
        [::core::mem::offset_of!(StagedefStageModel, field_0xc) - 12usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefColiSphere {
    pub position: Vec,
    pub radius: f32,
    pub g_not_padding: undefined4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefColiSphere"][::core::mem::size_of::<StagedefColiSphere>() - 20usize];
    ["Alignment of StagedefColiSphere"][::core::mem::align_of::<StagedefColiSphere>() - 1usize];
    ["Offset of field: StagedefColiSphere::position"]
        [::core::mem::offset_of!(StagedefColiSphere, position) - 0usize];
    ["Offset of field: StagedefColiSphere::radius"]
        [::core::mem::offset_of!(StagedefColiSphere, radius) - 12usize];
    ["Offset of field: StagedefColiSphere::g_not_padding"]
        [::core::mem::offset_of!(StagedefColiSphere, g_not_padding) - 16usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefColiCylinder {
    pub position: Vec,
    pub radius: f32,
    pub height: f32,
    pub rotation: S16Vec,
    pub g_not_padding: undefined2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefColiCylinder"][::core::mem::size_of::<StagedefColiCylinder>() - 28usize];
    ["Alignment of StagedefColiCylinder"][::core::mem::align_of::<StagedefColiCylinder>() - 1usize];
    ["Offset of field: StagedefColiCylinder::position"]
        [::core::mem::offset_of!(StagedefColiCylinder, position) - 0usize];
    ["Offset of field: StagedefColiCylinder::radius"]
        [::core::mem::offset_of!(StagedefColiCylinder, radius) - 12usize];
    ["Offset of field: StagedefColiCylinder::height"]
        [::core::mem::offset_of!(StagedefColiCylinder, height) - 16usize];
    ["Offset of field: StagedefColiCylinder::rotation"]
        [::core::mem::offset_of!(StagedefColiCylinder, rotation) - 20usize];
    ["Offset of field: StagedefColiCylinder::g_not_padding"]
        [::core::mem::offset_of!(StagedefColiCylinder, g_not_padding) - 26usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefBackgroundModel {
    pub g_model_flag: uint,
    pub model_name: *mut ::core::ffi::c_char,
    pub gma_model: *mut GmaModel,
    pub position: Vec,
    pub rotation: S16Vec,
    pub padding: undefined2,
    pub scale: Vec,
    pub background_anim_header: *mut StagedefBackgroundAnimHeader,
    pub background_anim2_header: *mut StagedefBackgroundAnim2Header,
    pub effect_header: *mut StagedefEffectHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefBackgroundModel"]
        [::core::mem::size_of::<StagedefBackgroundModel>() - 56usize];
    ["Alignment of StagedefBackgroundModel"]
        [::core::mem::align_of::<StagedefBackgroundModel>() - 1usize];
    ["Offset of field: StagedefBackgroundModel::g_model_flag"]
        [::core::mem::offset_of!(StagedefBackgroundModel, g_model_flag) - 0usize];
    ["Offset of field: StagedefBackgroundModel::model_name"]
        [::core::mem::offset_of!(StagedefBackgroundModel, model_name) - 4usize];
    ["Offset of field: StagedefBackgroundModel::gma_model"]
        [::core::mem::offset_of!(StagedefBackgroundModel, gma_model) - 8usize];
    ["Offset of field: StagedefBackgroundModel::position"]
        [::core::mem::offset_of!(StagedefBackgroundModel, position) - 12usize];
    ["Offset of field: StagedefBackgroundModel::rotation"]
        [::core::mem::offset_of!(StagedefBackgroundModel, rotation) - 24usize];
    ["Offset of field: StagedefBackgroundModel::padding"]
        [::core::mem::offset_of!(StagedefBackgroundModel, padding) - 30usize];
    ["Offset of field: StagedefBackgroundModel::scale"]
        [::core::mem::offset_of!(StagedefBackgroundModel, scale) - 32usize];
    ["Offset of field: StagedefBackgroundModel::background_anim_header"]
        [::core::mem::offset_of!(StagedefBackgroundModel, background_anim_header) - 44usize];
    ["Offset of field: StagedefBackgroundModel::background_anim2_header"]
        [::core::mem::offset_of!(StagedefBackgroundModel, background_anim2_header) - 48usize];
    ["Offset of field: StagedefBackgroundModel::effect_header"]
        [::core::mem::offset_of!(StagedefBackgroundModel, effect_header) - 52usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefStageModelPtrA {
    pub some_effect_bitflag: StageModelEffectBitfield,
    pub some_counter: uint,
    pub stage_model: *mut StagedefStageModel,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefStageModelPtrA"][::core::mem::size_of::<StagedefStageModelPtrA>() - 12usize];
    ["Alignment of StagedefStageModelPtrA"]
        [::core::mem::align_of::<StagedefStageModelPtrA>() - 1usize];
    ["Offset of field: StagedefStageModelPtrA::some_effect_bitflag"]
        [::core::mem::offset_of!(StagedefStageModelPtrA, some_effect_bitflag) - 0usize];
    ["Offset of field: StagedefStageModelPtrA::some_counter"]
        [::core::mem::offset_of!(StagedefStageModelPtrA, some_counter) - 4usize];
    ["Offset of field: StagedefStageModelPtrA::stage_model"]
        [::core::mem::offset_of!(StagedefStageModelPtrA, stage_model) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefStageModelPtrB {
    pub stage_model_a: *mut StagedefStageModelPtrA,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefStageModelPtrB"][::core::mem::size_of::<StagedefStageModelPtrB>() - 4usize];
    ["Alignment of StagedefStageModelPtrB"]
        [::core::mem::align_of::<StagedefStageModelPtrB>() - 1usize];
    ["Offset of field: StagedefStageModelPtrB::stage_model_a"]
        [::core::mem::offset_of!(StagedefStageModelPtrB, stage_model_a) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefBanana {
    pub position: Vec,
    pub type_: BananaType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StagedefBanana"][::core::mem::size_of::<StagedefBanana>() - 16usize];
    ["Alignment of StagedefBanana"][::core::mem::align_of::<StagedefBanana>() - 1usize];
    ["Offset of field: StagedefBanana::position"]
        [::core::mem::offset_of!(StagedefBanana, position) - 0usize];
    ["Offset of field: StagedefBanana::type_"]
        [::core::mem::offset_of!(StagedefBanana, type_) - 12usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct StagedefMystery5 {
    pub field_0x0: [undefined; 4usize],
